[
  {
    "author": "Michael Greenlee",
    "pages": 528,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed2e089337.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-93903-1",
    "download_link_pdf": "http://file.allitebooks.com/20150615/Professional Unified Communications.pdf",
    "year": "2011",
    "language": "English",
    "price": 132,
    "description": "Unified Communications (UC) integrates real-time communications (telephony, video conferencing, speech recognition) with non real-time communication (voicemail, e-mail, fax) to unify users across multiple devices and media types. This book offers practical development advice based on the authorsexperiences developing solutions on the UC platform. You ll discover how to solve problems and get answers to common questions that you may encounter while developing solutions with the UC APIs.",
    "name": "Professional Unified Communications",
    "category": "Communications"
  },
  {
    "author": "Milos Vucetic",
    "pages": 178,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed2f5014ce.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84969-416-2",
    "download_link_pdf": "http://file.allitebooks.com/20150615/Learning Adobe Connect 9.pdf",
    "year": "2013",
    "language": "English",
    "price": 41,
    "description": "Modern world organizations require effective collaboration in order to improve productivity. Conferencing tools enable users to increase their productivity and improve communication with their functionalities that include interactive experiences supported by multiple features. One of the most advanced conferencing tools and the market leader is Adobe Connect. It is a great tool that will help you organize and present your content in the most efficient manner possible while capturing the audience with rich and engaging presentations.\nLearning Adobe Connect 9 is a practical, hands-on guide that provides you with a number of clear, step-by-step exercises that will help you take advantage of the real power that is behind Adobe Connect.",
    "name": "Learning Adobe Connect 9",
    "category": "Communications"
  },
  {
    "author": "Daniel Jonathan Valik",
    "pages": 224,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed2efd4089.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-506-1",
    "download_link_pdf": "http://file.allitebooks.com/20150615/Microsoft Lync 2013 Unified Communications.pdf",
    "year": "2013",
    "language": "English",
    "price": 163,
    "description": "Unified Communications brings all relevant types of communication technology and modalities together: telephony, chat, availability information, video, sharing, and the integration into line of business software.\nMicrosoft Lync 2013 Unified Communications is a business and technology book combined into one about Unified Communications and it shares everything you need to know: how to evaluate and integrate a Unified Communications project in your own company and how you plan, design, and implement the technology itself. Additionally you get to know current innovations and available technologies for social networking, collaboration, cloud services, contact centers, and also enhanced collaboration for mobile devices. This book also offers a real business case of a transformational project from traditional telecommunications to Unified Communications and what business case you can realize for all business sizes.",
    "name": "Microsoft Lync 2013 Unified Communications",
    "category": "Communications"
  },
  {
    "author": "Lasse Nordvik Wedo",
    "pages": 392,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed2fa3022d.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78217-347-2, 1782173471",
    "download_link_pdf": "http://file.allitebooks.com/20150615/Lync Server Cookbook.pdf",
    "year": "2015",
    "language": "English",
    "price": 107,
    "description": "This book begins with the fundamental security-related tasks you should be aware of when working with Lync, before moving on to walk you through the authentication mechanisms. You will get hands-on experience with the steps required to integrate Lync with Office 365, Exchange, or trusted forests. You will explore how to use various tools such as the Bandwidth calculator, Lync resource kit tools, stress and performance tools, and planning tools that will help you to manage complex Lync features such as enterprise voice. This book will take you through designing a Lync solution right from assessing the existing infrastructure and capturing the requirements through to planning for user-training. Finally, the book concludes by showing you how to control and manage your networks and introduces you to various debugging tools such as Wireshark, CLSController, and more. The book aims at empowering you to successfully manage your Lync deployments with ease.",
    "name": "Lync Server Cookbook",
    "category": "Communications"
  },
  {
    "author": "Richard G. Ellis",
    "pages": 344,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed2e5a24ee.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-8496-8240-4",
    "download_link_pdf": "http://file.allitebooks.com/20150615/IBM Lotus Domino.pdf",
    "year": "2011",
    "language": "English",
    "price": 35,
    "description": "Classic techniques used for Web-enabling traditional Domino applications. Demonstrates how to incorporate HTML, CSS and JavaScript into designs. Offers tips and suggestions for testing, debugging, and troubleshooting. Organized, easy to read, and well-illustrated, with numerous code examples. Instructions valid for Domino versions 6, 7, and 8.",
    "name": "IBM Lotus Domino",
    "category": "Communications"
  },
  {
    "author": "Ron DuPlain",
    "pages": 78,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1438/0755bc5bd7919a2.jpeg",
    "download_link_epub": null,
    "ISBN": "1782169628",
    "download_link_pdf": "http://file.allitebooks.com/20150731/Instant Flask Web Development.pdf",
    "year": "2013",
    "language": "English",
    "price": 148,
    "description": "Flask is a web framework for Python, which lets you start simply and grow carefully without facing any issues with the framework as your project gets large. Flask integrates Werkzeug (a web programming toolkit) and Jinja (a templating engine) and adds a layer that lets you build web applications and services in a compact way, while letting you choose your own tools.\nInstant Flask Web Development takes you beyond the quick start in the Flask documentation and shows you a bottom-up approach to organizing your Flask application. It shows you how to build a small deployable scheduling application with pointers to the various design decisions you can make when developing with Flask.\nInstant Flask Web Development lets you set up your development environment and learn how Flask handles web requests, then shows you how to build a functional data-driven web application that is ready to publish, by adding one layer at a time. When working with Flask, you can work with Python and utilize its best tools for the job. The book will help you build the layers of a simple application: URL routes with Flask, a database with SQLAlchemy, form validation with WTForms, user authentication and sessions, page layout with Twitter Bootstrap, and browser code with jQuery.\nThis book promises to get you up and running on your first Flask app, so that you can use Flask and Python on your next web project.",
    "name": "Instant Flask Web Development",
    "category": "Enterprise"
  },
  {
    "author": "Jayaraman Kalaimani",
    "pages": 325,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1453/8156a3e472dcea6.jpeg",
    "download_link_epub": null,
    "ISBN": "1484213904",
    "download_link_pdf": "http://file.allitebooks.com/20160123/SAP Project Management Pitfalls.pdf",
    "year": "2015",
    "language": "English",
    "price": 161,
    "description": "Master the SAP product ecosystem, the client environment, and the feasibility of implementing critical business process with the required technical and functional configuration. SAP Project Management Pitfalls is the first book to provide you with real examples of the pitfalls that you can avoid, providing you with a road-map to a successful implementation.\nJay Kay, a SAP Program Manager for Capgemini, first takes a deep dive into common pitfalls in implementing SAP ERP projects in a complex IT landscape. You will learn about the potential causes of failures, a comparative study of relevant project implementation case studies in the area, and a range of possible countermeasures. Jay Kay also provides background on eachthe significance of each implementation area, its relevance to a service company that implements SAP projects, and the current state of research.\nKey highlights of the book:Tools and techniques for project planning and templates for allocating resources\nIndustry standards and innovations in SAP implementation projects in the form of standard solutions aimed at successful implementation\nManaging SAP system ECC upgrades, EHP updates and project patches\nLearn effective ways to implement robust SAP release management practices (change management, BAU)Wearing a practitioner’s insight, Jay Kay explores the relevance of each failed implementation scenario and how to support your company or clients to succeed in a SAP implementation. There are many considerations when implementing SAP, but as you will learn, knowledge, insight, and effective tools to mitigate risks―all of which this book provides―can take you to a successful implementation project.",
    "name": "SAP Project Management Pitfalls",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Tim Speed",
    "pages": 364,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed2eab7057.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-394-4",
    "download_link_pdf": "http://file.allitebooks.com/20150615/IBM Lotus Notes and Domino 8.5.3 Upgrader-s Guide.pdf",
    "year": "2012",
    "language": "English",
    "price": 173,
    "description": "IBM Lotus Domino software is a world class platform for critical business, collaboration, and messaging applications. With Lotus Notes and Domino 8.5.3, IBM has once again provided business users with an intuitive, fully integrated platform to enhance each user s experience with business communications, while reducing Total Cost of Ownership (TCO) and increasing Return on Investment (ROI). You can create and share information effectively to make quick business decisions and streamline the way individuals and teams work. It is no longer just an email tool, but a means of extending business communications to a new level. In order to utilize all the powerful features of the new release, you need to upgrade your existing system to Lotus Notes and Domino 8.5.3.",
    "name": "IBM Lotus Notes and Domino 8.5.3: Upgrader&#8217;s Guide",
    "category": "Communications"
  },
  {
    "author": "Andrew Okungbowa",
    "pages": 596,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1436/32559fbe85b0c07.jpeg",
    "download_link_epub": null,
    "ISBN": "978-1484207178",
    "download_link_pdf": "http://file.allitebooks.com/20150710/SAP ERP Financial Accounting and Controlling- Configuration and Use Management.pdf",
    "year": "2015",
    "language": "English",
    "price": 187,
    "description": "SAP ERP modules are notoriously hard to configure and use effectively without a lot of practice and experience. But as SAP ERP Financial Accounting and Controlling: Configuration and Use Management shows, it doesn t have to be so difficult. The book takes a systematic approach that leads SAP Financial Accounting and Controlling (FICO) users step by step through configuring and using all the program’s facets. This approach makes configuration complexities manageable. The book’s author—SAP expert, trainer, and accountant Andrew Okungbowa—ensures that both you and your end users are up and running quickly and confidently with FICO. He also provides sound and tested procedures that ensure your implementation works without error.\nSAP ERP Financial Accounting and Controlling: Configuration and Use Management is in fact the most comprehensive and easy-to-follow SAP FICO configuration book in the market. It incorporates a hands-on approach, with hundreds of screen shots and practical examples, that allows a person without prior configuration training to make SAP FICO ready for use in the enterprise. You’ll find that you don’t need to be a rocket scientist to grasp the concepts explained and apply them to your work—even when the finances are complicated, such as with the ins and outs of taxes, currency conversions, or special general ledger entries such as down payments or bills of exchange.\nProviding an in-depth coverage of both configuration and end user procedures, the book covers most aspects of the SAP FICO certification syllabus—SAP’s view of the module’s key tasks and procedures—including:\nConfiguring and using the general ledger and accounts payable and receivable screens<br />\nConfiguring and completing closing procedures, asset accounting, and financial reporting<br />\nConfiguring global settings and enterprise variables<br />\nAccounting for both profit and cost centers<br />\nCreating a house bank<br />\nIntegrating FICO with other SAP modules<br />\nTaking a jargon-free tone and providing an abundance of examples, Andrew Okungbowa provides a clear understanding of configuration techniques and the breadth of functionalities encompassed by SAP FICO. And as an accountant, Okungbowa understands the needs of end users as well as of those answering to the CIO.",
    "name": "SAP ERP Financial Accounting and Controlling",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Sven Ringling",
    "pages": 630,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1436/85559a722a95fae.jpeg",
    "download_link_epub": null,
    "ISBN": "978-1592290505",
    "download_link_pdf": "http://file.allitebooks.com/20150706/Mastering HR Management with SAP.pdf",
    "year": "2005",
    "language": "English",
    "price": 52,
    "description": "Get a step-by-step guide to the entire personnel management process, from recruiting, to personnel controlling, and beyond.\nThis book comes complete with practical examples regarding user roles, and covers all of the new enhancements, improved features and tools that have been introduced with R/3 Enterprise. Uncover the ins and outs of e-recruiting, organizational management, personnel administration, payroll, benefits, quality assurance, rolebased portals, and many others too numerous to list.\nThe book, based on release 4.7 (R/3 Enterprise), also contains information on mySAP ERP (HCM).\nHighlights include:\nSAP HR in the Project<br />\nPersonnel Administration: Master Data Maintenance, Infotypes, Workflows, and much more<br />\nOrganizational Management<br />\nRecruiting and E-Recruiting<br />\nTime Management<br />\nPayroll<br />\nBenefits<br />\nPersonnel Controlling. Reports, SAP BW and SEM<br />\nQuality Assurance<br />\nRole-Based Portal Solution. ESS, MSS, Manager’s Desktop<br />\nIntegration with Personnel Planning",
    "name": "Mastering HR Management with SAP",
    "category": "Enterprise"
  },
  {
    "author": "Nishant Garg",
    "pages": 112,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/00557aa2307bbcd.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78439-309-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Learning Apache Kafka, 2nd Edition.pdf",
    "year": "2015",
    "language": "English",
    "price": 74,
    "description": "Kafka is one of those systems that is very simple to describe at a high level but has an incredible depth of technical detail when you dig deeper.\nLearning Apache Kafka Second Edition provides you with step-by-step, practical examples that help you take advantage of the real power of Kafka and handle hundreds of megabytes of messages per second from multiple clients. This book teaches you everything you need to know, right from setting up Kafka clusters to understanding basic blocks like producer, broker, and consumer blocks. Once you are all set up, you will then explore additional settings and configuration changes to achieve ever more complex goals. You will also learn how Kafka is designed internally and what configurations make it more effective. Finally, you will learn how Kafka works with other tools such as Hadoop, Storm, and so on.",
    "name": "Learning Apache Kafka, 2nd Edition",
    "category": "Messaging"
  },
  {
    "author": "David Byrd",
    "pages": 336,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed2db80739.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84719-928-7",
    "download_link_pdf": "http://file.allitebooks.com/20150615/IBM Lotus Notes and Domino 8.5.1.pdf",
    "year": "2010",
    "language": "English",
    "price": 91,
    "description": "Upgrade to the latest version of Lotus Notes and Domino. Understand the new features and put them to work in your business. Thoroughly covers Domino Attachment Object Service (DAOS), Domino Configuration Tuner (DCT), and iNotes. Explore other useful Lotus products, such as Lotus Sametime, Lotus Quickr, Lotus Connections, and IBM WebSphere Portal. Packed with expert tips and useful screenshots.",
    "name": "IBM Lotus Notes and Domino 8.5.1",
    "category": "Communications"
  },
  {
    "author": "Yoav Yahav",
    "pages": 380,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed1eeb29fa.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78217-243-7, 1782172432",
    "download_link_pdf": "http://file.allitebooks.com/20150615/SAP BusinessObjects Reporting Cookbook.pdf",
    "year": "2014",
    "language": "English",
    "price": 91,
    "description": "This book will educate you on the best practices in SAP BusinessObjects reporting and analysis, including how to create enhanced report formatting and synchronize data sources in simple and easy ways.\nThe book starts by introducing a working Web Intelligence environment and its capabilities. Next, it moves on to creating queries, working with the formatting components, and explaining how to work with different types of data presentation such as tables and charts. The book then guides you through the main report functionality such as using filters, sorts, and calculations; merging data; and using formulas. The book also explains how to work with advanced features such as drills and hyperlinks.\nThis book will take you from the most basic level of how to build a query and elementary concepts such as the nature of data to the most advanced and updated reporting and formatting techniques.",
    "name": "SAP BusinessObjects Reporting Cookbook",
    "category": "Business Applications"
  },
  {
    "author": "Dino Esposito",
    "pages": 472,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed1e43055b.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-7356-6302-2",
    "download_link_pdf": "http://file.allitebooks.com/20150615/Architecting Mobile Solutions for the Enterprise.pdf",
    "year": "2012",
    "language": "English",
    "price": 130,
    "description": "Your guide to planning and executing a complete mobile web strategy.\nRevisit your approach to the mobile weband deliver effective solutions that reach customers and clients on a variety of mobile devices. In this practical guide, web development luminary Dino Esposito shows you how to develop a solid mobile strategy for the enterprise, starting with an effective mobile website. You ll receive essential architectural and implementation guidance, as well as mobile-specific design patterns for building cross-platform and native applications.",
    "name": "Architecting Mobile Solutions for the Enterprise",
    "category": "Business Applications"
  },
  {
    "author": "Tim Fox",
    "pages": 736,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed1cf16dcd.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-3494-4",
    "download_link_pdf": "http://file.allitebooks.com/20150615/Pro Oracle Application Express 4, 2nd Edition.pdf",
    "year": "2011",
    "language": "English",
    "price": 54,
    "description": "Pro Oracle Application Express 4 is your key to mastering one of the most innovative products to come out of Oracle in years. Application Express, termedAPEXfor short, is fast becoming one of the easiest and most widely-used of tools for creating enterprise-level applications that run against an Oracle database. APEX is easy enough for power users to create ad-hoc applications atop something more reliable than a spreadsheet. Yet APEX is powerful and extensible enough to enable fully-scalable, enterprise-level applications that are accessed by thousands of users.",
    "name": "Pro Oracle Application Express 4, 2nd Edition",
    "category": "Business Applications"
  },
  {
    "author": "Mark Lancaster",
    "pages": 392,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed1d494cbe.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-106-3",
    "download_link_pdf": "http://file.allitebooks.com/20150615/Oracle Application Express 4.0 with Ext JS.pdf",
    "year": "2011",
    "language": "English",
    "price": 95,
    "description": "Build robust, feature-rich web applications using Oracle APEX and Ext JS. Add more sophisticated components and functionality to an Oracle APEX application using Ext JS. Build your own themes based on Ext JS into APEXdeveloping templates for regions, labels, and lists. Create plug-ins in your application workspace to enhance the existing built-in functionality of your APEX applications. Extend native APEX functionality using Ext JS Widgets and Components through Plug-ins and Dynamic Actions. Written in clear, plain English, this book is packed with working examples and innovative tips.",
    "name": "Oracle Application Express 4.0 with Ext JS",
    "category": "Business Applications"
  },
  {
    "author": "Rich Helton",
    "pages": 214,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/00557aa22b8b285.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78217-349-6, 1782173498",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Learning NServiceBus Sagas.pdf",
    "year": "2015",
    "language": "English",
    "price": 52,
    "description": "NServiceBus (NSB) is the most popular Enterprise Service Bus (ESB) for C#. This learning guide will equip you with the skills to develop and design NSB sagas and NSB messaging. The first few chapters will discuss the basics of SOA, gradually leading you into the detailed topics of NSB.\nIn the next chapters, NSB platform services will be covered for monitoring, designing in Visual Studio, and operational pulses on NSB. Many example architectures will be explained using ASP.NET Model-View-Controllers, Entity Frameworks, NHibernate, MSMQ, RabbitMQ, SQL Server queues, ActiveMQ, and MongoDB. Finally, endpoints will be extended using sagas to integrate them into secure protocols such as Secure File Transfer Protocol (SFTP) and C# web services.\nBy the end of this book, you will be able to design, build, and test NServiceBus sagas and perform message handling.",
    "name": "Learning NServiceBus Sagas",
    "category": "Messaging"
  },
  {
    "author": "Sharon Kennedy",
    "pages": 620,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed1df173a1.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-3512-5",
    "download_link_pdf": "http://file.allitebooks.com/20150615/Expert Oracle Application Express.pdf",
    "year": "2011",
    "language": "English",
    "price": 39,
    "description": "Expert Oracle Application Express brings you groundbreaking insights into developing with Oracle s enterprise-level, rapid-development tool from some of the best practitioners in the field today. Oracle Application Express (APEX) is an entirely web-based development framework that is built into every edition of Oracle Database. The framework rests upon Oracle s powerful PL/SQL language, enabling power users and developers to rapidly develop applications that easily scale to hundreds, even thousands of concurrent users.",
    "name": "Expert Oracle Application Express",
    "category": "Business Applications"
  },
  {
    "author": "Edmund Zehoo",
    "pages": 356,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed1d9aea2f.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-3506-4",
    "download_link_pdf": "http://file.allitebooks.com/20150615/Oracle Application Express 4 Recipes.pdf",
    "year": "2011",
    "language": "English",
    "price": 54,
    "description": "Oracle Application Express 4 Recipes provides an example-based approach to learning Application Expressthe ground-breaking, rapid application development platform included with every Oracle Database license. The recipes format is ideal for the quick-study who just wants a good example or two to kick start their thinking and get pointed in the right direction.\nThe recipes cover the gamut of Application Express development. Author and Application Express expert Edmund Zehoo shows how to create data entry screens, visualize data in the form of reports and charts, implement validation and back-end logic, and much more. Solutions are presented in an easy problem / solution format, which you can copy and adapt for your own use. Detailed discussion for each solution deepens your understanding and aids in customizing the solutions to fit your particular development challenges.",
    "name": "Oracle Application Express 4 Recipes",
    "category": "Business Applications"
  },
  {
    "author": "Benjamin Bahrenburg",
    "pages": 328,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/74557ed1e94f8b5.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84969-534-3",
    "download_link_pdf": "http://file.allitebooks.com/20150615/Appcelerator Titanium Business Application Development Cookbook.pdf",
    "year": "2013",
    "language": "English",
    "price": 51,
    "description": "The demand for Mobile in the Enterprise has never been greater. While meeting this demand is becoming increasingly business critical, the complexities of development are amplified by the explosion in the number and variety of devices and platforms. Appcelerator s Titanium Mobile Platform stands out for its rapid development speed, large number of APIs, and focus on providing a native experience. This ability to rapidly provide business value in a cross-platform way makes Titanium a compelling platform for the creation of Enterprise applications.\nAppcelerator Titanium Business Application Development Cookbook is your complete guide to creating business applications. From building a unique user experience to securing your application, this book covers every aspect of business application development.",
    "name": "Appcelerator Titanium Business Application Development Cookbook",
    "category": "Business Applications"
  },
  {
    "author": "David Dossot",
    "pages": 182,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/00557aa2177ce8a.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78398-320-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/RabbitMQ Essentials.pdf",
    "year": "2014",
    "language": "English",
    "price": 99,
    "description": "RabbitMQ is above all other forms of message queuing software thanks to its loosely coupled architecture and its ability to bind multiple languages, making modern web applications secure, scalable, and simple to maintain.\nArmed with this supportive guide, you now have the opportunity to get stuck into developing your own message-based applications immediately with RabbitMQ. Using the fictitious Clever Coney Media as a case study, you will follow their journey of developing with RabbitMQ, from implementing simple, synchronous get operations to using advanced message routing and tracking the messaging application. With RabbitMQ Essentials, you will observe how using message queuing software can streamline the development of your own distributed and scalable applications.",
    "name": "RabbitMQ Essentials",
    "category": "Messaging"
  },
  {
    "author": "David Boike",
    "pages": 204,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/00557aa2268bed7.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78439-292-5, 1784392928",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Learning NServiceBus, 2nd Edition.pdf",
    "year": "2015",
    "language": "English",
    "price": 68,
    "description": "Building complex software systems is hard, but it doesn t have to be! NServiceBus is a powerful, yet lightweight, open source messaging framework used to design distributed .NET enterprise systems. Entirely pluggable, yet simple to use, it can help you apply the principles of messaging and SOA to build robust, scalable, and maintainable systems.\nThis book is an essential guide that will help you become a messaging guru. From sending a simple message, to publishing events, to implementing complex long-running business processes, you ll learn everything you need to know to start building complex software systems in no time.",
    "name": "Learning NServiceBus, 2nd Edition",
    "category": "Messaging"
  },
  {
    "author": "Karthik Bharathy",
    "pages": 180,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/00557aa221803fb.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78217-740-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Getting Started with BizTalk Services.pdf",
    "year": "2014",
    "language": "English",
    "price": 30,
    "description": "BizTalk Services is a service based on Windows Azure that was introduced by Microsoft in the summer of 2013. It provides integration capabilities in the cloud to connect enterprises together in scalable and flexible ways that go beyond what traditional on-premises integration products (such as BizTalk Server) can manage. BizTalk Services provides the ability to construct integration solutions using familiar tools (Visual Studio and Microsoft .Net) and also provides a bridge metaphor to connect applications and technologies.\nWhether you are a neophyte or an expert in integration solutions, Getting Started with BizTalk Services provides you with a comprehensive look at cloud integration, covering the many features and capabilities of BizTalk Services. More importantly, the purpose of each feature is explained together with how to use them effectively.",
    "name": "Getting Started with BizTalk Services",
    "category": "Messaging"
  },
  {
    "author": "Vikas Bhardwaj",
    "pages": 208,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/00557aa21c7dd87.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-6764-5",
    "download_link_pdf": "http://file.allitebooks.com/20150612/HL7 for BizTalk.pdf",
    "year": "2014",
    "language": "English",
    "price": 90,
    "description": "HL7 for BizTalk provides a detailed guide to the planning and delivery of a HL7-compliant system using the dedicated Microsoft BizTalk for HL7 Accelerator. The HL7 Primary Standard, its various versions, and the use of the HL7 Accelerator for BizTalk are broken out and fully explained. HL7 for BizTalk provides clear guidance on the specific healthcare scenarios that HL7 is designed to overcome and provides working case study models of how HL7 solutions can be implemented in BizTalk, deployed in practice and monitored during operation. Special emphasis is given in this book to the BizTalk reporting functionality and its use to provide HL7 oversight within organizations. HL7 for BizTalk is suitable for use with BizTalk versions from 2006 R2 to 2013 R2 to suit the reader s organization. All three versions of the HL7 standard and their differences, are explained.",
    "name": "HL7 for BizTalk",
    "category": "Messaging"
  },
  {
    "author": "Alexis Richardson",
    "pages": 312,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/00557aa1fee0769.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-9351-8297-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/RabbitMQ in Action.pdf",
    "year": "2012",
    "language": "English",
    "price": 35,
    "description": "RabbitMQ in Action is a fast-paced run through building and managing scalable applications using the RabbitMQ messaging server. It starts by explaining how message queuing works, its history, and how RabbitMQ fits in. Then it shows you real-world examples you can apply to your own scalability and interoperability challenges.\nRabbitMQ in Action teaches you to build and manage scalable applications in multiple languages using the RabbitMQ messaging server. It s a snap to get started. You ll learn how message queuing works and how RabbitMQ fits in. Then, you ll explore practical scalability and interoperability issues through many examples. By the end, you ll know how to make Rabbit run like a well-oiled machine in a 24x7x365 environment.\nWritten for developers familiar with Python, PHP, Java, .NET, or any other modern programming language. No RabbitMQ experience required.",
    "name": "RabbitMQ in Action",
    "category": "Messaging"
  },
  {
    "author": "Stephen Moss",
    "pages": 350,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557aa01b2d1a4.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78217-245-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Force.com Development Blueprints.pdf",
    "year": "2014",
    "language": "English",
    "price": 199,
    "description": "No one can dispute the sheer power and breadth of the Force.com cloud development platform and its influence on thousands of developers across the world. The staggering number of technologies on offer can cause confusion among developers when it comes to using them to build real-world applications.\nStarting with how to develop a Salesforce community, you will begin a whirlwind tour across the Force.com platform, using it to build applications for the e-commerce, CRM, reporting, and mobile subject domains.",
    "name": "Force.com Development Blueprints",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Faruk Akgul",
    "pages": 108,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/00557aa203e166d.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78216-104-2",
    "download_link_pdf": "http://file.allitebooks.com/20150612/ZeroMQ.pdf",
    "year": "2013",
    "language": "English",
    "price": 75,
    "description": "ØMQ (also spelled ZeroMQ, 0MQ, or ZMQ) is a high-performance asynchronous messaging library aimed at use in scalable distributed or concurrent applications. It provides a message queue, but unlike message-oriented middleware, a ØMQ system can run without a dedicated message broker. The library is designed to have a familiar socket-style API.\nZeroMQ teaches you to use ZeroMQ through examples in C programming language. You will learn how to use fundamental patterns of message / queuing with a step-by-step tutorial approach and how to apply them. Then, you ll learn how to use high level APIs and to work with multiple sockets and multithreaded programs through many examples.",
    "name": "ZeroMQ",
    "category": "Messaging"
  },
  {
    "author": "Mark Beckner",
    "pages": 688,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/00557aa20d7eb1e.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-6373-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/BizTalk 2013 Recipes, 2nd Edition.pdf",
    "year": "2013",
    "language": "English",
    "price": 141,
    "description": "BizTalk 2013 Recipes provides ready-made solutions to BizTalk Server 2013 developers. The recipes in the book save you the effort of developing your own solutions to common problems that have been solved many times over. The solutions demonstrate sound practice, the result of hard-earned wisdom by those who have gone before.\nPresented in a step-by-step format with clear code examples and explanations, the solutions in BizTalk 2013 Recipes help you take advantage of new features and deeper capabilities in BizTalk Server 2013. You ll learn to integrate your solutions with the cloud, configure BizTalk on Azure, work with electronic data interchange (EDI), and deploy the growing range of adapters for integrating with the different systems and technologies that you will encounter.",
    "name": "BizTalk 2013 Recipes, 2nd Edition",
    "category": "Messaging"
  },
  {
    "author": "Mark Beckner",
    "pages": 608,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/00557aa1f9df86b.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-3264-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/BizTalk 2010 Recipes.pdf",
    "year": "2010",
    "language": "English",
    "price": 95,
    "description": "BizTalk 2010 Recipes provides ready-made solutions to BizTalk Server 2010 developers. The recipes in the book save you the effort of developing your own solutions to common problems that have been solved many times over. The solutions demonstrate sound practice, the result of hard-earned wisdom by those who have gone before.\nPresented in a step-by-step format with clear code examples and explanations, the solutions in BizTalk 2010 Recipes help you take advantage of new features and deeper capabilities in BizTalk Server 2010. You ll learn to provide rich mapping support, extended electronic data interchange (EDI) and trading partner management capabilities, and to deploy the growing range of adapters for integrating with the different systems and technologies that you will encounter.",
    "name": "BizTalk 2010 Recipes",
    "category": "Messaging"
  },
  {
    "author": "Nishant Garg",
    "pages": 88,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/00557aa21285bc3.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78216-793-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Apache Kafka.pdf",
    "year": "2013",
    "language": "English",
    "price": 177,
    "description": "Message publishing is a mechanism of connecting heterogeneous applications together with messages that are routed between them, for example by using a message broker like Apache Kafka. Such solutions deal with real-time volumes of information and route it to multiple consumers without letting information producers know who the final consumers are.\nApache Kafka is a practical, hands-on guide providing you with a series of step-by-step practical implementations, which will help you take advantage of the real power behind Kafka, and give you a strong grounding for using it in your publisher-subscriber based architectures.",
    "name": "Apache Kafka",
    "category": "Messaging"
  },
  {
    "author": "Mohammed Rasheed",
    "pages": 370,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557aa01126d54.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78217-126-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Learning MS Dynamics AX 2012 Programming.pdf",
    "year": "2014",
    "language": "English",
    "price": 182,
    "description": "This tutorial has been carefully structured to guide you through the basic features of AX development and get you started as quickly as possible. With this book, you will soon be able to develop and maintain comprehensive management solutions to enhance your Dynamics AX 2012 application s performance. Starting with a tour of the development environment, you ll gain a deep understanding of Dynamics AX tools and architecture, before getting to grips with X++ for deeper customization. You will also learn how to search, manipulate, and integrate data.\nThe practical examples in this book take you through sample AX development projects and help you learn to create forms, reports, menu items, menus, and navigation pages. The book also helps you work with MorphX. By the end of this book, you will have a better understanding of the inner workings of Microsoft Dynamics AXmaking your development simpler and faster, and your applications fast, reliable, and robust.",
    "name": "Learning MS Dynamics AX 2012 Programming",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Philip Weinmeister",
    "pages": 324,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557aa0023b74d.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-484200-98-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Practical Salesforce.com Development Without Code.pdf",
    "year": "2014",
    "language": "English",
    "price": 82,
    "description": "Are you facing a challenging Salesforce.com problemsay, relating to customization, configuration, reporting, dashboards, or formulationthat you can t quite crack? Or maybe you are hoping to infuse some creativity into your solution design strategy to solve problems faster or make solutions more efficient? Practical Salesforce.com Development Without Code shows you how to unlock the power of the Force.com platform to solve real business problemsand all without writing a line of code. Adhering to Salesforce.com sClicks, not codemantra, Salesforce.com expert Phil Weinmeister walks you through different business problems and identifies effective, creativeand provenapproaches to solutions using the software s declarative framework.",
    "name": "Practical Salesforce.com Development Without Code",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Tejkumar Pandit",
    "pages": 328,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9ff845c98.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-6025-7",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Transportation Management with SAP TM 9.pdf",
    "year": "2014",
    "language": "English",
    "price": 98,
    "description": "Transportation Management with SAP TM 9 is a guide for CIO/CXOs evaluating options for various transportation management solutions available in the market and helps inappropriate decision making before committing investment. A proven evaluation framework and guidance provided in the book can help decision makers with product selection and help to create a business case for management approval and design a future roadmap for the organization. The book provides a comprehensive understanding of what SAP transportation management is and is useful for teams involved in TM Implementation and roll outs to ensure preparedness. The book explains end-to-end freight life cycle processes, functional system landscape, implementation challenges and post go-live precautions required to optimize investments in SAP TM.",
    "name": "Transportation Management with SAP TM 9",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Klaas Deforche",
    "pages": 264,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557aa00c1b271.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78217-672-5",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics AX 2012 R2 Services.pdf",
    "year": "2014",
    "language": "English",
    "price": 175,
    "description": "Enterprise Resource Planning (ERP) systems such as Microsoft Dynamics AX 2012 play a central role in an organization, and therefore, there will always be the need to integrate them with other applications. In many cases, services are the preferred way to do this, and Microsoft Dynamics AX 2012 is now more flexible than ever when it comes to the creation and use of these services. Understanding these services will help you effectively identify where they can be used.\nMicrosoft Dynamics AX 2012 R2 Services is a hands-on guide that provides you with all the knowledge you will need to implement services with Microsoft Dynamics AX 2012 R2. The step-by-step examples will walk you through many of the tasks that you need to perform frequently when creating and using services. This book has been updated to include features of the R2 release while staying relevant to previous version of Microsoft Dynamics AX 2012.",
    "name": "Microsoft Dynamics AX 2012 R2 Services",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Sushil Markandeya",
    "pages": 892,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9ffd47752.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-4803-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SAP ABAP.pdf",
    "year": "2014",
    "language": "English",
    "price": 174,
    "description": "SAP ABAP (Advanced Business Application Programming) elucidates the numerous features of the core programming platform, which is used for development for the entire SAP software suite. SAP ABAP uses numerous hands on business oriented use cases and a valuable dedicated e-resource to demonstrate the underlying advanced concepts of the OO ABAP environment and the SAP UI. SAP ABAP covers the latest version (NetWeaver 7.3 and SAP application programming release 6.0) of the platform for demonstrating the customization and implementation phases of the SAP software implementation.\nShorn of weighty theoretical treatment and preoccupation with language syntax, SAP ABAP is a comprehensive, practical one stop solution,which demonstrates and conveys the language s commands and features through hands on examples. The accompanying e-resource is a take off point to the book.",
    "name": "SAP ABAP",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Mark Polino",
    "pages": 268,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9ff334011.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-906-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Building Dashboards with Microsoft Dynamics GP 2013 and Excel 2013.pdf",
    "year": "2013",
    "language": "English",
    "price": 134,
    "description": "Accounting systems like Microsoft Dynamics GP 2013 hold a wealth of information. Excel 2013 provides a great tool for linking to, extracting, analysing, and presenting that rich data to help companies make better, faster, and smarter decisions.\nBuilding Dashboards with Microsoft Dynamics GP 2013 and Excel 2013 covers how to get the rich, detailed information contained in Microsoft Dynamics GP 2013 and present it in an attractive, easy-to-understand way using Excel 2013. The book shows in detail how to build great-looking dashboards that enhance a company s decision-making process.",
    "name": "Building Dashboards with Microsoft Dynamics GP 2013 and Excel 2013",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Nicolae Tarla",
    "pages": 238,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557aa007266c2.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78439-784-5",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics CRM Customization Essentials.pdf",
    "year": "2014",
    "language": "English",
    "price": 77,
    "description": "Dynamics CRM is Microsoft s answer to customer relationship management. The platform s flexibility allows system customizers to enhance its functionality to map any kind of business and scale to any size.\nThrough this practical guide, you will develop a vital and holistic understanding of the key features of Dynamics CRM. You will work with entities within the existing modules, learn how to customize and extend entities, and explore how to create logical relationships between them. You will also look at business rules and business process flows and learn how to use these features to enforce and visually enhance user experience. Furthermore, you will customize business entities without using code and cover the new features in Dynamics CRM. By the end of the book, you will have acquired new marketable skills in developing software for businesses running Dynamics CRM.",
    "name": "Microsoft Dynamics CRM Customization Essentials",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Jason Ouellette",
    "pages": 448,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fe927e00.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-321-94916-5",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Development with the Force.com Platform, 3rd Edition.pdf",
    "year": "2013",
    "language": "English",
    "price": 97,
    "description": "With Salesforce.com s Force.com platform, you can build and deploy powerful cloud-based enterprise applications faster than ever before. Now, Jason Ouellette gives you all the practical, technical guidance you need to make the most of the newest Force.com releases in your own custom cloud applications.\nThroughout, he adds new code and updated best practices for rapidly prototyping, building, and testing production-quality Force.com solutions. This edition s extensive new coverage includes Developer Console, JSON, Streaming and Tooling APIs, Bulk API, Force.com Canvas, REST integration, support for Web MVC frameworks, Dynamic Apex and Visualforce, and an all-new chapter on mobile user interfaces.",
    "name": "Development with the Force.com Platform, 3rd Edition",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Magulan D",
    "pages": 130,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557aa016239ed.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78328-735-2",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Getting Started with SOQL.pdf",
    "year": "2014",
    "language": "English",
    "price": 107,
    "description": "This practical guide will tell you everything you need to know about SOQL statements. You will learn the optimum way to write complex SOQL statements with this easy-to-understand guide. Beginning with basic SOQL statements, you will progress quickly onto more advanced statements, such as how to filter multiselect picklist values to escape sequences.\nThis book will teach you how to sort records with more than one field, sorting with more than one fieldâ\u0080\u0093one in ascending order and another field in descending orderâ\u0080\u0094and sorting null records in the first or in the last. You will learn about all the features provided while you are writing SOQL statements. This book will make you a SOQL expert by teaching you how to write SOQL statements in an optimized and effective way.",
    "name": "Getting Started with SOQL",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Tony Horrocks",
    "pages": 236,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fee3a257.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78216-044-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/CiviCRM Cookbook.pdf",
    "year": "2013",
    "language": "English",
    "price": 112,
    "description": "CiviCRM is a web-based, open source, Constituent Relationship Management (CRM) software geared toward meeting the needs of non-profit and other civic-sector organizations.\nOrganizations realize their mission via CiviCRM through contact management, fundraising, event management, member management, mass e-mail marketing, peer-to-peer campaigns, case management, and much more.\nCiviCRM is localized in over 20 languages including: Chinese (Taiwan, China), Dutch, English (Australia, Canada, U.S., UK), French (France, Canada), German, Italian, Japanese, Russian, and Swedish.",
    "name": "CiviCRM Cookbook",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Murray Fife",
    "pages": 314,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fe433e02.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78216-833-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Extending Microsoft Dynamics AX 2012 Cookbook.pdf",
    "year": "2013",
    "language": "English",
    "price": 48,
    "description": "Dynamics AX is built on a number of foundation products from Microsoft that are used to make it bigger, better, and stronger than the average business system. Taking advantage of these products will make your life easier. Use these tools to maximize the efficiency of your business management, taking advantage of a powerful and centralized tool set.\nExtending Microsoft Dynamics AX 2012 Cookbook will show you how to use tools that you already have to extend out Dynamics AX and discover potential new directions. You will be surprised at what you can do on a shoestring budget. The book will allow you to streamline your work processes, and use the system s powerful and centralised features to the advantage of your organization.",
    "name": "Extending Microsoft Dynamics AX 2012 Cookbook",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Damian Sinay",
    "pages": 308,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fc11fe25.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-230-5",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics CRM 2011 Reporting.pdf",
    "year": "2013",
    "language": "English",
    "price": 101,
    "description": "All of the data entered into a CRM means nothing if it is unable to report the important information to our managers and executives in such a way that they can easily and quickly get the results they need. A better reporting system would enable them to make the necessary improvements to the processes that any business needs in a dynamic business world.For users and developers wishing to take advantage of using the report capabilities of Dynamics CRM, this is the book for you.\nMicrosoft Dynamics CRM 2011 Reporting is a practical and excellent reference guide that provides you with a number of different options you can use to create and empower the Reporting capabilities of Dynamics CRM. This will give you a good grounding in using the reports in your Dynamics CRM 2011 implementations.",
    "name": "Microsoft Dynamics CRM 2011 Reporting",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Alex Chow",
    "pages": 230,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fda19d4d.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-948-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Getting Started with Dynamics NAV 2013 Application Development.pdf",
    "year": "2013",
    "language": "English",
    "price": 136,
    "description": "So, your company has made the wise decision to use Dynamics NAV as its main business software for all its enterprise resource planning. Dive in and learn the ins and outs of the software from a development standpoint and unlock the software s full potential.\nThe book will walk you through creating an application from start to finish. Once you know how to create a working application that users can access, you will have the knowledge and the resources needed to create other applications based on the tutorials covered in this guide.\nYou will start by obtaining a free trial version of Dynamics NAV and then be introduced to the world of analyzing and deriving user problems into a requirements list. Finally, you will be shown how to use the software to knock out these requirements.",
    "name": "Getting Started with Dynamics NAV 2013 Application Development",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Danny Varghese",
    "pages": 344,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fcb2953f.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-650-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics CRM 2011 Applications (MB2-868) Certification Guide.pdf",
    "year": "2013",
    "language": "English",
    "price": 200,
    "description": "Managing any relationship can be difficult. Microsoft Dynamics CRM 2011 enables an organization to manage their marketing, sales, and service efforts for a customer, and give users a 360 degree view of the customer.\nMicrosoft Dynamics CRM 2011 Applications (MB2-868) Certification Guide will assist individuals in passing the certification exam by reviewing each topic covered by the exam in depth, providing questions to test your knowledge at the end of each chapter, and finally by providing a 75 question practice exam including answers.",
    "name": "Microsoft Dynamics CRM 2011 Applications (MB2-868) Certification Guide",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Mark Polino",
    "pages": 348,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fb728fea.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-938-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics GP 2013 Cookbook.pdf",
    "year": "2013",
    "language": "English",
    "price": 89,
    "description": "Microsoft Dynamics GP is an enterprise resource planning system, essentially an accounting system on steroids, designed for mid-sized organizations. The implementation of Dynamics GP is usually considered to be complex, and people often realize there must be more efficient ways of working with the system. This book will show readers how to improve their use of Dynamics GP and get the most out of this tool quickly and effectively.\nMicrosoft Dynamics GP 2013 Cookbook picks up where implementation training leaves off. Whether you are new or experienced you will find useful recipes for improving the way you use and work with Dynamics GP. The clear recipe steps and screenshots make implementing these solutions easy for users of any level and will be sure to improve your efficiency with the Dynamics GP 2013 system.",
    "name": "Microsoft Dynamics GP 2013 Cookbook",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Dipankar Bhattacharya",
    "pages": 406,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fc623fee.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-452-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics CRM 2011 Cookbook.pdf",
    "year": "2013",
    "language": "English",
    "price": 97,
    "description": "Without a comprehensive understanding of deployment scenarios and steps, it is really difficult to install and maintain Dynamics CRM 2011 within complex IT infrastructures. Done badly, it can cause serious future maintenance and optimization issues.\nAdministration of CRM systems is equally complex and important; unless efficiently done, it can create fuss in the system and potentially bring down end user satisfaction. Configuration and customization of the system has to be done very carefully too so that it can meet the functional needs appropriately.",
    "name": "Microsoft Dynamics CRM 2011 Cookbook",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Ankit Arora",
    "pages": 224,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fdf2b9d5.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-474-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Force.com Tips and Tricks.pdf",
    "year": "2013",
    "language": "English",
    "price": 35,
    "description": "Force.com is an extremely powerful, scalable and secure cloud platform, delivering a complete technology stack covering the ground from database and security to workflow and user interface. Force.com Tips and Tricks starts with very basic admin tasks and gradually moves to hard-core coding tips and tricks for the multitenant Force.com platform.\nThe book starts with the basics of Cloud Computing and Principles and constructs of Force.com. The book then swiftly move to detailed coverage of Salesforce analytics. The book also shows how to set up development environments and and gives detailed understanding of tools and destinations that every Force.com developer should know.",
    "name": "Force.com Tips and Tricks",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Laura Nicolas Lorente",
    "pages": 554,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fd01c59a.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-602-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Implementing Microsoft Dynamics NAV 2013.pdf",
    "year": "2013",
    "language": "English",
    "price": 81,
    "description": "Microsoft Dynamics NAV 2013 is an Enterprise Resource Planning (ERP) application used in all kinds of organizations around the world. It provides a great variety of functionality out-of-the-box in different topics such as accounting, sales and purchases processing, logistics, or manufacturing. But it also allows companies to grow the application by customizing the solution to meet specific requirements.\nImplementing Microsoft Dynamics NAV 2013explains all you need to know to successfully handle your first Dynamics NAV 2013 implementation. You will learn what the application can do out of the box, how you can extend it to meet any kind of requirements, and how to manage real implementation projects with real customers.",
    "name": "Implementing Microsoft Dynamics NAV 2013",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Keith Dunkinson",
    "pages": 234,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fd523a27.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-704-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Implementing Microsoft Dynamics AX 2012 with Sure Step 2012.pdf",
    "year": "2013",
    "language": "English",
    "price": 79,
    "description": "Microsoft Dynamics AX is a comprehensive Enterprise Resource Planning (ERP) solution for midsize and larger organizations that empowers people to work effectively, manage change, and compete globally. Microsoft Dynamics Sure Step is an implementation methodology, a toolset, and an application to help Dynamics partners (AX, CRM, NAV, GP, and SL) successfully implement their Dynamics solutions such as Dynamics AX.\nImplementing Microsoft Dynamics AX 2012 with Sure Step 2012 will guide you through the Sure Step phases; from installing and setting up Sure Step, to working through the diagnostic and requirement phases, to harnessing the power of standard AX to make the most out of modifications, this book is a must for project managers and team members alike.",
    "name": "Implementing Microsoft Dynamics AX 2012 with Sure Step 2012",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Nicolae Tarla",
    "pages": 268,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fbc248fd.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-882-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics CRM 2011 Scripting Cookbook.pdf",
    "year": "2013",
    "language": "English",
    "price": 87,
    "description": "With the increased adoption of Dynamics CRM 2011, more people are faced with various tasks including administering and customizing the environment. Microsoft Dynamics CRM is a Customer Relationship Management software package from Microsoft. It offers solutions to help companies with Sales, Customer Services, and Marketing. Microsoft Dynamics CRM is increasingly being used by businesses of all kinds and all sizes to reach audiences in new ways. Microsoft Dynamics CRM scripting extends system customization through the use of client-side scripting. It builds on the standard customization options offered by Dynamics CRM.",
    "name": "Microsoft Dynamics CRM 2011 Scripting Cookbook",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Paul Goodey",
    "pages": 266,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fad14909.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-424-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Salesforce CRM Admin Cookbook.pdf",
    "year": "2013",
    "language": "English",
    "price": 186,
    "description": "Salesforce CRM is a market-leading customer relationship management (CRM) application that is accessed over the Internet. It is a proven system which helps to manage large volumes of information across an organization and also improves communication between departments for exceptional customer service. The CRM application is available for the management of sales projections and orders, marketing plans, knowledge management, service and support, partner relationships, and data analytics. The application greatly enhances a company s sales performance, improves customer satisfaction, and provides a robust customer relationship management system for an organization. For optimum performance of the system, there are a lot of things for you as the Salesforce administrator to know and tackle, but there isn t a single book which focuses on the administrative aspect of Salesforce CRM.",
    "name": "Salesforce CRM Admin Cookbook",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Leslie Vail",
    "pages": 590,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fa30060d.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-026-4",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Developing Microsoft Dynamics GP Business Applications.pdf",
    "year": "2012",
    "language": "English",
    "price": 36,
    "description": "Microsoft Dynamics GP is a sophisticated Enterprise Resource Planning (ERP) application with a multitude of features and options. Microsoft Dynamics GP can also be used to develop dynamic, mission critical applications.\nInDeveloping Microsoft Dynamics GP Business Applicationsyou will learn how to create and customize Dynamics GP Applications. This hands-on guide will take you through the initial steps of setting up a development environment through to customizing and developing an example application using tools such as Dexterity, VSTools and sanScript.",
    "name": "Developing Microsoft Dynamics GP Business Applications",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Rehan Zaidi",
    "pages": 316,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f8513e5d.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-488-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SAP ABAP Advanced Cookbook.pdf",
    "year": "2012",
    "language": "English",
    "price": 55,
    "description": "Full of illustrations, diagrams, and tips with clear step-by-step instructions and real time examples. Get to grips with solving complicated problems using Regular Expressions in ABAP. Master the creation of common Design Patterns using ABAP Objects. Enhance SAP applications through the use of ABAP programming. Covers the newest topics of Adobe Interactive Forms.",
    "name": "SAP ABAP Advanced Cookbook",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Mark AuCoin",
    "pages": 266,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f8f18372.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-8496-8440-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics CRM 2011.pdf",
    "year": "2012",
    "language": "English",
    "price": 89,
    "description": "Take advantage of all of the latest Dynamics CRM dashboard features for visualizing your most important data at a glance. Understand how iFrames, chart customizations, advanced WebResources and more can improve your dashboards in Dynamics CRM by using this book and eBook. A highly practical cookbook bursting with a range of exciting task-based recipes for mastering Microsoft Dynamics CRM 2011 Dashboards.",
    "name": "Microsoft Dynamics CRM 2011",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Klaas Deforche",
    "pages": 196,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f9415faa.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-754-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics AX 2012 Services.pdf",
    "year": "2012",
    "language": "English",
    "price": 137,
    "description": "Because an ERP system like Microsoft Dynamics AX 2012 plays a central role in an organization, there will always be the need to integrate it with other applications. In many cases, services are the preferred way of doing this, and Microsoft Dynamics AX 2012 is now more flexible than ever when it comes to the creation and use of these services. Understanding these services will help you identify where they can be used, and do so effectively.",
    "name": "Microsoft Dynamics AX 2012 Services",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Chamil Madusanka",
    "pages": 120,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fa815944.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78217-981-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Visualforce Developer-s Guide.pdf",
    "year": "2013",
    "language": "English",
    "price": 155,
    "description": "Visualforce allows you to build sophisticated, custom user interfaces that can be hosted natively on the Force.com platform. Visualforce achieves this with the help of a tag-based language which is similar to HTML. This book aims to introduce you to Visualforce development tools to develop a better perspective towards UI development with Visualforce, and take your expertise in UI development to the next level.Visualforce Developer s Guideis a hands-on guide aimed towards developing a custom UI interface. As you read through the content, you will notice that this book focuses on a single real-world example. This book builds upon this example to help you understand and use Visualforce development tools in your custom UI interfaces.Visualforce Developer s Guidebegins with an introduction to Visualforce to give you an understanding of the MVC model and the Visualforce architecture. Special emphasis is given to building a rich user interface by leveraging JavaScript, jQuery, CSS, and HTML with Visualforce.\nThrough the course of the book, you will learn how to reuse the code with the help of custom components, and minimize the Visualforce and Apex code through Visualforce dynamic binding. The later sections of the book focus on building Visualforce pages for mobile devices. By the end of the book, you will learn the best practices and security tips for Apex and Visualforce development.",
    "name": "Visualforce Developer&#8217;s Guide",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "The Microsoft Dynamics AX Team",
    "pages": 784,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f9e04cfe.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-7356-6710-5",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Inside Microsoft Dynamics AX 2012.pdf",
    "year": "2012",
    "language": "English",
    "price": 152,
    "description": "Dig into the architecture and internals of Microsoft Dynamics AX 2012with firsthand insights from the team that designed and developed it. Targeted for solution developers and system implementers, this guide focuses on programming and customization capabilitiesincluding key architectural principles, the application model, framework, and tools.\nReaders should have working knowledge of SQL and OOP concepts to gain max benefit from this book.",
    "name": "Inside Microsoft Dynamics AX 2012",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Anne Stanton",
    "pages": 528,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f8a2281d.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-6723-3537-2",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Sams Teach Yourself Microsoft Dynamics Crm 2011 in 24 Hours.pdf",
    "year": "2012",
    "language": "English",
    "price": 162,
    "description": "In just 24 sessions of one hour or less, you ll learn how to drive powerful business results with Microsoft Dynamics CRM 2011! Using this book s straightforward, step-by-step approach, you ll learn how to orchestrate successful CRM projects, automate processes, create more efficient workflows, optimize sales and marketing campaigns, and integrate with your other systems to do even more. One step at a time, you ll master new features ranging from the new Ribbon interface to SharePoint integration. Each lesson builds on what you ve already learned, helping you get the job done fastand get it done right!",
    "name": "Sams Teach Yourself Microsoft Dynamics Crm 2011 in 24 Hours",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Laura Nicolas Lorente",
    "pages": 134,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9fb21e4a9.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78217-162-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics NAV Financial Management.pdf",
    "year": "2013",
    "language": "English",
    "price": 174,
    "description": "Microsoft Dynamics NAV is an Enterprise Resource Planning (ERP) application used in all kinds of organizations around the world. An ERP helps to integrate internal and external management information across an entire organization. It provides a great variety of functionalities in different areas such as accounting, sales and purchases processing, logistics, and manufacturing.\nMicrosoft Dynamics NAV Financial Management explains all you need to know to successfully handle your daily financial management tasks. You will learn about functionalities such as the sales and purchase processes, payments, bank account management, reporting taxes, budgets, cash flow, fixed assets, inventory valuation, and business intelligence.",
    "name": "Microsoft Dynamics NAV Financial Management",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Mindaugas Pocius",
    "pages": 372,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f990af44.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-8496-8464-4",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics AX 2012 Development Cookbook.pdf",
    "year": "2012",
    "language": "English",
    "price": 78,
    "description": "Develop powerful, successful Dynamics AX projects with efficient X++ code with this book and eBook. Proven recipes that can be reused in numerous successful Dynamics AX projects. Covers general ledger, accounts payable, accounts receivable, project modules and general functionality of Dynamics AX. Step-by-step instructions and useful screenshots for easy learning. Numerous development tips and tricks for daily usage.",
    "name": "Microsoft Dynamics AX 2012 Development Cookbook",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Scott Kostojohn",
    "pages": 248,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f7b12443.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-3590-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/CRM Fundamentals.pdf",
    "year": "2011",
    "language": "English",
    "price": 192,
    "description": "CRM Fundamentals is a critical and comprehensive resource for executives and project leaders tasked with managing customer relationship management (CRM) initiatives. It provides an introduction to CRM and how it delivers value to organizations, and describes the process to build and execute a CRM roadmap successfullyâ\u0080\u0094including identifying goals, lining up the right people, planning projects, choosing software packages and consultants, managing the initial CRM implementation, and maintaining and evolving the program over time.",
    "name": "CRM Fundamentals",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Matthew Wittemann",
    "pages": 816,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f66587eb.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-56814-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics CRM 2011 Administration Bible.pdf",
    "year": "2011",
    "language": "English",
    "price": 115,
    "description": "What better way to learn how to administer Dynamics CRM 2011 than from two Microsoft CRM experts? This in-depth Bible is packed with expert guidance on the latest version of Microsoft s hot CRM product. Whether you re new to Dynamics CRM or upgrading from an earlier version, you ll get thoroughly up to speed on everything from the basics to new features and more.\nIf you want to master Microsoft Dynamics CRM 2011 for your business contacts, this is the book you need to succeed.",
    "name": "Microsoft Dynamics CRM 2011 Administration Bible",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "George Anderson",
    "pages": 432,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f5752438.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-672-33542-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Sams Teach Yourself SAP in 24 Hours, 4th Edition.pdf",
    "year": "2011",
    "language": "English",
    "price": 164,
    "description": "In just 24 sessions of one hour or less, you ll master the latest updates on SAP, and discover how to succeed with it in real business and technical environments! Using this book s straightforward, step-by-step approach, you ll learn through practical hands-on examples and case studies based on SAP s free demonstration software. Each lesson builds on what you ve already learned, giving you a strong real-world foundation with both the business and technical sides of SAP. Leading SAP architect and consultant George Anderson starts with the absolute basicsthoroughly covers core business, reporting, and administration tasksand takes you all the way to the cutting edge, including how the cloud might be used to support SAP environments.",
    "name": "Sams Teach Yourself SAP in 24 Hours, 4th Edition",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "John Mertic",
    "pages": 80,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f800f4c4.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4493-0980-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Building on SugarCRM.pdf",
    "year": "2011",
    "language": "English",
    "price": 179,
    "description": "In the crowded field of customer relationship management (CRM) systems, SugarCRM stands outnot only for its modular design, but also for the ease with which you can develop, customize, and extend your CRM applications. This concise book provides a thorough overview of the development tools and APIs available in SugarCRM 6.2, showing both developers and nondevelopers alike how to use them to build a sample application step-by-step.\nYou ll learn how to bend and twist SugarCRMâ\u0080\u0099s extensible MVC framework to create custom applications, including solutions for automating your business that go beyond traditional CRMs.",
    "name": "Building on SugarCRM",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Jason Ouellette",
    "pages": 496,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f760463b.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-321-76735-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Development with the Force.com Platform, 2nd Edition.pdf",
    "year": "2011",
    "language": "English",
    "price": 107,
    "description": "Using Force.com, you can build enterprise applications with world-class value, scalability, and reliabilityand do it in days or weeks, not months or years. In this book, top Force.com developer Jason Ouellette offers all the technical guidance and sample code you ll need to get outstanding results with the newest version of Force.com.\nDrawing on his experience building three of the world s top ten Force.com applications, Jason Ouellette walks you through the entire project lifecycle, from identifying potential applications to prototyping, coding, and deployment. Throughout, he offers practical insights you won t find in Salesforce.com s documentationor anywhere else.",
    "name": "Development with the Force.com Platform, 2nd Edition",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Gordon Du",
    "pages": 352,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f70dcbcb.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-236-7",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Mastering SQL Queries for SAP Business One.pdf",
    "year": "2011",
    "language": "English",
    "price": 69,
    "description": "Practical SAP query examples from an SAP Business One expert. Detailed steps to create and troubleshoot SQL queries for Alerts, Approvals, Formatted Searches, and Crystal Reports. Understand the importance and benefit of keeping SQL queries simple and easy to understand. Benefit from special tips and tricks related directly to SQL queries within SAP Business One.",
    "name": "Mastering SQL Queries for SAP Business One",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Xavier Hacking",
    "pages": 352,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f5261ae8.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-178-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SAP BusinessObjects Dashboards 4.0 Cookbook.pdf",
    "year": "2011",
    "language": "English",
    "price": 134,
    "description": "Learn valuable Dashboard Design best practices and tips through easy to follow recipes. Become skilled in using and configuring all Dashboard Design components. Learn how to apply Dynamic Visibility to enhance your dashboards. Get introduced to the most important add-ons available for Dashboard Design with the most up to date information for Dashboards 4.0.",
    "name": "SAP BusinessObjects Dashboards 4.0 Cookbook",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Mike Snyder",
    "pages": 448,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f615a7c9.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-7356-4890-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics CRM 2011 Step by Step.pdf",
    "year": "2011",
    "language": "English",
    "price": 113,
    "description": "The smart way to learn Microsoft Dynamics CRM 2011one step at a time! Use the easy-to-follow lessons to master the fundamentals of creating and managing accounts; working directly within familiar tools such as Microsoft Outlook; tracking customer activity and communications; managing campaigns, leads, quotes, contracts, and orders; and employing basic to advanced reporting capabilities. Includes downloadable, ready-made practice files and complete Book.",
    "name": "Microsoft Dynamics CRM 2011 Step by Step",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Marco Carvalho",
    "pages": 396,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f6b54cb2.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84719-784-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics AX 2009 Administration.pdf",
    "year": "2011",
    "language": "English",
    "price": 157,
    "description": "Effectively consolidate and standardize processes across your organization with a centralized source for a variety of business needs. Discover how to effectively plan and implement Dynamics AX 2009 in your business and fully grasp the necessary hardware, network, and software requirements to do so. Understand the varied components that make up your Dynamics AX environment, including the role of base server components, how to implement the Enterprise Portal and Role Centers for web browser access to Dynamics AX, and the various workflow capabilities required to fit the needs of your company.",
    "name": "Microsoft Dynamics AX 2009 Administration",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Alexander Hansal",
    "pages": 577,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f5c56dd0.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-849681-86-5, 1849681864",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Oracle Siebel CRM 8 Developer-s Handbook.pdf",
    "year": "2011",
    "language": "English",
    "price": 172,
    "description": "Unmatched in functionality and scalability, Siebel enhances a company s sales performance, improves customer satisfaction, and provides a robust Customer Relationship Management system for an organization. Written by Oracle employee and Siebel expert, Alexander Hansal, this book is a complete practical guide to configuring, automating, and extending Siebel CRM applications. You will learn how to configure the Siebel CRM user interface objects as well as the underlying business layer objects by using real-life case study examples.\nIn addition, you will learn to safely configure the Siebel data model. You will learn how the object types in the Siebel Repository are related to each other and how they are organized in different layers.\nThe book then teaches you to configure the Siebel CRM user interface objects such as views and applets as well as the underlying business layer objects by using real-life case-study examples. Always having one eye on performance and upgradeability, you will learn to safely configure the Siebel data model. Understanding and using the Siebel event framework for automation is also a key focus area of the book. You will gain a thorough and solid understanding of integration objects to support EAI interfaces.",
    "name": "Oracle Siebel CRM 8 Developer&#8217;s Handbook",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "David A. Studebaker",
    "pages": 620,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f3411d6b.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84719-652-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Programming Microsoft Dynamics NAV 2009.pdf",
    "year": "2009",
    "language": "English",
    "price": 76,
    "description": "Microsoft Dynamics NAV is a well established Enterprise Resource Planning (ERP) application, part of the Microsoft Dynamics family. Dynamics NAV is installed worldwide, with well over one million users. Version 2009 contains many major new features and structures, requiring even experienced Dynamics NAV developers to refresh their NAV development knowledge.\nRenowned for its challenging learning curve, Dynamics NAV is a complex piece of software with a unique design structure. For developers learning to modify or enhance Dynamics NAV for vital business purposes, the task can sometimes be intimidating.",
    "name": "Programming Microsoft Dynamics NAV 2009",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Rajya Vardhan Bhaiya",
    "pages": 600,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f391efbd.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-672-33054-4",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics CRM 4 Integration Unleashed.pdf",
    "year": "2009",
    "language": "English",
    "price": 82,
    "description": "In Microsoft Dynamics CRM 4 Integration Unleashed, two leading experts present proven techniques, best practices, and example code for going far beyond the out-of-the-box capabilities of Dynamics CRM 4. Using these solutions and sample applications, you will enhance all of your company s relationshipswith vendors, distributors, employees, users, affiliates, and customers.",
    "name": "Microsoft Dynamics CRM 4 Integration Unleashed",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Veeru Mehta",
    "pages": 888,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f2f19ef3.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-672-33004-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SAP Implementation Unleashed.pdf",
    "year": "2009",
    "language": "English",
    "price": 127,
    "description": "SAP can help you capture better information and deliver it more quickly, allowing you to make better decisions and maximize the business value of everything you do. However, SAP implementations require massive effort, total buy-in, and significant change throughout the organization. In SAP Implementation Unleashed, 10 expert SAP project managers, functional consultants, and technologists guide you through the entire journey, helping you avoid pain and pitfalls and gain all the benefits of SAP.",
    "name": "SAP Implementation Unleashed",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Joseph Murray",
    "pages": 464,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f4d47d7e.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84951-226-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Using CiviCRM.pdf",
    "year": "2011",
    "language": "English",
    "price": 59,
    "description": "CiviCRM is a web-based, open source CRM system, designed specifically to meet the needs of advocacy, non-profit and non-governmental organizations. Elected officials, professional/trade associations, political campaigns and parties, government agencies, and other similar organizations are among its growing number of enthusiastic users. This book shows you how to harness CiviCRM s impressive array of possibilities as you develop and execute performance-critical CRM strategies.",
    "name": "Using CiviCRM",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Sharan Oberoi",
    "pages": 190,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f3e23956.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84719-876-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics NAV Administration.pdf",
    "year": "2010",
    "language": "English",
    "price": 154,
    "description": "Microsoft Dynamics NAV is an Enterprise Resource Planning (ERP) software product that integrates financial, manufacturing, supply chain management, sales and marketing, project management, human resources, and services management information from across your organization, into a centralized database. It can take hours to browse through documentation and references available online to learn how to install, configure, deploy and administer Dynamics NAV. This book aims to offer quick-start information in one place.\nYou will be amazed to find out how easily you can administer Dynamics NAV using this quick step-by-step guide. This book also has recommendations for software and hardware requirements including operating system considerations and hardware considerations for administering Dynamics NAV to your advantage.",
    "name": "Microsoft Dynamics NAV Administration",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "John Mertic",
    "pages": 280,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f29d3c3e.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-2439-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/The Definitive Guide to SugarCRM.pdf",
    "year": "2009",
    "language": "English",
    "price": 137,
    "description": "SugarCRM is a leading open-source customer relations management tool and development platform with nearly 5.5 million downloads, nearly 17,000 developers, and lots more users.\nThe Definitive Guide to SugarCRM is the first official SugarCRM book available to developers and users. This definitive book begins with a discussion of the SugarCRM platform components, namely MVC, Studio, Module Builder, authentication, and themes.\nNext, you ll learn how to customize the modules SugarCRM comes with out of the box in an upgrade-safe manner. The text then presents an example application that a typical business might use and shows how to build it using SugarCRM, using both existing functionality as well as newly added functionality.",
    "name": "The Definitive Guide to SugarCRM",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Dr Mark Alexander Bain",
    "pages": 296,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f1fc1c6e.jpg",
    "download_link_epub": null,
    "ISBN": "978-1847192066, 1847192068, 978-1847192066",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SugarCRM Developer-s Manual Customize and extend SugarCRM.pdf",
    "year": "2007",
    "language": "English",
    "price": 184,
    "description": "This is a developer s manual for SugarCRM. It focuses on customizing SugarCRM. It provides an overview of the architecture of the application and the database, and covers the essential steps for hooking your module into the SugarCRM infrastructure. The book is for PHP developers working with SugarCRM, who want to extend its capabilities. Readers should have a basic knowledge of SugarCRM as the book does not cover installation and usage of SugarCRM. This can be gained from Implementing SugarCRM.",
    "name": "SugarCRM Developer&#8217;s Manual: Customize and extend SugarCRM",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Matt Traxinger",
    "pages": 356,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f4322915.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-094-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Dynamics NAV 2009 Programming Cookbook.pdf",
    "year": "2010",
    "language": "English",
    "price": 78,
    "description": "Write NAV programs to do everything from finding data in a table to integration with an instant messenger client. Develop your own .NET code to perform tasks that NAV cannot handle on its own. Work with SQL Server to create better integration between NAV and other systems. Learn to use the new features of the NAV 2009 Role Tailored Client. Easy-to-read recipes with detailed explanations and images. Maximize your learning with short tutorials that tell you exactly what you need to know without all of the fluff.",
    "name": "Microsoft Dynamics NAV 2009 Programming Cookbook",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Ruth Hoffman",
    "pages": 300,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f4838806.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84719-918-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Apache OfBiz Cookbook.pdf",
    "year": "2010",
    "language": "English",
    "price": 32,
    "description": "Optimize your OFBiz experience and save hours of frustration with this timesaving collection of practical recipes covering a wide range of OFBiz topics. Get answers to the most commonly asked OFBiz questions in an easy-to-digest reference style of presentation. Discover insights into OFBiz design, implementation, and best practices by exploring real-life solutions. Each recipe in this Cookbook is crafted to describe not onlyhowto accomplish a specific task, but alsowhythe technique works to ensure you get the most out of your OFBiz implementation.",
    "name": "Apache OfBiz Cookbook",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Holly A. Roland",
    "pages": 342,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f24cac56.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-33317-4",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SAP GRC For Dummies.pdf",
    "year": "2008",
    "language": "English",
    "price": 51,
    "description": "Governance, risk, and compliancethese three big letters can add up to one giant headache. But GRC doesn t have to be a boil on your corporate behind. SAP GRC For Dummies untangles the web of regulations that confronts your company and introduces you to software solutions the not only keep you in compliance, but also make your whole enterprise stronger.\nThis completely practical guide starts with a big-picture look and GRC and explains how it can help your organization grow. You ll find out why these regulations were enacted; what you can do to ensure compliance; and how compliance can help you prevent fraud, bolster your corporate image, and envision and execute the best possible corporate strategy.",
    "name": "SAP GRC For Dummies",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "John Chapman",
    "pages": 436,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9d3a32132.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-658-7",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint 2013 WCM Advanced Cookbook.pdf",
    "year": "2014",
    "language": "English",
    "price": 47,
    "description": "SharePoint 2013 Server includes new and improved features for web content management that simplify how you design publishing sites, and enhances the authoring and publishing processes of organizations. SharePoint Server 2013 also has new features that use the power of search to surface dynamic web content on publishing sites. Using the right tools efficiently can assist organizations in creating compelling content-rich websites without the undue overhead of hands-on management of each piece of content. SharePoint 2013 WCM Advanced Cookbook is a practical guide to show you how to leverage Microsoft SharePoint 2013 to create a scalable web content management system. This book helps you in learning about the features of SharePoint 2013 in depth and also takes you through each of these features practically by providing you with a hands-on experience.",
    "name": "SharePoint 2013 WCM Advanced Cookbook",
    "category": "SharePoint"
  },
  {
    "author": "Stacia Misner",
    "pages": 406,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9d2b43866.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-73567-543-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Business Intelligence in Microsoft SharePoint 2013.pdf",
    "year": "2013",
    "language": "English",
    "price": 174,
    "description": "Dive into the business intelligence features in SharePoint 2013and use the right combination of tools to deliver compelling solutions.\nTake control of business intelligence (BI) with the tools offered by SharePoint 2013 and Microsoft SQL Server 2012. Led by a group of BI and SharePoint experts, you ll get step-by-step instructions for understanding how to use these technologies best in specific BI scenarioswhether you re a SharePoint administrator, SQL Server developer, or business analyst.",
    "name": "Business Intelligence in Microsoft SharePoint 2013",
    "category": "SharePoint"
  },
  {
    "author": "Penelope Coventry",
    "pages": 200,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9d213b8b9.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-7356-7552-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Exploring Microsoft SharePoint 2013.pdf",
    "year": "2013",
    "language": "English",
    "price": 86,
    "description": "Discover what s new and what s changed in SharePoint 2013and get a head start using these cutting-edge capabilities to improve organizational collaboration and effectiveness.\nLed by a Microsoft MVP for SharePoint, you ll learn how to take advantage of important new features and functionality, including app development, collaborative social enterprise tools, enhanced versioning, themes, improved search, and an extended client object model.",
    "name": "Exploring Microsoft SharePoint 2013",
    "category": "SharePoint"
  },
  {
    "author": "Randy Williams",
    "pages": 954,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9d3f76650.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-7356-7539-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2013 Administration Inside Out.pdf",
    "year": "2014",
    "language": "English",
    "price": 49,
    "description": "Dive into SharePoint 2013 administrationâ\u0080\u0094and really put your systems expertise to work! This supremely organized reference packs hundreds of timesaving solutions, troubleshooting tips, and workarounds. Discover how the experts deploy, configure, and manage SharePointâ\u0080\u0094and challenge yourself to new levels of mastery.",
    "name": "Microsoft SharePoint 2013 Administration Inside Out",
    "category": "SharePoint"
  },
  {
    "author": "Jason Himmelstein",
    "pages": 592,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9d263c3d6.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-44932-083-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Developing Business Intelligence Apps for SharePoint.pdf",
    "year": "2013",
    "language": "English",
    "price": 48,
    "description": "Create dynamic business intelligence (BI) solutions for SharePoint faster and with more capabilities than previously possible. With this book, you ll learn the entire processfrom high-level concepts to development and deploymentfor building data-rich BI applications with Visual Studio LightSwitch, SQL Server 2012, and a host of related Microsoft technologies.\nYou ll learn practical techniques and patterns necessary to use all of these technologies together as you build an example application through the course of the book, step by step. Discover how to solve real problems, using BI solutions that will evolve to meet future needs.",
    "name": "Developing Business Intelligence Apps for SharePoint",
    "category": "SharePoint"
  },
  {
    "author": "Brandon Atkinson",
    "pages": 240,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9d49935e5.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4842-0545-7, 978-1-4842-0544-0, 1484205456",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Custom SharePoint Solutions with HTML and JavaScript.pdf",
    "year": "2015",
    "language": "English",
    "price": 108,
    "description": "Custom SharePoint Solutions with HTML and JavaScript shows you how to build and customize SharePoint solutions to suit a wide range of business needs. You don t need a background in Microsoft technologies; you’ll learn how to rapidly build and customize sites entirely on the front end, starting with out-of-the-box features and extending them with HTML and JavaScript code.\nThe book starts with an introduction to working with SharePoint on the front end, and how this can help you avoid common pitfalls associated with deploying custom code on the server. You’ll start by using SharePoint’s browser-based tools to place and manipulate out-of-the-box web parts on a page. Then learn to inject some simple HTML and JavaScript to manipulate these web parts, and use JSLink to rapidly style and manipulate data in the List web part. You ll also see examples of how to build your own custom web parts using HTML, JavaScript and CSS.\nFor those who want to dive deeper into JavaScript on SharePoint, chapters cover working directly with built-in JavaScript methods and properties and the JavaScript object model (JSOM), and how to work with the powerful new REST API, which gives you the ultimate flexibility over what you do with your data.\nWhatever your background, whether it s web development, working with SharePoint on the server side, or if you re a SharePoint user looking to learn new skills, Custom SharePoint Solutions with HTML and JavaScript will show you how to get what you want from SharePoint, quickly and reliably.",
    "name": "Custom SharePoint Solutions with HTML and JavaScript",
    "category": "SharePoint"
  },
  {
    "author": "Nikolas Charlebois-Laprade",
    "pages": 232,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9d44732e9.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-6472-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Beginning PowerShell for SharePoint 2013.pdf",
    "year": "2014",
    "language": "English",
    "price": 53,
    "description": "Beginning PowerShell for SharePoint 2013 is a book for the SharePoint administrator looking to expand his or her toolkit and skills by learning PowerShell, Microsoft s vastly flexible and versatile object oriented scripting language. PowerShell is the future of Microsoft administration, and SharePoint is a complex product that can be managed more easily and quickly with PowerShell cmdlets and scripts. This book helps bridge the gap, introducing PowerShell fundamentals and operations in the context of deploying, migrating, managing, and monitoring SharePoint 2013.",
    "name": "Beginning PowerShell for SharePoint 2013",
    "category": "SharePoint"
  },
  {
    "author": "Shane Perran",
    "pages": 672,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9d3537bab.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-1184-9589-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Beginning SharePoint 2013.pdf",
    "year": "2013",
    "language": "English",
    "price": 165,
    "description": "Following on the heels of successful previous editions, this perennial bestseller is completely updated for the latest iteration of SharePoint. The team of authors walks you through building business solutions using SharePoint 2013, while providing real-world scenarios and detailed descriptions that highlight best practices for configuration and customization. Featuring new chapters that discuss managing permissions and working with Access Services, this ideal introductory guide shows you how to efficiently handle a variety of SharePoint challenges that you may face and gives you the tools you need to put this popular content management platform to work for you.",
    "name": "Beginning SharePoint 2013",
    "category": "SharePoint"
  },
  {
    "author": "Michael Whitehead",
    "pages": 328,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/99557a9f1ab88a0.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-90481-168-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Implementing SugarCRM.pdf",
    "year": "2006",
    "language": "English",
    "price": 165,
    "description": "SugarCRM is a popular customer relationship management system. It is available in both free open source and commercial versions, making it an ideal way for small-medium business to try out a CRM system without committing large sums of money. Although SugarCRM is carefully designed for ease of use, attaining measurable business gains requires careful planning and research. This book distils hard won SugarCRM experienced into an easy to follow guide to implementing the full power of SugarCRM. SugarCRM is an extensive PHP/MySQL based application but with its rich administration interfaces no programming is required to get the most of it.",
    "name": "Implementing SugarCRM",
    "category": "ERP &amp; CRM"
  },
  {
    "author": "Steve Fox",
    "pages": 456,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9d303e1d5.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-1184-9584-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Beginning SharePoint 2013 Development.pdf",
    "year": "2013",
    "language": "English",
    "price": 93,
    "description": "Fully updated for SharePoint 2013, this book is an ideal starting place for SharePoint development. Covering all the major topics that a new developer needs to know in order to get started, this resource contains 100 percent new content and addresses the major overhaul to the SharePoint 2013 platform. The team of authors, led by Microsoft s Steve Fox, presents you with a detailed overview that helps you establish a starting point for development. They then walk you through ways to advance your knowledge so that you leverage the new SharePoint 2013 features to build custom solutions.",
    "name": "Beginning SharePoint 2013 Development",
    "category": "SharePoint"
  },
  {
    "author": "Paolo Pialorsi",
    "pages": 794,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9d125a2dc.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-73567-071-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2013 Developer Reference.pdf",
    "year": "2013",
    "language": "English",
    "price": 51,
    "description": "Develop your business collaboration solutions quickly and effectively with the rich set of tools, classes, libraries, and controls available in Microsoft SharePoint 2013. With this practical reference, enterprise-development expert Paolo Pialorsi shows you how to extend and customize the SharePoint environmentand helps you sharpen your development skills. Ideal for ASP.NET developers with Microsoft .NET and C# knowledge.",
    "name": "Microsoft SharePoint 2013 Developer Reference",
    "category": "SharePoint"
  },
  {
    "author": "Steve Wright",
    "pages": 432,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cea0aa87.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-5884-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint 2013 App Development.pdf",
    "year": "2013",
    "language": "English",
    "price": 89,
    "description": "Apps have taken the world by storm, and now they re taking SharePoint as well. The biggest new thing in SharePoint 2013, apps are the solution to creating custom code that runs on not just your own SharePoint deployment, but also on othersimplementations as well.\nPro SharePoint 2013 App Development is your must-have guide to developing app solutions that run on the SharePoint 2013 platform. Using step-by-step tutorials, author Steve Wright creates a sample SharePoint app throughout the course of the book, and you can walk with him through the entire lifecycle of a SharePoint app.",
    "name": "Pro SharePoint 2013 App Development",
    "category": "SharePoint"
  },
  {
    "author": "Peter Ward",
    "pages": 278,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9d098343b.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-510-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2013 Disaster Recovery Guide.pdf",
    "year": "2013",
    "language": "English",
    "price": 112,
    "description": "Where does it all go wrong with disaster recovery? Yes, why a disaster recovery plan fails the business and costs IT staff their jobs or a promotion? This book is an easytounderstand guide that explains how to get it right and why it often goes wrong.\nGiven that Microsoft s SharePoint platform has become a missioncritical application where business operations just cannot run without complete uptime of this technology, disaster recovery is one of the most important topics when it comes to SharePoint. Yet, support and an appropriate approach for this technology are still difficult to come by, and are often vulnerable to technical oversight and assumptions.",
    "name": "Microsoft SharePoint 2013 Disaster Recovery Guide",
    "category": "SharePoint"
  },
  {
    "author": "Rob Garrett",
    "pages": 672,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cef17117.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-4941-2",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint 2013 Administration, 2nd Edition.pdf",
    "year": "2013",
    "language": "English",
    "price": 138,
    "description": "Pro SharePoint 2013 Administration is a practical guide to SharePoint 2013 for intermediate to advanced SharePoint administrators and power users, covering the out-of-the-box feature set and capabilities of Microsoft s collaboration and business productivity platform.\nStarting with a detailed deployment and initial configuration walkthrough, the book covers all major feature areas, including document management, social computing, metadata management, and administration. You ll also learn about planning for capacity, backup administration and disaster recovery, business intelligence, monitoring, and more. Unlike other books, Pro SharePoint 2013 Administration covers all elements of the product, but has a specific emphasis on features new and enhanced in the 2013 release.",
    "name": "Pro SharePoint 2013 Administration, 2nd Edition",
    "category": "SharePoint"
  },
  {
    "author": "Thomas Resing",
    "pages": 904,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9d03d0360.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-73566-699-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2013 Inside Out.pdf",
    "year": "2013",
    "language": "English",
    "price": 171,
    "description": "You re beyond the basics, so dive right into SharePoint 2013and really put your business collaboration platform to work! This supremely organized reference packs hundreds of timesaving solutions, troubleshooting techniques, and workarounds. It s all muscle and no fluff. Discover how the experts facilitate information sharing across the enterpriseand challenge yourself to new levels of mastery.",
    "name": "Microsoft SharePoint 2013 Inside Out",
    "category": "SharePoint"
  },
  {
    "author": "Geoff Evelyn",
    "pages": 388,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cf9bf330.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-73567-164-5",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2013 Planning for Adoption and Governance.pdf",
    "year": "2013",
    "language": "English",
    "price": 139,
    "description": "Take control of the complex requirements for delivering a SharePoint 2013 solution to your organization. Led by a SharePoint MVP specializing in SharePoint service delivery, you ll learn proven methods to help you prepare for a smooth adoption and governance process throughout the enterprise. This guide is ideal for IT professionals, including service delivery managers, project and program managers, and business analysts.",
    "name": "Microsoft SharePoint 2013: Planning for Adoption and Governance",
    "category": "SharePoint"
  },
  {
    "author": "Steve Goodyear",
    "pages": 375,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cf4c806b.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-6169-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Practical SharePoint 2013 Enterprise Content Management.pdf",
    "year": "2013",
    "language": "English",
    "price": 126,
    "description": "Practical SharePoint 2013 Enterprise Content Management is the first book to guide you through planning and designing each phase of your information life cycle with SharePoint 2013. Author and SharePoint expert Steve Goodyear walks you through how to analyze and plan enterprise content management (ECM) solutions for an effective and end-to-end information design based on your organization s needs and business requirements.\nInside, you will develop a full understanding of how SharePoint 2013 manages content including identifying and understanding your organization s information within SharePoint, collaborating on transitory content, and capturing and controlling your records. You ll get practical advice and best practice instruction for each phase of the information life cycle to guide you on designing your ECM strategy and implementing your own ECM solution.",
    "name": "Practical SharePoint 2013 Enterprise Content Management",
    "category": "SharePoint"
  },
  {
    "author": "Shannon Bray",
    "pages": 488,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cfebeea6.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-73567-168-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2013 Designing and Architecting Solutions.pdf",
    "year": "2013",
    "language": "English",
    "price": 105,
    "description": "Determine the best design for your SharePoint implementation by gaining a deeper understanding of how the platform works. Written by a team of SharePoint experts, this practical guide introduces the Microsoft SharePoint 2013 architecture, and walks you through design considerations for planning and building a custom SharePoint solution. It s ideal for IT professionals, whether or not you have experience with previous versions of SharePoint.",
    "name": "Microsoft SharePoint 2013: Designing and Architecting Solutions",
    "category": "SharePoint"
  },
  {
    "author": "Ted Pattison",
    "pages": 202,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9d174eaa8.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-7356-7498-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2013 App Development.pdf",
    "year": "2013",
    "language": "English",
    "price": 163,
    "description": "Your guide to designing apps that extend the capabilities of your SharePoint site.\nTake advantage of the most important new concept in Microsoft SharePoint 2013the app. Led by two SharePoint experts, you ll learn development techniques such as building app lists, creating event handlers, and the major classes in the object model that provide access to content stored in SharePoint.",
    "name": "Microsoft SharePoint 2013 App Development",
    "category": "SharePoint"
  },
  {
    "author": "Ted Pattison",
    "pages": 600,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9d1c43e28.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-73567-447-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Inside Microsoft SharePoint 2013.pdf",
    "year": "2013",
    "language": "English",
    "price": 85,
    "description": "Build custom SharePoint solutions with architectural insights from the experts.\nTake a deep dive into SharePoint 2013, and master the intricacies for designing and implementing robust apps and other business solutions for your organization. Led by an author team with in-depth knowledge of SharePoint architecture, you ll thoroughly explore the SharePoint 2013 development platform and new app model through hands-on tasks and extensive code samples.",
    "name": "Inside Microsoft SharePoint 2013",
    "category": "SharePoint"
  },
  {
    "author": "Steve Wright",
    "pages": 440,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cdfbcf58.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-5893-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint 2013 Business Intelligence Solutions.pdf",
    "year": "2013",
    "language": "English",
    "price": 62,
    "description": "To get ahead in today s hyper-competitive marketplace, your business has to take advantage of the data you already have and mine that data to give you new insight, metrics, and clues to what drives successful customer interactions. In Pro SharePoint 2013 Business Intelligence Solutions, you ll learn exactly how to unlock that magic, build business intelligence facilities on SharePoint, and glean insights from data to propel your business to the next level.\nTo understand the various business intelligence offerings in SharePoint 2013, you need to understand the core SQL Server business intelligence concepts, and the first part of the book presents a comprehensive tutorial on those fundamentals.",
    "name": "Pro SharePoint 2013 Business Intelligence Solutions",
    "category": "SharePoint"
  },
  {
    "author": "Rita Zhang",
    "pages": 580,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9ce4d593b.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-5028-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint 2013 Branding and Responsive Web Development.pdf",
    "year": "2013",
    "language": "English",
    "price": 98,
    "description": "Pro SharePoint 2013 Branding and Responsive Web Development is the definitive reference on the technologies, tools, and techniques needed for building responsive websites and applications with SharePoint 2013. The book focuses on solutions that provide the best browser experience for the myriad of devices, browsers, and screen orientations and resolutions.\nWeb technology has changed considerably in the past few years. Microsoft has embraced the new generation of open standards represented by HTML5 and JavaScript, and these changes are represented in a fundamental shift in how SharePoint 2013 supports web content management and publishing.",
    "name": "Pro SharePoint 2013 Branding and Responsive Web Development",
    "category": "SharePoint"
  },
  {
    "author": "Scot Hillier",
    "pages": 816,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cd0a46b0.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-1184-9582-7",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Professional SharePoint 2013 Development.pdf",
    "year": "2013",
    "language": "English",
    "price": 40,
    "description": "A team of well-known Microsoft MVPs joins forces in this fully updated resource, providing you with in-depth coverage of development tools in the latest iteration of the immensely popular SharePoint. From building solutions to building custom workflow and content management applications, this book shares field-tested best practices on all aspect of SharePoint 2013 development.",
    "name": "Professional SharePoint 2013 Development",
    "category": "SharePoint"
  },
  {
    "author": "Anthony Smith",
    "pages": 536,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cc183d1b.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-4833-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint 2013 User-s Guide, 4th Edition.pdf",
    "year": "2013",
    "language": "English",
    "price": 117,
    "description": "Microsoft SharePoint 2013 provides a collection of tools and services you can use to improve user and team productivity, make information sharing more effective, and facilitate business decisionmaking processes. In order to get the most out of SharePoint 2013, you need to understand how to best use the capabilities to support your information management, collaboration, and business process management needs. The SharePoint 2013 User s Guide is designed to provide you with the information you need to effectively use these tools.",
    "name": "SharePoint 2013 User&#8217;s Guide, 4th Edition",
    "category": "SharePoint"
  },
  {
    "author": "Mike Oryszak",
    "pages": 282,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cbc693f9.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-8496-8360-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2010 Business Application Blueprints.pdf",
    "year": "2012",
    "language": "English",
    "price": 165,
    "description": "Instant SharePointBuild nine exciting SharePoint business solutions. Expand your knowledge of the SharePoint platform so that you can tailor the sample solutions to your requirements. Learn how the different development techniques can be used in various situations to support both client side and server side development to solve different problems in different environments.",
    "name": "Microsoft SharePoint 2010 Business Application Blueprints",
    "category": "SharePoint"
  },
  {
    "author": "Todd Klindt",
    "pages": 840,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cd5ade63.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-49581-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Professional SharePoint 2013 Administration.pdf",
    "year": "2013",
    "language": "English",
    "price": 186,
    "description": "The new iteration of SharePoint boasts exciting new features. However, any new version also comes with its fair share of challenges and that s where this book comes in. The team of SharePoint admin gurus returns to presents a fully updated resource that prepares you for making all the new SharePoint 2013 features work right. They cover all of the administration components of SharePoint 2013 in detail, and present a clear understanding of how they affect the role of the administrator.",
    "name": "Professional SharePoint 2013 Administration",
    "category": "SharePoint"
  },
  {
    "author": "Randy Drisgill",
    "pages": 432,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9ccba1c56.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-49567-4",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint 2013 Branding and User Interface Design.pdf",
    "year": "2013",
    "language": "English",
    "price": 69,
    "description": "If you are planning, designing, and launching your brand using SharePoint, this book and author trio will walk you through everything you need to know in an understandable and approachable way. From specific technologies such as master pages, page layouts, and CSS to offering best-practices and real-world experience for creating successful branding projects through SharePoint 2013, you will learn how to approach your branding project in effective new ways. This visual book provides step-by-step instructions in a simple and striking format that focuses on each of the tasks you will face in your own branding project.",
    "name": "SharePoint 2013 Branding and User Interface Design",
    "category": "SharePoint"
  },
  {
    "author": "Stephen Cummins",
    "pages": 264,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cdaaddc9.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-6328-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint Disaster Recovery and High Availability, 2nd Edition.pdf",
    "year": "2013",
    "language": "English",
    "price": 88,
    "description": "Few IT professionals take the time to learn what needs to be known to do disaster recovery well. Most labor under the pretense that good administration equals close to five-nines uptime. Most technical people do not see the value of planning for disasters until the unexpected has already happened, and the effects of a disaster involving a SharePoint farm-which today houses business information, line-of-business applications, sensitive information, extranets, and other highly important assets-can be staggering.\nPro SharePoint Disaster Recovery and High Availability, 2nd Edition will take you through a step-by-step process to show how to build an awareness and reaction plan for the inevitable.",
    "name": "Pro SharePoint Disaster Recovery and High Availability, 2nd Edition",
    "category": "SharePoint"
  },
  {
    "author": "Erik Swenson",
    "pages": 368,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cb661f84.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-4026-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Practical SharePoint 2010 Branding and Customization.pdf",
    "year": "2012",
    "language": "English",
    "price": 85,
    "description": "SharePoint 2010 deployments are more common than ever, as is the desire to make the environment branded and attractive to both internal and external clients. However, since SharePoint is more than just a collection of web pages, customizing the look and feel and completing the process of branding the platform itself is complex and requires a knowledge of web development, web design techniques, and a familiarity with SharePoint administrationa curious niche, to be sure. And sometimes, you just need to make quick fixes, while at other times, building an entirely customized and branded environment is a multi-step process with lots of stakeholder buy-in and development time required.",
    "name": "Practical SharePoint 2010 Branding and Customization",
    "category": "SharePoint"
  },
  {
    "author": "Ruven Gotz",
    "pages": 268,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cb168d85.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-4176-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Practical SharePoint 2010 Information Architecture.pdf",
    "year": "2012",
    "language": "English",
    "price": 176,
    "description": "Practical SharePoint 2010 Information Architecture is a guide and tool set for planning and documenting the scope, navigational taxonomy, document taxonomy, metadata, page layouts and workflows for a successful SharePoint 2010 project. If you have been tasked with delivering an intranet for collaboration, document management or as a corporate portal, your only chance for success is to get all of these elements right, and then to make sure that you and your stakeholders are all on the same page.",
    "name": "Practical SharePoint 2010 Information Architecture",
    "category": "SharePoint"
  },
  {
    "author": "Dux Raymond Sy",
    "pages": 228,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c9351658.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4493-0637-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint 2010 for Project Management, 2nd Edition.pdf",
    "year": "2012",
    "language": "English",
    "price": 56,
    "description": "If you were to analyze your team s performance on a typical project, you d be surprised how much time is wasted on non-productive tasks. This hands-on guide shows you how to work more efficiently by organizing and managing projects with SharePoint 2010. You ll learn how to build a Project Management Information System (PMIS), customized to your project, that can effectively coordinate communication and collaboration among team members.\nWritten by a certified Project Management Professional (PMP) and Microsoft SharePoint MVP with 15 years of IT project management experience, each chapter includes step-by-step guides as well as workshops that help you practice what you learn.",
    "name": "SharePoint 2010 for Project Management, 2nd Edition",
    "category": "SharePoint"
  },
  {
    "author": "Steve Fox",
    "pages": 336,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c7f0d702.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-7356-5662-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Developing Microsoft SharePoint Applications Using Windows Azure.pdf",
    "year": "2011",
    "language": "English",
    "price": 114,
    "description": "Deliver custom, cloud-based business solutions using SharePoint 2010 and Windows Azure together. By applying hands-on techniques from Microsoft cloud development expert Steve Fox, you ll learn how to increase the reach, resource capability, and reusability of your apps. Get the practical code exercises and solid advice you needwhether you re planning to build complete data-driven applications or hybrid solutions with simple Web parts.",
    "name": "Developing Microsoft SharePoint Applications Using Windows Azure",
    "category": "SharePoint"
  },
  {
    "author": "Steven Mann",
    "pages": 456,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c9856f91.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-1181-0505-4",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint 2010 Field Guide.pdf",
    "year": "2012",
    "language": "English",
    "price": 114,
    "description": "Aimed at the more than 100 million licensed SharePoint 2010 users, this indispensable field guide addresses an abundance of common SharePoint 2010 problems and offers proven solutions. A team of authors encourages you to customize SharePoint beyond the out-of-the-box functionality so that you can build more complex solutions to these challenges. You ll discover intricate details and specific full-scale solutions that you can then implement to your own SharePoint 2010 solutions.",
    "name": "SharePoint 2010 Field Guide",
    "category": "SharePoint"
  },
  {
    "author": "Paul Ferrill",
    "pages": 80,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c8e5324e.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4493-2116-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint Apps with LightSwitch.pdf",
    "year": "2012",
    "language": "English",
    "price": 45,
    "description": "Build custom business applications for SharePoint with Visual Studio LightSwitchincluding intuitive apps that don t require a single line of code. This example-driven guide takes non-programmers step-by-step through the process of creating simple apps and utilities, and shows programmers familiar with C# or Visual Basic how to build customized applications with more functionality.\nDiscover how to build and test your applications quickly without a lot of expensive server hardware. Once you get up to speed with LightSwitch, you ll create quality line-of-business applications tailored to specific customer needs in no time, whether you work in-house or for a vendor.",
    "name": "SharePoint Apps with LightSwitch",
    "category": "SharePoint"
  },
  {
    "author": "Paul Stork",
    "pages": 268,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9cac54dd4.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-4182-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint 2010 Development for Office 365.pdf",
    "year": "2012",
    "language": "English",
    "price": 174,
    "description": "It s no secret that cloud-based computing is the next big movement in IT, and Microsoft is right there in the market with Office 365a cloud-based productivity suite which includes a hosted, cloud-focused version of SharePoint 2010.\nSharePoint 2010 developers who have traditionally developed for on-premise environments will suddenly find themselves being asked to develop for the cloud. While there is a lot of overlap between cloud-based and traditional SharePoint development, there are also some important differences and considerations that must be taken into account as well. In particular, the proliferation of cloud-based solutions was a driving force behind certain new features in SharePoint 2010, like sandboxed solutions and the new client object model.",
    "name": "Pro SharePoint 2010 Development for Office 365",
    "category": "SharePoint"
  },
  {
    "author": "Robert Piddocke",
    "pages": 486,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c841d833.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-7356-6222-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Working with Microsoft FAST Search Server 2010 for SharePoint.pdf",
    "year": "2012",
    "language": "English",
    "price": 136,
    "description": "Deliver powerful search tools to your clientsusing Microsoft FAST Search Server 2010 for SharePoint. Led by three search experts, you ll learn how to deliver advanced intranet search capabilities and build custom, search-driven applications for your business. Use your skills as a SharePoint architect or developer to configure and program this server for different search scenarios, based on real-world examples.",
    "name": "Working with Microsoft FAST Search Server 2010 for SharePoint",
    "category": "SharePoint"
  },
  {
    "author": "Steve Wright",
    "pages": 332,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9ca74c9a7.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-4077-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint 2010 Governance.pdf",
    "year": "2012",
    "language": "English",
    "price": 89,
    "description": "Pro SharePoint 2010 Governance is the first book on the market focusing exclusively on the essential guidance necessary for leveraging SharePoint 2010 within your organization s intranet, extranet or Internet environment for maximum business value. Effective governance allows your organization to promote the adoption of SharePointâ\u0080\u0099s productivity-enhancing features while maintaining security and control over your organization s most vital information.\nPro SharePoint 2010 Governance presents comprehensive guidance, from the basics ofWhat is governance?to the detailed considerations of IT, information and application management. Using the conceptual framework promoted by Microsoft and augmented with detailed discussions, recommendations and checklists, you will have all the information you need to streamline the governance of your SharePoint sites.",
    "name": "Pro SharePoint 2010 Governance",
    "category": "SharePoint"
  },
  {
    "author": "Phill Duffy",
    "pages": 272,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9ca2533bd.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-4098-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint with jQuery.pdf",
    "year": "2012",
    "language": "English",
    "price": 105,
    "description": "Pro SharePoint with jQuery is all about how to work seamlessly with the two popular technologies to create rich and interactive web parts, application pages, and more. In this book, author Phill Duffy provides complete, meaningful and realistic examples to really help you understand the key concepts and their integration points. Inside, you ll find all the tools and resources you need to use jQuery to provide the next level of SharePoint functionality.",
    "name": "Pro SharePoint with jQuery",
    "category": "SharePoint"
  },
  {
    "author": "Mark Miller",
    "pages": 268,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c9d5ccb1.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4493-2100-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint 2010 at Work.pdf",
    "year": "2012",
    "language": "English",
    "price": 42,
    "description": "If you work with SharePoint, you may have discovered that there are countless tricks for using this platform to solve real-world problemsand you certainly wouldn t mind learning some of them. That s the purpose behind EndUserSharePoint, a community site that lets end users share ingenious new ways for putting SharePoint to work.\nThis insightful and entertaining book presents a compilation of popular, well-written articles from the site, published by contributors for people who use SharePoint at their companies but don t have access to its technical server side. Each engaging story puts you into the narrative as a participant, rather than a passive observer, so you can easily visualize the situation and share theaha!solution with the author. Learn some tricks, gain some insightand have fun doing it.",
    "name": "SharePoint 2010 at Work",
    "category": "SharePoint"
  },
  {
    "author": "Martin Reid",
    "pages": 504,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c89605d8.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-93906-2",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint Server 2010 Administration 24 Hour Trainer.pdf",
    "year": "2012",
    "language": "English",
    "price": 45,
    "description": "Aimed at anyone who needs to learn SharePoint, yet doesn t require the deep knowledge of an architect, this book-and-video combination explores all aspects of the SharePoint technology and provides expert guidance so you can confidently configure and administer a site or site collection. Each lesson covered in the book is supported by a video demonstration, introducing you to a variety of SharePoint Server 2010 topics from organization concerns to training plans to programmer best practices. You ll find this book-and-video package to be invaluable as you develop a set of policies that will help you avoid challenges that arise from poorly planned or managed portal or intranet products.",
    "name": "SharePoint Server 2010 Administration 24 Hour Trainer",
    "category": "SharePoint"
  },
  {
    "author": "Penelope Coventry",
    "pages": 512,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c5180894.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-7356-2726-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint Foundation 2010 Step by Step.pdf",
    "year": "2011",
    "language": "English",
    "price": 79,
    "description": "Experience learning made easy-and quickly teach yourself how to use Microsoft SharePoint Foundation to enable effective team collaboration. With Step By Step, you set the pace-building and practicing the skills you need, just when you need them.\nBuild your own SharePoint site with easy-to-use templates; Create lists and libraries to store information; Add discussion boards, wikis, and blogs; Set up Document and Meeting Workspaces for easy collaboration; Share calendars, contacts, and data from Microsoft Office programs; Customize your pages with Web Parts.",
    "name": "Microsoft SharePoint Foundation 2010 Step by Step",
    "category": "SharePoint"
  },
  {
    "author": "Barry Ralston",
    "pages": 304,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c4c88e01.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-3380-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/PowerPivot for Business Intelligence Using Excel and SharePoint.pdf",
    "year": "2011",
    "language": "English",
    "price": 195,
    "description": "PowerPivot comprises a set of technologies for easy access to data mining and business intelligence analysis from Microsoft Excel and SharePoint. Power users and developers alike can create sophisticated, online analytic processing (OLAP) solutions using PowerPivot for Excel, and then share those solutions with other users via PowerPivot for SharePoint. Data can be pulled in from any of the leading database platforms, as well as from spreadsheets and flat files.\nThe book takes a scenario-based approach to showing you how to collect data, to mine that data through insightful analysis, and to draw conclusions that drive business performance.",
    "name": "PowerPivot for Business Intelligence Using Excel and SharePoint",
    "category": "SharePoint"
  },
  {
    "author": "Tahir Naveed",
    "pages": 760,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c7a11a09.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-3870-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Expert SharePoint 2010 Practices.pdf",
    "year": "2011",
    "language": "English",
    "price": 80,
    "description": "Expert SharePoint 2010 Practices is a valuable compendium of best practices, tips, and secrets straight from the most knowledgeable SharePoint gurus in the industry.\nLearn from the experts as you dive into topics like multitenancy, solution deployment, business intelligence, and administration. Our team of carefully chosen contributors, most with Microsoft s Most Valuable Professional (MVP) designation bestowed upon them, shares with you the secrets and practices that have brought them success in a wide variety of SharePoint scenarios.",
    "name": "Expert SharePoint 2010 Practices",
    "category": "SharePoint"
  },
  {
    "author": "Ted Pattison",
    "pages": 648,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c74c5995.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-73562-746-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Inside Microsoft SharePoint 2010.pdf",
    "year": "2011",
    "language": "English",
    "price": 31,
    "description": "Build custom SharePoint 2010 solutions with deep architectural insights from the experts.\nGet a detailed look inside SharePoint 2010and master the intricacies of developing intranets, extranets, and Web-based applications. Guided by an author team with in-depth knowledge of SharePoint architecture, you ll gain task-oriented guidance and extensive code samples to help you build robust business solutions.",
    "name": "Inside Microsoft SharePoint 2010",
    "category": "SharePoint"
  },
  {
    "author": "Peter Serzo",
    "pages": 288,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c6ab457c.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-108-7",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2010 Administration Cookbook.pdf",
    "year": "2011",
    "language": "English",
    "price": 113,
    "description": "Microsoft SharePoint 2010 Administration Cookbook starts off by demonstrating the various upgrading and post-upgrading tasks to be performed in SharePoint 2010. Next come recipes for managing SharePoint service-level applications and for monitoring the SharePoint environment. The book introduces one of the best new tools that should be in your arsenal, PowerShell, and the commands you will need to script your tasks with Powershell.",
    "name": "Microsoft SharePoint 2010 Administration Cookbook",
    "category": "SharePoint"
  },
  {
    "author": "Callahan",
    "pages": 1298,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c6fc5e1c.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-62638-2, 0470626380",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Mastering Microsoft SharePoint Foundation 2010.pdf",
    "year": "2011",
    "language": "English",
    "price": 106,
    "description": "Everything IT professionals need to administer their collaborative environment\nSharePoint Foundation 2010 is the newest version of a powerful collaboration tool used in many organizations. This book gets network professionals and business application administrators up to speed on SharePoint Foundation s features, installation procedures, and administration, preparing them to create powerful collaboration structures for their companies.\n* Microsoft SharePoint Foundation 2010 is the successor to Windows SharePoint Services 3.0 and both stands alone to enable collaboration, and is the underlying technology of SharePoint Server 2010; this guide prepares IT professionals to install and service SharePoint Foundation 2010<br />\n* Designed for experienced server administrators, this book focuses directly on the skills an administrator would need to master SharePoint Foundation 2010 from the ground up<br />\n* Covers administration, management, disaster recovery, and migrating from Windows SharePoint Services 3.0 to Windows SharePoint Foundation 2010\nPacked with insider tips, tricks, and real-world examples to support the instructions, Mastering Microsoft SharePoint Foundation 2010 gets administrators up to speed quickly on this essential technology.",
    "name": "Mastering Microsoft SharePoint Foundation 2010",
    "category": "SharePoint"
  },
  {
    "author": "Yaroslav Pentsarskyy",
    "pages": 310,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c65bced5.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-410-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2010 and Windows PowerShell 2.0.pdf",
    "year": "2011",
    "language": "English",
    "price": 61,
    "description": "Dive straight into expert recipes for SharePoint and PowerShell administration without dwelling on the basics. Master how to administer BCS in SharePoint, automate the configuration of records management features, create custom PowerShell cmdlets, and much more in this book. A hands-on cookbook focusing on only the most high level tips and tricks for mastering SharePoint and PowerShell administration.",
    "name": "Microsoft SharePoint 2010 and Windows PowerShell 2.0",
    "category": "SharePoint"
  },
  {
    "author": "Steven Mann",
    "pages": 352,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c60beeaf.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-672-33551-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2010 Business Intelligence Unleashed.pdf",
    "year": "2011",
    "language": "English",
    "price": 140,
    "description": "SharePoint 2010 is today s leading presentation and deployment system for Business Intelligence (BI) solutions based on Microsoft technologies. This book brings together all the information you need to successfully implement and use SharePoint 2010 s powerful BI capabilities. It reflects the unsurpassed real-world experience of five expert consultants at RDA, a Microsoft Gold Partner specializing in delivering advanced BI solutions with SharePoint.",
    "name": "Microsoft SharePoint 2010 Business Intelligence Unleashed",
    "category": "SharePoint"
  },
  {
    "author": "Troy Lanphier",
    "pages": 800,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c569639d.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-73562-724-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint Foundation 2010 Inside Out.pdf",
    "year": "2011",
    "language": "English",
    "price": 171,
    "description": "You re beyond the basics-so dive right in and really support collaboration. This supremely organized reference packs hundreds of timesaving solutions, troubleshooting tips, and workarounds. It s all muscle and no fluff. Discover how the experts tackle SharePoint Foundation 2010and challenge yourself to new levels of mastery!",
    "name": "Microsoft SharePoint Foundation 2010 Inside Out",
    "category": "SharePoint"
  },
  {
    "author": "Todd Spatafore",
    "pages": 252,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c5bb204a.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-258-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2010 Enterprise Applications on Windows Phone 7.pdf",
    "year": "2011",
    "language": "English",
    "price": 174,
    "description": "Provides step-by-step instructions for integrating Windows Phone 7-capable web pages into SharePoint websites. Provides an overview of creating Windows Phone 7 applications that integrate with SharePoint services. Examines Windows Phone 7 s enterprise capabilities. Highlights SharePoint communities and their use in a Windows Phone 7-connected enterprise. Learn from a distinguished author with hands on experience, and get started with developing SharePoint websites and applications for Windows Phone 7 quickly.",
    "name": "Microsoft SharePoint 2010 Enterprise Applications on Windows Phone 7",
    "category": "SharePoint"
  },
  {
    "author": "Wictor Wilen",
    "pages": 448,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c19f27df.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-93518-277-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint 2010 Web Parts in Action.pdf",
    "year": "2011",
    "language": "English",
    "price": 70,
    "description": "If you look at a SharePoint application you ll find that most of its active components are Web Parts. SharePoint 2010 includes dozens of prebuilt Web Parts that you can use. It also provides an API that lets you build custom Web Parts using C# or VB.NET.\nSharePoint 2010 Web Parts in Action is a comprehensive guide to deploying, customizing, and creating Web Parts. Countless examples walk you through everything from design, to development, deployment, troubleshooting, and upgrading.",
    "name": "SharePoint 2010 Web Parts in Action",
    "category": "SharePoint"
  },
  {
    "author": "Stephen Cummins",
    "pages": 276,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c426f905.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-3951-2",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint 2010 Disaster Recovery and High Availability.pdf",
    "year": "2011",
    "language": "English",
    "price": 150,
    "description": "Few IT professionals take the time to learn what needs to be known to do disaster recovery well. Most labor under the pretense that good administration equals close to five-nines uptime. Most technical people do not see the value of planning for disasters until the unexpected has already happened, and the effects of a disaster involving a SharePoint farm-which today houses business information, line-of-business applications, sensitive information, extranets, and other highly important assets-can be staggering.",
    "name": "Pro SharePoint 2010 Disaster Recovery and High Availability",
    "category": "SharePoint"
  },
  {
    "author": "Robert Piddocke",
    "pages": 520,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c3d75f33.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-3407-4",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint 2010 Search.pdf",
    "year": "2011",
    "language": "English",
    "price": 34,
    "description": "Pro SharePoint 2010 Search gives you expert advice on planning, deploying and customizing searches in SharePoint 2010. Drawing on the authorsextensive experience of working with real-world SharePoint deployments, this book teaches everything you ll need to know to create well-designed SharePoint solutions that always keep the end-user s experience in mind.\nThis practical hands-on book is a must-have resource for anyone looking to unlock the full potential of their SharePoint server s search capabilities.",
    "name": "Pro SharePoint 2010 Search",
    "category": "SharePoint"
  },
  {
    "author": "Steve Wright",
    "pages": 476,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c3871d69.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-3617-7",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint Designer 2010.pdf",
    "year": "2011",
    "language": "English",
    "price": 61,
    "description": "SharePoint 2010 offers developers, designers, and users a sophisticated intranet, web application, and Internet site platform. But until now, SharePoint users have had to painfully edit code or seek developer assistance to customize more than just the most minor parts of their sites. All of that has changed with SharePoint Designer 2010. Gain complete control and enhance your SharePoint sites with a depth not previously possible using this book. Pro SharePoint Designer 2010 is your soup-to-nuts reference for unlocking the power of SharePoint Designer.\nCovering everything you ll need to know to create custom, rich SharePoint experiences, Pro SharePoint Designer 2010 is a masterful guide to getting the most from this powerful application quickly and easily.",
    "name": "Pro SharePoint Designer 2010",
    "category": "SharePoint"
  },
  {
    "author": "Steve Fox",
    "pages": 432,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c2e63c18.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-1180-7657-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Professional SharePoint 2010 Cloud-Based Solutions.pdf",
    "year": "2011",
    "language": "English",
    "price": 78,
    "description": "If you want to be part of the next major shift in the IT industry, you ll want this book. Melding two of the hottest trends in the industrythe widespread popularity of the SharePoint collaboration platform and the rapid rise of cloud computingthis practical guide shows developers how to extend their SharePoint solutions with the cloud s almost limitless capabilities. See how to get started, discover smart ways to leverage cloud data and services through Azure, start incorporating Twitter or LinkedIn into your solutions, find the best ways to secure everything, and much more.",
    "name": "Professional SharePoint 2010 Cloud-Based Solutions",
    "category": "SharePoint"
  },
  {
    "author": "Patrick LeBlanc",
    "pages": 432,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c2954e6d.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-1180-2642-7",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint 2010 Business Intelligence 24-Hour Trainer.pdf",
    "year": "2011",
    "language": "English",
    "price": 167,
    "description": "Written by a team of leading SharePoint and Business Intelligence (BI) experts, this unique book package shows you how to successfully build and deliver BI applications using SharePoint 2010. Assuming no previous SharePoint experience, the authors deliver a clear explanation of what SharePoint will do for your BI and information management capabilities.\nAs you learn best practices for configuring and securing SharePoint 2010 BI applications and planning and implementing your SharePoint BI project plan, you ll be well on your way to gaining a solid foundation of understanding and working with SharePoint 2010 and BI.",
    "name": "SharePoint 2010 Business Intelligence 24-Hour Trainer",
    "category": "SharePoint"
  },
  {
    "author": "Rob Garrett",
    "pages": 412,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c476f47b.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-3792-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint 2010 Administration.pdf",
    "year": "2011",
    "language": "English",
    "price": 151,
    "description": "Pro SharePoint 2010 Administration is a practical guide to SharePoint 2010 for intermediate to advanced SharePoint administrators and power users, covering the out-of-the-box feature set and capabilities of Microsoft s collaboration and business productivity platform.\nStarting with a detailed deployment and initial configuration walkthrough, the book covers all major feature areas, including document management, social computing, metadata management, and administration. You ll also learn about planning for capacity, backup administration and disaster recovery, business intelligence, monitoring, and more. Unlike other books, Pro SharePoint 2010 Administration covers all elements of the product, but has a specific emphasis on features new and enhanced in the 2010 release.",
    "name": "Pro SharePoint 2010 Administration",
    "category": "SharePoint"
  },
  {
    "author": "Paul Stubbs",
    "pages": 624,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c245a113.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-321-76959-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint 2010 Development with Silverlight.pdf",
    "year": "2011",
    "language": "English",
    "price": 42,
    "description": "Developers increasingly want to build rich applications that run in the SharePoint 2010 browser user interface while offering a far more compelling and engaging experience than conventional web pages. One proven technology gives them all the tools and resources they need to achieve these goals: Silverlight. Using Silverlight and SharePoint together, developers can create state-of-the-art applications that utilize Silverlight s outstanding user experience, and fully leverage the vast collections of business data already stored in corporate SharePoint deployments.",
    "name": "SharePoint 2010 Development with Silverlight",
    "category": "SharePoint"
  },
  {
    "author": "Wes Preston",
    "pages": 600,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c1f382c2.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4571-0397-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint 2010 Six-in-One.pdf",
    "year": "2011",
    "language": "English",
    "price": 144,
    "description": "A team of SharePoint authorities addresses the six most essential areas of SharePoint 2010\nSharePoint enables Web sites to host shared workspaces and is a leading solution for Enterprise Content Management. This book serves as one-stop shopping for concise coverage on six key areas that you need to know in order to get up and running with SharePoint 2010 quickly. After an introduction to the new features of SharePoint 2010, the author team of SharePoint experts walk you through branding and customization, workflow, business connectivity services, social networking and tools, the search function, and development basics so you can get started using SharePoint immediately.",
    "name": "SharePoint 2010 Six-in-One",
    "category": "SharePoint"
  },
  {
    "author": "Scot Hillier",
    "pages": 360,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c335c263.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4571-0529-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Professional Business Connectivity Services in SharePoint 2010.pdf",
    "year": "2011",
    "language": "English",
    "price": 189,
    "description": "As Microsoft s new multipurpose portal technology, Business Connectivity Services (BCS) is a brand new way for SharePoint users to seamlessly access and integrate data from any application or databases within SharePoint 2010. With this in-depth guide, a team of SharePoint experts walks you through the features of the new BCS, including the ability for users to view and modify the data from SharePoint 2010 with BCS. You ll explore how to use BCS, deploy solutions, create external content types and lists, create .NET host connectors, and more.",
    "name": "Professional Business Connectivity Services in SharePoint 2010",
    "category": "SharePoint"
  },
  {
    "author": "Susie Adams",
    "pages": 400,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9becc2038.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-59059-808-5",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro SharePoint Solution Development.pdf",
    "year": "2010",
    "language": "English",
    "price": 178,
    "description": "Pro SharePoint Solution Development: Combining .NET, SharePoint, and Office 2007 takes a practical problem / solution approach to common business challenges. You ll not only encounter interesting code samples, but also see how to combine these examples with the Microsoft collaboration platforms services. The books solutions focus on using Visual Studio Tools for Office to build the user interface layer. And solutions can interact with SharePoint as a service provider, taking advantage of SharePoints many collaboration features like document repositories, collaboration sites, and search functions.",
    "name": "Pro SharePoint Solution Development",
    "category": "SharePoint"
  },
  {
    "author": "Randy Drisgill",
    "pages": 456,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9be7bd69f.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-58464-4",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Professional SharePoint 2010 Branding and User Interface Design.pdf",
    "year": "2010",
    "language": "English",
    "price": 65,
    "description": "SharePoint 2010 allows for much more robust branding opportunities and this hands-on resource shares proven techniques for branding and user interface design so that you can execute a successful branding initiative with SharePoint 2010. After a review of branding and how it relates to SharePoint, the book addresses what s new in SharePoint 2010, including CSS, page layouts, themes, XSLT, Silverlight, and jQuery. You ll explore ways to plan, estimate, and create a brand in SharePoint while you also discover how to use SharePoint Designer 2010 with a SharePoint server.",
    "name": "Professional SharePoint 2010 Branding and User Interface Design",
    "category": "SharePoint"
  },
  {
    "author": "Laura Rogers",
    "pages": 480,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c0fe562d.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-7356-6206-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Using Microsoft InfoPath 2010 with Microsoft SharePoint 2010 Step by Step.pdf",
    "year": "2011",
    "language": "English",
    "price": 86,
    "description": "The smart way to learn how to build InfoPath forms for SharePoint-one step at a time!\nQuickly teach yourself how to use Microsoft InfoPath 2010 to create electronic business forms for Microsoft SharePoint 2010. With Step by Step, you set the pace-building and practicing the skills you need, just when you need them!\nDesign and build InfoPath forms without writing code; Add approval workflows to your InfoPath forms; Integrate data from SharePoint and other company systems; Create forms that offer a rich experience in the browser; Build views and dashboards to display form information; Create and use forms in the cloud with SharePoint Online.",
    "name": "Using Microsoft InfoPath 2010 with Microsoft SharePoint 2010 Step by Step",
    "category": "SharePoint"
  },
  {
    "author": "Penelope Coventry",
    "pages": 592,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9bf6bd8ac.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-7356-2733-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint Designer 2010 Step by Step.pdf",
    "year": "2010",
    "language": "English",
    "price": 64,
    "description": "The smart way to build applications with Microsoft SharePoint Designer 2010one step at a time!\nExperience learning made easyand quickly teach yourself how to create SharePoint 2010 applications and workflows with MicrosoftÂ® SharePointÂ® Designer 2010. With Step by Step, you set the pacebuilding and practicing the skills you need, just when you need them!",
    "name": "Microsoft SharePoint Designer 2010 Step by Step",
    "category": "SharePoint"
  },
  {
    "author": "Steven Mann",
    "pages": 792,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9bf1bb623.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-64383-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint Server 2010 Bible.pdf",
    "year": "2010",
    "language": "English",
    "price": 116,
    "description": "With SharePoint Server, an organization s information can be organized and combined in a central, Web-based application. Featuring in-depth coverage on all of SharePoint Server 2010 s new features, this authoritative resource provides you with solid timesaving techniques, fast solutions, and expert advice on connecting employees and managing data easily and efficiently. You ll explore ways SharePoint Server 2010 enhances corporate intranets and portals, proposal management portals, project management portals, team and customer collaboration sites, document management systems, and enterprise application integration portals.",
    "name": "Microsoft SharePoint Server 2010 Bible",
    "category": "SharePoint"
  },
  {
    "author": "Tim Kashani",
    "pages": 352,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9bfbcd20d.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-672-33094-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2010 PerformancePoint Services Unleashed.pdf",
    "year": "2010",
    "language": "English",
    "price": 56,
    "description": "This is a comprehensive, expert guide to all facets of planning, deploying, managing, and utilizing the brand-new SharePoint 2010 PerformancePoint Services. Authored by business and technical experts and a key member of the Microsoft PerformancePoint Services development team, this book demonstrates exactly how to apply PerformancePoint Services to gain real-time insight into all aspects of business performance.",
    "name": "Microsoft SharePoint 2010 PerformancePoint Services Unleashed",
    "category": "SharePoint"
  },
  {
    "author": "Geoff Evelyn",
    "pages": 290,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c00e38ca.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-73564-870-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Managing and Implementing Microsoft SharePoint 2010 Projects.pdf",
    "year": "2010",
    "language": "English",
    "price": 184,
    "description": "Delve into the capabilities of SharePoint 2010and determine the best way to put this technology to work for your organization. With this practical guide, you ll gain project management practices for implementing SharePoint, and learn how to customize the system to match the unique collaboration and data-sharing needs of your users.\nYour companion content includes a fully searchable online edition of the bookwith unlimited access on the Web. Customize SharePoint 2010 to fit the needs of your business with this hands-on guide.",
    "name": "Managing and Implementing Microsoft SharePoint 2010 Projects",
    "category": "SharePoint"
  },
  {
    "author": "Todd Kitta",
    "pages": 480,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c1504fb2.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-58465-1",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint Server 2010 Enterprise Content Management.pdf",
    "year": "2011",
    "language": "English",
    "price": 200,
    "description": "Within the pages of this book, a team of SharePoint Server and Enterprise Content Management (ECM) authorities takes you on a journey that examines the history of ECM, the capabilities that SharePoint Server 2010 offers for ECM, and the high-level ECM pillars that exist within SharePoint Server 2010. Once you have a strong foothold on what ECM is, the authors segue to in-depth coverage of document management and explorations of SharePoint workflow, collaboration, and search concepts as they apply to SharePoint as an ECM platform. Sparing no detail on a wide range of topics, this valuable resource boasts an abundance of helpful code samples and real-world examples to strengthen your learning experience.",
    "name": "SharePoint Server 2010 Enterprise Content Management",
    "category": "SharePoint"
  },
  {
    "author": "Shane Perran",
    "pages": 840,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c0ae3b71.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-61789-2",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Beginning SharePoint 2010.pdf",
    "year": "2010",
    "language": "English",
    "price": 171,
    "description": "SharePoint allows for the sharing of business information, ensuring that information is easily accessible to all those who need it. Through the use of diverse examples and real-world scenarios, the authors draw from their extensive experience to show you how to use SharePoint 2010 to deliver efficient and successful collaboration and communication in the workplace. They begin by taking you through the first steps of a SharePoint experience, laying a foundation upon which successive chapters build.",
    "name": "Beginning SharePoint 2010",
    "category": "SharePoint"
  },
  {
    "author": "Woodrow W. Windischman",
    "pages": 600,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9c05dab8c.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-64316-7",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Beginning SharePoint Designer 2010.pdf",
    "year": "2010",
    "language": "English",
    "price": 40,
    "description": "Microsoft SharePoint Designer 2010 is a powerful, sophisticated desktop application that allows you to customize websites based on Microsoft SharePoint 2010. Written by a team of SharePoint experts, this book provides you with an overview of the SharePoint Designer toolset and shows you how to use those tools to do far more than simply modify web pages. You ll learn to create and edit cascading style sheets, and visually design and edit code-free workflows. By the end of the book, you ll have acquired the skills necessary to modify, manage, and enhance virtually every aspect of a user s experience on a SharePoint 2010 website.",
    "name": "Beginning SharePoint Designer 2010",
    "category": "SharePoint"
  },
  {
    "author": "Martin Reid",
    "pages": 456,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9bd27c262.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-44875-5",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint 2007 for Office 2007 Users.pdf",
    "year": "2009",
    "language": "English",
    "price": 79,
    "description": "Aimed at end users who face the daunting task of mastering MOSS 2007 in the enterprise business environment, this book shows you how to make effective use of what can be a confusing array of features. You?ll review how SharePoint is central to the Microsoft Office platform because organizations use it to organize workflow, integrate Office documents with line of business applications, provide search capabilities across all types of documents and data, and distribute these tools internally and externally on Web sites for end users. Plus, the book offers you well-designed examples and explanations that can be easily applied in real-world situations.",
    "name": "Microsoft SharePoint 2007 for Office 2007 Users",
    "category": "SharePoint"
  },
  {
    "author": "Woodrow W. Windischman",
    "pages": 552,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9bcd916d3.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-28761-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Professional Microsoft Office SharePoint Designer 2007.pdf",
    "year": "2009",
    "language": "English",
    "price": 154,
    "description": "With Professional Microsoft Office SharePoint Designer 2007, you can master all aspects of using Share Point Designer in an Enterprise environment to enhance Microsoft SharePoint Products and Technologies. Review key integration points, how to use CSS editing tools to create and modify SharePoint themes, how to supplement SharePoint Designer functionality by using Microsoft Visual Studio, and how to create a rich interactive experience. If you need to connect SharePoint with other enterprise resources or create components to integrate into the SharePoint framework, this book will show you how to accomplish these tasks.",
    "name": "Professional Microsoft Office SharePoint Designer 2007",
    "category": "SharePoint"
  },
  {
    "author": "Mike Poole",
    "pages": 188,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9bc884c57.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84719-442-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint Designer Tutorial.pdf",
    "year": "2008",
    "language": "English",
    "price": 90,
    "description": "SharePoint is a web-based collaboration and document management platform from Microsoft. Microsoft Office SharePoint Designer (SPD) is a WYSIWYG HTML editor and web design program, which has replaced FrontPage, and is the ideal environment for working with pages on a SharePoint site.\nThis book is ideal for people new to SharePoint Designer who need to put together a working SharePoint site as quickly as possible. If you who want to get started, and finished, as quickly as possible, this book is for you. You won t just learn how to use SharePoint Designer; you ll see how to use it to put together a SharePoint site.",
    "name": "SharePoint Designer Tutorial",
    "category": "SharePoint"
  },
  {
    "author": "Gini Courter",
    "pages": 280,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9bbe910df.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-59059-690-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Beginning SharePoint with Excel.pdf",
    "year": "2006",
    "language": "English",
    "price": 61,
    "description": "Beginning SharePoint with Excel is for advanced Excel users who want to extend the usefulness of Excel by adding the collaborative features of SharePoint. There s no code in this book because it s not for programmers; nor is it for Excel beginners. It s for those who regularly use Excel in enterprise business environments and who want to leverage the power and capabilities of SharePoint.",
    "name": "Beginning SharePoint with Excel",
    "category": "SharePoint"
  },
  {
    "author": "Ishai Sagi",
    "pages": 400,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9bd7d1cd0.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-13-248744-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint 2010 How-To.pdf",
    "year": "2010",
    "language": "English",
    "price": 153,
    "description": "Need fast, reliable, easy-to-implement solutions for SharePoint 2010? This book delivers exactly what you re looking for: step-by-step help and guidance with the tasks that users, authors, content managers, and site managers perform most often. Fully updated to reflect SharePoint 2010 s latest improvements, this book covers everything from lists and views to social networking, workflows, and security. The industry s most focused SharePoint resource, SharePoint 2010 How-To provides all the answers you neednow!",
    "name": "SharePoint 2010 How-To",
    "category": "SharePoint"
  },
  {
    "author": "Scot Hillier",
    "pages": 519,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9bc38d993.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-59059-813-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft SharePoint.pdf",
    "year": "2007",
    "language": "English",
    "price": 67,
    "description": "Microsoft SharePoint: Building Office 2007 Solutions in VB 2005 is the third edition of Scot Hillier s market-leading SharePoint book. The new version includes extensive updates from the previous editions, with a complete focus on SharePoint 2007 and its integration with the 2007 Microsoft Office System. This edition also features new approaches for using SharePoint to improve business efficiency, plus new workflow solutions for SharePoint and BizTalk, as well as a brand new chapter on building a SharePoint solution from start to finish.",
    "name": "Microsoft SharePoint",
    "category": "SharePoint"
  },
  {
    "author": "Vivek Acharya",
    "pages": 512,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a98a62cbe2.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-849-68422-4",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Oracle BPM Suite 11g Developer-s cookbook.pdf",
    "year": "2012",
    "language": "English",
    "price": 105,
    "description": "Full of illustrations, diagrams, and tips with clear step-by-step instructions and real time examples to develop Industry Sample BPM Process and BPM interaction with SOA Components. Dive into lessons on Fault ,Performance and Rum Time Management. Explore User Interaction ,Deployment and Monitoring. Dive into BPM Process Implementation as process developer while conglomerating BPMN elements.",
    "name": "Oracle BPM Suite 11g Developer&#8217;s cookbook",
    "category": "SOA"
  },
  {
    "author": "Tom Rizzo",
    "pages": 696,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9be2b1005.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4571-0423-7",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Professional SharePoint 2010 Development.pdf",
    "year": "2010",
    "language": "English",
    "price": 100,
    "description": "Are you ready to explore the new capabilities of SharePoint 2010 so you can quickly build collaborative solutions that meet your business needs? Written for the .NET developer, this guide shows you how to take advantage of all the new features for creating and upgrading SharePoint sites. Inside you ll find field-tested best practices that help you take full advantage of this robust platform. Covering everything from maximizing SharePoint s capabilities and building effective solutions to designing custom workflows and developing content management applications, this resource helps you enhance your development skills so you can easily roll out new sites.",
    "name": "Professional SharePoint 2010 Development",
    "category": "SharePoint"
  },
  {
    "author": "Veli-Matti Vanamo",
    "pages": 912,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/98557a9bdd96ac6.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-58716-4",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SharePoint 2010 All-in-One For Dummies.pdf",
    "year": "2010",
    "language": "English",
    "price": 50,
    "description": "There s a lot to SharePoint 2010, and there s a lot of information in this book! Find just what you need to help you learn to use SharePoint and understand how it fits into Microsoft s Unified Communication strategy. Learn to build and manage SharePoint sites, how they serve users, how to manage data and serve up content, and a whole lot more.",
    "name": "SharePoint 2010 All-in-One For Dummies",
    "category": "SharePoint"
  },
  {
    "author": "Arun Pareek",
    "pages": 380,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a98a12dc21.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-608-2",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Oracle SOA Suite 11g Administrator-s Handbook.pdf",
    "year": "2012",
    "language": "English",
    "price": 158,
    "description": "Oracle SOA Suite 11g is the backbone of messaging and application integration in a service-oriented architecture. An application administrator is responsible for an end-to-end administration and management of the infrastructure. Understanding the underlying components, services, and configuration and their relations to each other is necessary to effectively administer the Oracle SOA Suite 11g environment. Due to its sheer size, administering Oracle SOA Suite 11g is a daunting task.\nThis book provides detailed explanations of all the core administrative and management activities around Oracle SOA Suite. It includes compact information for end-to-end administration of Oracle SOA Suite 11g. It delves into advanced topics such as silent installs, cloning, backup and recovery and high availability installations.",
    "name": "Oracle SOA Suite 11g Administrator&#8217;s Handbook",
    "category": "SOA"
  },
  {
    "author": "Juval Lowy",
    "pages": 910,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a9878e4ee5.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-80548-7",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Programming WCF Services, 3rd Edition.pdf",
    "year": "2010",
    "language": "English",
    "price": 81,
    "description": "Programming WCF Services is the authoritative, bestselling guide to Microsoft s unified platform for developing modern service-oriented applications on Windows. Hailed as the definitive treatment of WCF, this book provides unique insight, rather than documentation, to help you learn the topics and skills you need for building WCF-based applications that are maintainable, extensible, and reusable.",
    "name": "Programming WCF Services, 3rd Edition",
    "category": "SOA"
  },
  {
    "author": "Todd Biske",
    "pages": 228,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a986eda447.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84719-586-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SOA Governance.pdf",
    "year": "2008",
    "language": "English",
    "price": 157,
    "description": "Learn about SOA Governance to achieve SOA success in your company. Follow a fictitious company s journey of SOA Governance adoption. Learn to choose the right people, processes, and policies to achieve successful SOA Governance within your company. Understand the services and strategies used to achieve consistent results.",
    "name": "SOA Governance",
    "category": "SOA"
  },
  {
    "author": "Nishith Pathak",
    "pages": 472,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a9882e3253.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-3368-8",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Pro WCF 4, 2nd Edition.pdf",
    "year": "2011",
    "language": "English",
    "price": 35,
    "description": "Pro WCF 4.0: Practical Microsoft SOA Implementation is a complete guide to Windows Communication Foundation from the service-oriented architecture (SOA) perspective, showing you why WCF is important to service-oriented architecture and development. This book provides deep insight into the functionality of WCF, which shipped with .NET 4.0-like service discovery, routing service, simplified configuration, and other advanced features. Included in this title are informative examples that will aid the reader in understanding and implementing these important additions.",
    "name": "Pro WCF 4, 2nd Edition",
    "category": "SOA"
  },
  {
    "author": "Arun Poduval",
    "pages": 702,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a9887e0e8a.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-572-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Do more with SOA Integration Best of Packt.pdf",
    "year": "2011",
    "language": "English",
    "price": 91,
    "description": "Service Oriented Architecture (SOA) remains a buzzword in the business and IT community, largely because the ability to react quickly is of utmost importance. SOA can be the key solution to this. The challenge lies in the tricky task of integrating all the applications in a business through a Service Oriented Architecture, andDo more with SOA Integration: Best of Packtwill help you do just that with content from a total of eight separate Packt books.",
    "name": "Do more with SOA Integration: Best of Packt",
    "category": "SOA"
  },
  {
    "author": "Mike Liu",
    "pages": 394,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a988cdd358.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-766-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/WCF 4.5 Multi-Layer Services Development with Entity Framework, 3rd Edition.pdf",
    "year": "2012",
    "language": "English",
    "price": 121,
    "description": "This book will teach you WCF, Entity Framework, LINQ, and LINQ to Entities quickly and easily. Apply best practices to your WCF services and utilize Entity Framework in your WCF services. Practical, with step-by-step instructions and precise screenshots, this is a truly hands-on book for all C++, C#, and VB.NET developers.",
    "name": "WCF 4.5 Multi-Layer Services Development with Entity Framework, 3rd Edition",
    "category": "SOA"
  },
  {
    "author": "Arnon Rotem-Gal-Oz",
    "pages": 296,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a989200775.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-9339-8826-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SOA Patterns.pdf",
    "year": "2012",
    "language": "English",
    "price": 45,
    "description": "SOA Patterns provides detailed, technology-neutral solutions to these challenges, and many others, using plain language. You ll understand the design patterns that promote and enforce flexibility, availability, and scalability. Each of the 26 patterns uses the classic problem/solution format and a unique technology map to show where specific solutions fit into the general pattern.\nWritten for working developers and architects building services and service-oriented solutions. Knowledge of Java or C# is helpful but not required.",
    "name": "SOA Patterns",
    "category": "SOA"
  },
  {
    "author": "Thomas Rischbeck",
    "pages": 856,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a9873dde40.jpg",
    "download_link_epub": null,
    "ISBN": "0-13-613516-1, 978-0-13-613516-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SOA Design Patterns.pdf",
    "year": "2009",
    "language": "English",
    "price": 161,
    "description": "In cooperation with experts and practitioners throughout the SOA community, best-selling author Thomas Erl brings together the de facto catalog of design patterns for SOA and service-orientation. More than three years in development and subjected to numerous industry reviews, the 85 patterns in this full-color book provide the most successful and proven design techniques to overcoming the most common and critical problems to achieving modern-day SOA.\nThe book begins by establishing SOA types that are referenced throughout the patterns and then form the basis of a final chapter that discusses the architectural impact of service-oriented computing in general. These chapters bookend the pattern catalog to provide a clear link between SOA design patterns, the strategic goals of service-oriented computing, different SOA types, and the service-orientation design paradigm.",
    "name": "SOA Design Patterns",
    "category": "SOA"
  },
  {
    "author": "Ronald van Luttikhuizen",
    "pages": 292,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a98970ba86.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-416-3",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SOA Made Simple.pdf",
    "year": "2012",
    "language": "English",
    "price": 113,
    "description": "Get to grips with clear definitions ofServiceandArchitectureto understand the full SOA picture. Read about SOA in simple terms from Oracle ACE Directors for SOA and Middleware in this book. A concise, no-nonsense guide to demystifying Service Oriented Architecture.",
    "name": "SOA Made Simple",
    "category": "SOA"
  },
  {
    "author": "Steven Cheng",
    "pages": 316,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a987dde4cf.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-076-9",
    "download_link_pdf": "http://file.allitebooks.com/20150612/Microsoft Windows Communication Foundation 4.0 Cookbook for Developing SOA Applications.pdf",
    "year": "2010",
    "language": "English",
    "price": 175,
    "description": "WCF 4.0 is a communications infrastructure that unifies a broad array of distributed systemscapabilities in a composable, extensible architecture that supports multiple transports, messaging patterns, encodings, network topologies, and hosting models. This book is a collection of focused real-world recipes and covers basic recipes on topics such as working with contracts to more advanced topics such as extending WCF runtime. By the end of this book you will have valuable information that helps transform the potentially unproductive habits of .Net developers who work with WCF.\nThis book will take you through many concepts starting with complete support for contract-related design for WCF service development. You will learn to use WCF s built-in feature for building various service endpoints.",
    "name": "Microsoft Windows Communication Foundation 4.0 Cookbook for Developing SOA Applications",
    "category": "SOA"
  },
  {
    "author": "Jos Dirksen",
    "pages": 312,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a989c06fac.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-6172-9027-5",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SOA Governance in Action.pdf",
    "year": "2012",
    "language": "English",
    "price": 63,
    "description": "SOA Governance in Action shows developers how to apply governance concepts and implementation practices to achieve success in SOA projects. You ll learn practical techniques like building a metadata repository using WSO2 Registry or a custom monitoring dashboard using Bamos BAM. You ll also explore other supporting tools, such as using OpenAM, to implement security related policies. Along the way, you ll explore the nuances of writing policies that work for the project and click with your corporate culture.\nWritten for business application developers. Familiarity with Java and BPMN is helpful but not required.",
    "name": "SOA Governance in Action",
    "category": "SOA"
  },
  {
    "author": "Ramesh Loganathan",
    "pages": 384,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a9864d6709.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-90481-117-6",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SOA Approach to Integration.pdf",
    "year": "2007",
    "language": "English",
    "price": 133,
    "description": "This book is for architects and senior developers who are responsible for setting up SOA for integration for applications within the enterprise (intra-enterprise integration) and applications across enterprises (inter-enterprise integration or B2B).\nThis book focuses on the SOA approach to integration of existing (legacy) applications and newly developed solutions, using modern technologies, particularly web services, XML, ESB, and BPEL. The book shows how to define SOA for integration, what integration patterns to use, which technologies to use, and how to best integrate existing applications with modern e-business solutions. It also shows how to develop web services and BPEL processes, and how to process and manage XML documents from the JEE and .NET platforms. Finally, it also explains how to integrate both platforms using web services and ESBs.",
    "name": "SOA Approach to Integration",
    "category": "SOA"
  },
  {
    "author": "Mark Hansen",
    "pages": 605,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a985a5a409.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-13-044968-9, 0-13-044968-7",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SOA Using Java  Web Services.pdf",
    "year": "2007",
    "language": "English",
    "price": 52,
    "description": "Expert Solutions and State-of-the-Art Code Examples\nSOA Using Java™ Web Services is a hands-on guide to implementing Web services and Service Oriented Architecture (SOA) with today’s Java EE 5 and Java SE 6 platforms. Author Mark Hansen presents in explicit detail the information that enterprise developers and architects need to succeed, from best-practice design techniques to state-of-the-art code samples.\nHansen covers creating, deploying, and invoking Web services that can be composed into loosely coupled SOA applications. He begins by reviewing the “big picture,” including the challenges of Java-based SOA development and the limitations of traditional approaches. Next, he systematically introduces the latest Java Web Services (JWS) APIs and walks through creating Web services that integrate into a comprehensive SOA solution. Finally, he shows how application frameworks based on JWS can streamline the entire SOA development process and introduces one such framework: SOA-J.\nThe book<br />\n* Introduces practical techniques for managing the complexity of Web services and SOA, including best-practice design examples<br />\n* Offers hard-won insights into building effective SOA applications with Java Web Services<br />\n* Illuminates recent major JWS improvements–including two full chapters on JAX-WS 2.0<br />\n* Thoroughly explains SOA integration using WSDL, SOAP, Java/XML mapping, and JAXB 2.0 data binding<br />\n* Walks step by step through packaging and deploying Web services components on Java EE 5 with JSR-181 (WS-Metadata 2.0) and JSR-109<br />\n* Includes specific code solutions for many development issues, from publishing REST endpoints to consuming SOAP services with WSDL<br />\n* Presents a complete case study using the JWS APIs, together with an Ajax front end, to build a SOA application integrating Amazon, Yahoo Shopping, and eBay<br />\n* Contains hundreds of code samples–all tested with the GlassFish Java EE 5 reference implementation–that are downloadable from the companion Web site, http://soabook.com.\nForeword<br />\nPreface<br />\nAcknowledgments<br />\nAbout the Author<br />\nChapter 1: Service-Oriented Architecture with Java Web Services<br />\nChapter 2: An Overview of Java Web Services<br />\nChapter 3: Basic SOA Using REST<br />\nChapter 4: The Role of WSDL, SOAP, and Java/XML Mapping in SOA<br />\nChapter 5: The JAXB 2.0 Data Binding<br />\nChapter 6: JAX-WS–Client-Side Development<br />\nChapter 7: JAX-WS 2.0–Server-Side Development<br />\nChapter 8: Packaging and Deployment of SOA Components (JSR-181 and JSR-109)<br />\nChapter 9: SOAShopper: Integrating eBay, Amazon, and Yahoo! Shopping<br />\nChapter 10: Ajax and Java Web Services<br />\nChapter 11: WSDL-Centric Java Web Services with SOA-J<br />\nAppendix A: Java, XML, and Web Services Standards Used in This Book<br />\nAppendix B: Software Configuration Guide<br />\nAppendix C: Namespace<br />\nPrefixes<br />\nGlossary<br />\nReferences<br />\nIndex",
    "name": "SOA Using Java  Web Services",
    "category": "SOA"
  },
  {
    "author": "Yuli Vasiliev",
    "pages": 316,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a9869d3f56.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84719-270-7",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SOA and WS-BPEL.pdf",
    "year": "2007",
    "language": "English",
    "price": 109,
    "description": "When utilized within a Service-oriented Architecture (SOA), Web Services are part of a business process determining the logical order of service activities logical units of work performed by one or more services. Today, the most popular tool for organizing service activities into business processes is Web Services Business Process Execution Language (WS-BPEL), a language defining an execution format for business processes operating on Web Services. While it is not a trivial task to define a business process definition with WS-BPEL from scratch, using a graphical WS-BPEL tool can significantly simplify this process.",
    "name": "SOA and WS-BPEL",
    "category": "SOA"
  },
  {
    "author": "Nicolai M. Josuttis",
    "pages": 352,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1434/97557a985fb8b13.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-52955-0",
    "download_link_pdf": "http://file.allitebooks.com/20150612/SOA in Practice.pdf",
    "year": "2007",
    "language": "English",
    "price": 156,
    "description": "Service-oriented architecture (SOA) is finally becoming a concrete discipline rather than a hopeful collection of cloud charts. This book demonstrates how SOA can simplify the creation of large-scale applications, whether your project involves a large set of Web Services-based components, or is a means to connect legacy applications to more modern business processes. SOA in Practice explains howand whetherSOA fits your needs.",
    "name": "SOA in Practice",
    "category": "SOA"
  }
]