[
  {
    "author": "Shannon Belew",
    "pages": 912,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/02/Starting-an-Online-Business-All-in-One-For-Dummies-5th-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "1119315522",
    "download_link_pdf": "http://file.allitebooks.com/20170214/Starting an Online Business All-in-One For Dummies, 5th Edition.pdf",
    "year": "2017",
    "language": "English",
    "price": 177,
    "description": "Start a successful online business—and be your own boss!\nBeing an online entrepreneur means more than just building a website—and this book breaks down everything you need to know to be successful. Inside, you ll get plain-English explanations and easy-to-follow instruction on online business basics, legal and accounting issues, website design, Internet security, boosting sales, e-commerce, and so much more.\nWhile the ideas and concepts behind starting an online business are tried and true, the tools available to entrepreneurs change and evolve quickly—and often. Starting an Online Business All-in-One For Dummies gets you up to speed on the best new tools, resources, and communities, and shows you how to best leverage them to up your chances of success.Discover your niche and create a business plan\nDesign your website and storefront\nIncrease your reach and market with social media\nChoose the best web host for your needsIf you re a budding entrepreneur with dreams of running your own online business, this book has everything you need to get started and grow your company to extraordinary heights!",
    "name": "Starting an Online Business All-in-One For Dummies, 5th Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Scott Brinker",
    "pages": 288,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/03/Hacking-Marketing.jpg",
    "download_link_epub": null,
    "ISBN": "1119183170",
    "download_link_pdf": "http://file.allitebooks.com/20170305/Hacking Marketing.pdf",
    "year": "2016",
    "language": "English",
    "price": 114,
    "description": "Apply software-inspired management concepts to accelerate modern marketing\nIn many ways, modern marketing has more in common with the software profession than it does with classic marketing management. As surprising as that may sound, it s the natural result of the world going digital. Marketing must move faster, adapt more quickly to market feedback, and manage an increasingly complex set of customer experience touchpoints. All of these challenges are shaped by the dynamics of software—from the growing number of technologies in our own organizations to the global forces of the Internet at large.\nBut you can turn that to your advantage. And you don t need to be technical to do it.\nHacking Marketing will show you how to conquer those challenges by adapting successful management frameworks from the software industry to the practice of marketing for any business in a digital world. You ll learn about agile and lean management methodologies, innovation techniques used by high-growth technology companies that any organization can apply, pragmatic approaches for scaling up marketing in a fragmented and constantly shifting environment, and strategies to unleash the full potential of talent in a digital age.\nMarketing responsibilities and tactics have changed dramatically over the past decade. This book now updates marketing management to better serve this rapidly evolving discipline.Increase the tempo of marketing s responsiveness without chaos or burnout\nDesigncontinuousmarketing programs and campaigns that constantly evolve\nDrive growth with more marketing experiments while actually reducing risk\nArchitect marketing capabilities in layers to better scale and adapt to change\nBalance strategic focus with the ability to harness emergent opportunitiesAs a marketer and a manager, Hacking Marketing will expand your mental models for how to lead marketing in a digital world where everything—including marketing—flows with the speed and adaptability of software.",
    "name": "Hacking Marketing",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Jerri L. Ledford",
    "pages": 528,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2019/03/Search-Engine-Optimization-Bible-2nd-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "0470452641",
    "download_link_pdf": "http://file.allitebooks.com/20190301/Search Engine Optimization Bible, 2nd Edition.pdf",
    "year": "2009",
    "language": "English",
    "price": 90,
    "description": "Detailed, practical guide to increasing your Web traffic through better search results\nWonder how some companies pop up high in search engine rankings? It s all about search appeal. Master the strategies, techniques, and shortcuts in this detailed guide and you can improve your Web site s search rankings and drive the targeted traffic you want to your virtual door. Learn new ways to add social media to the SEO mix, make your site mobile Web-friendly, write SEO tags for maximum exposure, and more.Search Engine Optimization (SEO) is hot; the online advertising market is expected to grow at 34% CAGR between 2005 and 2010, and nine out of ten companies are estimated to be implementing SEO strategies\nFind out how to get listed in the major search engines, directories, and indexes, and learn strategies for planning and implementing a successful SEO campaign\nTake advantage of the case studies of readers who implemented the SEO techniques outlined in the first edition of this book and significantly improved search rankings\nDiscover how to target and reach the customers you really want; optimize your site specifically for Google, MSN, or Yahoo!; demystify the role of links and linking in search; implement social media and mobile search optimization; and analyze your SEO efforts to see what worksIf you want to make SEO work for you, the new edition of this practical book is what you need to succeed.",
    "name": "Search Engine Optimization Bible, 2nd Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Jim Sterne",
    "pages": 368,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/08/Artificial-Intelligence-for-Marketing.jpg",
    "download_link_epub": null,
    "ISBN": "1119406331",
    "download_link_pdf": "http://file.allitebooks.com/20170811/Artificial Intelligence for Marketing.pdf",
    "year": "2017",
    "language": "English",
    "price": 123,
    "description": "A straightforward, non-technical guide to the next major marketing tool\nArtificial Intelligence for Marketing presents a tightly-focused introduction to machine learning, written specifically for marketing professionals. This book will not teach you to be a data scientist—but it does explain how Artificial Intelligence and Machine Learning will revolutionize your company s marketing strategy, and teach you how to use it most effectively. Data and analytics have become table stakes in modern marketing, but the field is ever-evolving with data scientists continually developing new algorithms—where does that leave you? How can marketers use the latest data science developments to their advantage? This book walks you through theneed-to-knowaspects of Artificial Intelligence, including natural language processing, speech recognition, and the power of Machine Learning to show you how to make the most of this technology in a practical, tactical way.\nSimple illustrations clarify complex concepts, and case studies show how real-world companies are taking the next leap forward. Straightforward, pragmatic, and with no math required, this book will help you:Speak intelligently about Artificial Intelligence and its advantages in marketing\nUnderstand how marketers without a Data Science degree can make use of machine learning technology\nCollaborate with data scientists as a subject matter expert to help develop focused-use applications\nHelp your company gain a competitive advantage by leveraging leading-edge technology in marketingMarketing and data science are two fast-moving, turbulent spheres that often intersect; that intersection is where marketing professionals pick up the tools and methods to move their company forward. Artificial Intelligence and Machine Learning provide a data-driven basis for more robust and intensely-targeted marketing strategies—and companies that effectively utilize these latest tools will reap the benefit in the marketplace. Artificial Intelligence for Marketing provides a nontechnical crash course to help you stay ahead of the curve.",
    "name": "Artificial Intelligence for Marketing",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Chuck Hudson",
    "pages": 207,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/02/eBay-Commerce-Cookbook.jpg",
    "download_link_epub": null,
    "ISBN": "1449320155",
    "download_link_pdf": "http://file.allitebooks.com/20170227/eBay Commerce Cookbook.pdf",
    "year": "2013",
    "language": "English",
    "price": 148,
    "description": "Take advantage of mobile commerce to generate more demand, traffic, and sales for your products and services. This unique cookbook provides a collection of practical recipes you can put to use in every step of the mobile customer lifecycle. You’ll learn how to add features and functionality through a wide set of eBay APIs—including Magento, Milo, eBay, PayPal, RedLaser, Hunch, and ql.io.\nEach chapter focuses one aspect of the lifecycle. Author Charles Hudson combines his expertise in web and mobile product strategy with code solutions to help you address product discovery, presentation, payment, order fulfillment, and customer satisfaction. If you have experience with PHP, HTML, CSS, and JavaScript, you’re ready to roll.Help customers find your product through reviews, targeted search options, and eBay marketplace listings\nCustomize a Magento storefront and provide customers with a single sign-on option to enhance product presentation\nStreamline purchases with options such as auto-generating coupons and preapproved payments\nAutomate order processing, extend shipping options, and leverage PayPal chained payments to handle multiple suppliers\nTake advantage of QR codes, produce customertaste graphs,and use ql.io mash ups to provide visitors with social recommendations",
    "name": "eBay Commerce Cookbook",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Benjamin Finklea",
    "pages": 280,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/01/Drupal-6-Search-Engine-Optimization.jpg",
    "download_link_epub": null,
    "ISBN": "1847198228",
    "download_link_pdf": "http://file.allitebooks.com/20170130/Drupal 6 Search Engine Optimization.pdf",
    "year": "2009",
    "language": "English",
    "price": 42,
    "description": "This is a practical, hands-on book based around sound SEO techniques specifically applied to Drupal. Each chapter starts with a brief overview of the important concepts then quickly moves into practical step-by-step actions you can take immediately. Throughout the book, you ll get clear instructions and detailed screenshots, so you can see exactly what to do each step of the way. You will install and configure a selection of Drupal modules ? each of which will move you one step closer to optimization. Chapter-by-chapter, your Drupal site will become more optimized so that by the end of the book, your site is 100% ready for Google. This book is written for Drupal site owners and those who create Drupal sites including themers, developers, programmers, and consultants. A basic understanding of Drupal will be helpful: what a node is, how to create nodes, how to log in to the admin sections of your Drupal site, and how to properly install and enable a module. No knowledge of SEO will be assumed but a basic knowledge of search engines is expected.",
    "name": "Drupal 6 Search Engine Optimization",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Eric Matisoff",
    "pages": 400,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2019/04/Adobe-Analytics-For-Dummies.jpg",
    "download_link_epub": "http://file.allitebooks.com/20190428/Adobe Analytics For Dummies.epub",
    "ISBN": "1119446082",
    "download_link_pdf": "http://file.allitebooks.com/20190428/Adobe Analytics For Dummies.pdf",
    "year": "2019",
    "language": "English",
    "price": 146,
    "description": "Use Adobe Analytics as a marketer —not a programmer!\nIf you re a marketer in need of a non-technical, beginner s reference to using Adobe Analytics, this book is the perfect place to start. Adobe Analytics For Dummies arms you with a basic knowledge of the key features so that you can start using it quickly and effectively.\nEven if you re a digital marketer who doesn t have their hands in data day in and day out, this easy-to-follow reference makes it simple to utilize Adobe Analytics. With the help of this book, you ll better understand how your marketing efforts are performing, converting, being engaged with, and being shared in the digital space.Evaluate your marketing strategies and campaigns\nExplore implementation fundamentals and report architecture\nApply Adobe Analytics to multiple sources\nSucceed in the workplace and expand your marketing skillsetThe marketing world is continually growing and evolving, and Adobe Analytics For Dummies will help you stay ahead of the curve.",
    "name": "Adobe Analytics For Dummies",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Joel Elad",
    "pages": 385,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/12/LinkedIn-For-Dummies-4th-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "1119251133",
    "download_link_pdf": "http://file.allitebooks.com/20161222/LinkedIn For Dummies, 4th Edition.pdf",
    "year": "2016",
    "language": "English",
    "price": 58,
    "description": "Build your network, find a job, and been seen as a thought leader\nLinkedIn is your number-one personal branding tool, and this friendly guide shows you how to harness it to build connections and relationships—and stand out in the world s largest professional network. LinkedIn For Dummies walks you step by step through creating an eye-catching profile and demonstrates how to successfully expand your reach by connecting with colleagues, customers, and like-minded individuals from around the globe. Plus, you ll discover how to become a thought leader by publishing your cutting-edge research on LinkedIn s native publishing network, Pulse, and interact with your connections through updates.\nConnections have never been more vital to a successful career, and this new edition of LinkedIn For Dummies is here to make sure you don t miss out on your next big opportunity! From keeping track of your LinkedIn activities and writing and requesting recommendations to finding a job and using LinkedIn to cultivate sales leads, this friendly guide is the missing piece you ve been waiting for to take your career from good to great—all with the click of a few buttons.Create a LinkedIn profile that showcases your skills and attracts contacts\nFind and connect with colleagues and industry leaders\nUnderstand LinkedIn etiquette and best practices\nUse LinkedIn to find a job, develop sales leads, and market your servicesDon t be left out—link up with this fully updated introduction to the Internet s hottest professional networking tool.",
    "name": "LinkedIn For Dummies, 4th Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Bruce Clay",
    "pages": 795,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/12/Search-Engine-Optimization-All-in-One-For-Dummies-3rd-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "1118921755",
    "download_link_pdf": "http://file.allitebooks.com/20161218/Search Engine Optimization All-in-One For Dummies, 3rd Edition.pdf",
    "year": "2015",
    "language": "English",
    "price": 36,
    "description": "The most comprehensive coverage of search engine optimization\nIn Search Engine Optimization All-in-One For Dummies, 3<sup>rd</sup> Edition, Bruce Clay—whose search engine consultancy predates Google—shares everything you need to know about SEO. In minibooks that cover the entire topic, you ll discover how search engines work, how to apply effective keyword strategies, ways to use SEO to position yourself competitively, the latest on international SEO practices, and more.\nIf SEO makes your head spin, this no-nonsense guide makes it easier. You ll get the lowdown on how to use search engine optimization to improve the quality and volume of traffic on your website via search engine results. Cutting through technical jargon, it gets you up to speed quickly on how to use SEO to get your website in the top of the rankings, target different kinds of searches, and win more industry-specific vertical search engine results!Includes new and updated material, featuring the latest on Bing!, Google instant search, image search, and much more\nCovers SEO and optimizing servers for SEO\nProvides important information on SEO web design\nShows you how to use SEO to stayabove the foldIf you re a website owner, developer, marketer, or SEO consultant, Search Engine Optimization All-in-One For Dummies, Third Edition is the only resource you need to beat the competition.",
    "name": "Search Engine Optimization All-in-One For Dummies, 3rd Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Harold Davis",
    "pages": 366,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2019/05/Building-Research-Tools-with-Google-For-Dummies.jpg",
    "download_link_epub": null,
    "ISBN": "076457809X",
    "download_link_pdf": "http://file.allitebooks.com/20190529/Building Research Tools with Google For Dummies.pdf",
    "year": "2005",
    "language": "English",
    "price": 192,
    "description": "Google—a funny name for a fabulous tool. You’ve already used it to look up all sorts of information on the Web almost instantly. Now what if you could use its amazing abilities to turbo-charge your research on a grand scale?\nBuilding Research Tools With Google For Dummies can help you do just that. In plain English, it shows you easy ways to:Ask Google exactly what you want to know\nDetermine whether what you need can actually be found through Google, and where to look if the answer is “no”\nImprove your research results\nPresent your findings in a way that makes sense\nWrite your own specialized search applications—if you want toTo get the most from Google, you need to understand Google. Building Research Tools With Google For Dummiesexplains how Google works and how you can build more effective queries (hint: it’s a lot more than just using the “Advanced Search” techniques!) It even shows you how to think like a researcher and how to package the results of your research so it means something to your audience. You’ll be able to:Understand Google research techniques and use the custom search-related syntax\nRecognize Google’s strengths—and limitations\nTarget your search by using Google operators\nUse Google to research photos, or even an entire industry\nImprove the effectiveness of your results by understanding Google’s comparative methodology\nBuild custom tools using WDSL and Web ServicesYou don’t have to become a programmer to use Google, but if you know a little about software development and want to explore new, more focused search techniques, Building Research Tools With Google For Dummies has a section just for you. It introduces you to the Google API, shows you how to download a developer key, and leads you through building a C# .Net Google application. On the companion Web site, you’ll find the source code and software discussed in the book as well as links to lots of other resources for researchers. Before you know it, you’ll be Googling your way to research success!",
    "name": "Building Research Tools with Google For Dummies",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Mathew Sweezey",
    "pages": 315,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/11/Marketing-Automation-For-Dummies.jpg",
    "download_link_epub": null,
    "ISBN": "1118772229",
    "download_link_pdf": "http://file.allitebooks.com/20161120/Marketing Automation For Dummies.pdf",
    "year": "2014",
    "language": "English",
    "price": 61,
    "description": "Multiply the effectiveness of your campaigns with marketing automation\nMarketing automation technology has been shown to dramatically increase lead conversions and average deal sizes as well as improving forecasting and customer segmentation. A subset of CRM, it focuses on defining, scheduling, segmenting, and tracking marketing campaigns. This friendly book demystifies marketing automation in straightforward terms, helping you leverage the tools and handle the processes that will enable a seamless integration with your CRM program. Learn to establish a buyer profile, assess your needs, select tools, create a lead scoring model, and much more.Marketing automation is a next-generation, CRM-related tool for increasing lead conversions and improving forecasting and customer segmentation\nThis book provides an easy-to-understand introduction to the tools and technology, helping you evaluate your current processes, choose the appropriate tools, and follow best practices in making the most of them\nWritten by Mathew Sweezey, Marketing Automation Evangelist at Pardot (ExactTarget), a leading provider of marketing automation solutions\nCovers working with the marketing lifecycle, evaluating your assets, integrating marketing automation with CRM and with other processes, nurturing your leads, and using marketing automation to reach buyers via e-mail, social media, and moreMarketing Automation For Dummies is the ideal guide to get you up and running with marketing automation, putting your business on the cutting edge and enhancing your competitiveness.",
    "name": "Marketing Automation For Dummies",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Pranai Nandan",
    "pages": 240,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/09/Mastering-SoapUI-400x493.jpg",
    "download_link_epub": null,
    "ISBN": "178398080X",
    "download_link_pdf": "http://file.allitebooks.com/20160926/Mastering SoapUI.pdf",
    "year": "2016",
    "language": "English",
    "price": 138,
    "description": "SoapUI is an open-source cross-platform testing application that provides complete test coverage and supports all the standard protocols and technologies. This book includes real-time examples of implementing SoapUI to achieve quality and business assurance.\nStarting with the features and functionalities of SoapUI, the book will then focus on functional testing, load testing, and security testing of web services. Furthermore, you will learn how to automate your services and then design data-driven, keyword-driven, and hybrid-driven frameworks in SoapUI. Then the book will show you how to test UIs and services using SoapUI with the help of Selenium. You will also learn how to integrate SoapUI with Jenkins for CI and SoapUI test with QC with backward- and forward-compatibility. The final part of the book will show you how to virtualize a service response in SoapUI using Service Mocking.\nYou will finish the journey by discovering the best practices for SoapUI test automation and preparing yourself for the online certification of SoapUI.\nWhat you will learnFamiliarize yourself with Test Web services from functional, nonfunctional, and security aspects\nLearn to test real-time service orchestrations\nDesign test automation solutions for SOA-based Enterprise applications\nLearn multilayer test automation\nSelenium plus SoapUI under a single umbrella\nIntegrate your SoapUI framework with Jenkins",
    "name": "Mastering SoapUI",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Michael David",
    "pages": 344,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1467/44577a7ac102603.jpeg",
    "download_link_epub": null,
    "ISBN": "1847199003",
    "download_link_pdf": "http://file.allitebooks.com/20160704/WordPress 3 Search Engine Optimization.pdf",
    "year": "2011",
    "language": "English",
    "price": 110,
    "description": "WordPress is a powerful platform for creating feature-rich and attractive websites and blogs; but with a little extra tweaking and effort your WordPress site can dominate the search engines and bring thousands of new customers to your blog or business.\nWordPress3.0 Search Engine Optimization will show you the secrets that professional SEO companies use to take websites to the top of search results and proliferate their business. You ll be able to take your WordPress blog/site to the next level, as well as brush aside even the stiffest competition with this book in hand.\nWe ll begin with a typical WordPress installation and with a variety of simple techniques, turn it into a powerful website that search engines will reward with high rankings.\nWe ll go further: with advanced plug-ins we ll connect your WordPress site to popular social media sites and expand the reach of your site to bring more visitors. You ll learn about dozens of free online tools to accomplish everything from keyword research to monitoring your ranking progress.\nWordPress is a great start for building search-friendly sites. However, with the tools in this book, you ll get your website/blog noticed by numerous new users/customers or your target audience.",
    "name": "WordPress 3 Search Engine Optimization",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Aravind Shenoy",
    "pages": 147,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/08/Introducing-SEO.jpg",
    "download_link_epub": null,
    "ISBN": "1484218531",
    "download_link_pdf": "http://file.allitebooks.com/20160818/Introducing SEO.pdf",
    "year": "2016",
    "language": "English",
    "price": 192,
    "description": "Your easy-to-digest brief introduction to SEO (search engine optimization)an imperative methodology used to improve the visibility of websites using different strategies and techniques.\nUsing a calculative and practical approach, this book teaches you the techniques, practical implementations, and concepts of SEO that will enable you to get to grips with the fundamental aspects of search engine optimization.\nIntroducing SEO jumpstarts your knowledge using an easy-to-follow approach – add it to your library today.\nWhat You Will Learn\n•How to incorporate effective SEO into your workflow<br />\n•How to use keywords, link building, and online social media marketing<br />\n•How to implement SEO-specific plans and strategies.",
    "name": "Introducing SEO",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Sangram Vajre",
    "pages": 384,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/09/Account-Based-Marketing-For-Dummies.jpg",
    "download_link_epub": null,
    "ISBN": "1119224853",
    "download_link_pdf": "http://file.allitebooks.com/20160901/Account-Based Marketing For Dummies.pdf",
    "year": "2016",
    "language": "English",
    "price": 111,
    "description": "Grow your account list with an effective account-based marketing strategy\nBuyers have changed the B2B marketing game. Account-Based Marketing For Dummies is here to give you the tools to transform your current approach to find, reach, and engage with your potential customers on their terms to meet their ever-changing demands. Packed with expert tips and step-by-step instructions, this book shows you how to analyze current data to identify the accounts with the biggest ROI opportunities and execute effective, account-specific techniques that get results.\nThis practical guide takes the intimidation out of account-based marketing in today s highly digitized world. You ll be armed with the knowledge you need to increase your reach in real time, giving you greater exposure to other decision-makers and influencers within an account. You ll discover how, through a combination of marketing technology and online advertising, your messages can be displayed where and when your customers already engage online.Align your sales and marketing teams for greater success in your ABM efforts\nAnalyze data to identify key accounts\nTarget your messages for real-time interaction\nIntegrate your campaign with marketing automation softwareIf you re a member of a sales or marketing team already using a CRM tool who s looking to increase your reach, Account-Based Marketing For Dummies has you covered!",
    "name": "Account-Based Marketing For Dummies",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Carolyn Abram",
    "pages": 384,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/09/Facebook-For-Dummies-6th-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "1119179033",
    "download_link_pdf": "http://file.allitebooks.com/20160903/Facebook For Dummies, 6th Edition.pdf",
    "year": "2016",
    "language": "English",
    "price": 121,
    "description": "A new edition of the bestselling how-to Facebook title\nFacebook is constantly changing and evolving, replacing old features and introducing new ones. This new edition of the bestselling guide quickly and easily gets you up and running on all the sitehas to offer. Packed with straightforward guidance that demystifies the nuts and bolts of this popular social media site, <i>Facebook For Dummies</i>covers everything from finding friends and planning events to uploading photos and videos—and so much more.\nFacebook is here to stay. For its billions of worldwide users, it s become a central meeting place for people from all corners of the earth to connect and share. If you re the type to share snippets of your life through photos and writing or just find joy in reading and seeing what your family and friends are up to, there s something for everyone on Facebook. Providing coverage of the latest changes to the site, this go-to guide cuts through the confusion and offers plain-English guidance on using Facebook to its fullest so you can deepen your connections, stay social, and just have fun!Get up to speed on Facebook s standalone messaging app\nGrasp Facebook s growing connection to e-commerce\nFind the scoop on cross-over posts and sharing through other sites\nMake sense of photo-sharing capabilities, such as 360-degree photo viewingWhether you re a newbie or an old hat looking to make sense of the latest features, this friendly guide reveals the many faces of Facebook in a language you can understand.",
    "name": "Facebook For Dummies, 6th Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Stephan Spencer",
    "pages": 74,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1468/02578c258a5b2e9.jpeg",
    "download_link_epub": null,
    "ISBN": "1449311563",
    "download_link_pdf": "http://file.allitebooks.com/20160718/Google Power Search.pdf",
    "year": "2011",
    "language": "English",
    "price": 87,
    "description": "Behind Google s deceptively simple interface is immense power for both market and competitive research—if you know how to use it well. Sure, basic searches are easy, but complex searches require specialized skills. This concise book takes you through the full range of Google s powerful search-refinement features, so you can quickly find the specific information you need. Learn techniques ranging from simple Boolean logic to URL parameters and other advanced tools, and see how they re applied to real-world market research examples.Incorporate advanced search operators such as filetype:, intitle:, daterange:, and others into your queries\nUse Google filtering tools, including Search Within Results, Similar Pages, and SafeSearch, among others\nExplore the breadth of Google through auxiliary search services like Google News, Google Books, Google Blog Search, and Google Scholar\nAcquire advanced Google skills that result in more effective search engine optimization (SEO)",
    "name": "Google Power Search",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Consumer Dummies",
    "pages": 747,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/12/High-Powered-Investing-All-in-One-For-Dummies-2nd-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "1118724674",
    "download_link_pdf": "http://file.allitebooks.com/20161212/High-Powered Investing All-in-One For Dummies, 2nd Edition.pdf",
    "year": "2013",
    "language": "English",
    "price": 69,
    "description": "Looking for help making smarter, more profitable high-end investment decisions? Why buy 13 books that cover each of the major topics you need to understand, when High-Powered Investing All-In-One For Dummies gives you 13 expert guides for the price of one?\nThis hands-on resource arms you with an arsenal of advanced investing techniques for everything from stocks and futures to options and exchange-traded funds. You ll find out how to trade on the FOREX market, evaluate annuities, choose the right commodities, and buy into hedge funds. Plus, you ll get up to speed on using business fundamentals and technical analysis to help you make smarter decisions and maximize your returns. You ll also find ways to be as aggressive as your personality and bank account allow, without taking foolish or excessive risks.Updated compilation is targeted at readers who already have a basic understanding of investing principles and who are looking for a reference to help them build a diversified portfolio\nOffers a succinct framework and expert advice to help you make solid decisions and confidently invest in the marketplaceThe key to expanding your investment opportunities successfully is information. Whether you re just beginning to explore more advanced investing or have been dabbling in it for a while, High-Powered Investing All-In-One For Dummies gives you the information, strategies, and techniques you need to make your financial dreams come true.",
    "name": "High-Powered Investing All-in-One For Dummies, 2nd Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Michael Whitehead",
    "pages": 352,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/11/Implementing-SugarCRM-5x-400x499.jpg",
    "download_link_epub": null,
    "ISBN": "184719866X",
    "download_link_pdf": "http://file.allitebooks.com/20161110/Implementing SugarCRM 5.x.pdf",
    "year": "2010",
    "language": "English",
    "price": 147,
    "description": "The book works from the SugarCRM basics right up to advanced features in a clear and friendly way. It follows a combination of theoretical discussions relating to varying business needs and the manner in which CRM technology can address them. By helping you clarify your business goals the book enables you to build a CRM system to support your business needs. If you are a small-medium business owner/manager with reasonable IT skills, a system implementer, or a system administrator who wants to implement SugarCRM for yourself either as a first CRM or as a replacement for existing solutions, this book is for you. Existing SugarCRM users who want to broaden their understanding of the topic will find this book valuable too. No programming knowledge is required to use this book to implement, customize, and use SugarCRM.",
    "name": "Implementing SugarCRM 5.x",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "David Booth",
    "pages": 192,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/12/Google-AdWords.jpg",
    "download_link_epub": null,
    "ISBN": "1449308384",
    "download_link_pdf": "http://file.allitebooks.com/20161212/Google AdWords.pdf",
    "year": "2011",
    "language": "English",
    "price": 124,
    "description": "Do people really click the handful of text ads that accompany Google search results? Absolutely. Growth of Google AdWords continues to increase, as does online advertising in the United States. This book shows you how each piece of Google’s advertising platform works, focusing on areas that impact the performance and cost of your ad campaigns.\nLearn how to create an AdWords account, and then dive into the particulars of setting up your first campaign, optimizing keywords, writing effective ads, and tracking conversions. Most advertisers don’t understand how AdWords works. This book gives you an edge.Learn the advantages of proper account structure based on tightly knit themes\nUnderstand AdWords auction and the importance of keyword Quality Score\nDetermine your preferred bidding model and daily ad budget\nEvaluate campaign performance by timeframe, keyword, and other criteria\nHone your keyword list whenever search queries trigger your ads\nAdd negative keywords to filter out irrelevant queries\nOutperform competitors and organic search results with targeted ad copy\nDetermine conversion goals, and use AdWords tools to track them",
    "name": "Google AdWords",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Stephan Spencer",
    "pages": 994,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1445/94562e98be49c1a.jpeg",
    "download_link_epub": null,
    "ISBN": "1491948965",
    "download_link_pdf": "http://file.allitebooks.com/20151026/The Art of SEO Mastering Search Engine Optimization, 3rd Edition.pdf",
    "year": "2015",
    "language": "English",
    "price": 97,
    "description": "Three acknowledged experts in search engine optimization share guidelines and innovative techniques that will help you plan and execute a comprehensive SEO strategy. Complete with an array of effective tactics from basic to advanced, this third edition prepares digital marketers for 2016 with updates on SEO tools and new search engine optimization methods that have reshaped the SEO landscape\nNovices will receive a thorough SEO education, while experienced SEO practitioners get an extensive reference to support ongoing engagements.\nComprehend SEO’s many intricacies and complexities<br />\nExplore the underlying theory and inner workings of search engines<br />\nUnderstand the role of social media, user data, and links<br />\nDiscover tools to track results and measure success<br />\nExamine the effects of Google’s Panda and Penguin algorithms<br />\nConsider opportunities in mobile, local, and vertical SEO<br />\nBuild a competent SEO team with defined roles<br />\nGlimpse the future of search and the SEO industry",
    "name": "The Art of SEO: Mastering Search Engine Optimization, 3rd Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Joseph Miller",
    "pages": 154,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2015/10/How-To-Make-A-Website-And-An-eBook-Income.jpg",
    "download_link_epub": null,
    "ISBN": "B016P0ZLZC",
    "download_link_pdf": "http://file.allitebooks.com/20151029/How To Make A Website And An eBook Income.pdf",
    "year": "2015",
    "language": "English",
    "price": 199,
    "description": "How to make an ebook, buy one with rights to sell them, become a vendor at clickbank, sell othersdigital products, set up a website with wordpress themes for as low as $13 and $10 a month for hosting. Over 2000 free website templates. How to set it all up, with over 80 screen shots.",
    "name": "How To Make A Website And An eBook Income",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Nathanael J. Anderson",
    "pages": 168,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1455/3656beaa9b9876c.jpeg",
    "download_link_epub": null,
    "ISBN": "178588865X",
    "download_link_pdf": "http://file.allitebooks.com/20160213/Getting Started with NativeScript.pdf",
    "year": "2016",
    "language": "English",
    "price": 183,
    "description": "NativeScript allows you to build a fast cross-platform application that has a native UI. NativeScript is a true cross-platform framework that generates native speed applications using the native components of the host platform, all using JavaScript. Although NativeScript allows you to build your application in JavaScript, you have full access to the host OS from your code, allowing you to easily tweak or use new platform features instantly at native code speeds.\nWhether you have already developed multiple applications or zero applications, this book will help you to develop your next application in a cross-platform framework quickly, saving you a massive amount of time and money.\nThis book concisely shows you NativeScript s built-in framework that allows you to rapidly develop a fully-working compiled cross-platform application in just a few chapters. It starts by laying the foundation of NativeScript and working through the fundamentals to create a basic shell of the application. Moving on, you ll see how to build a full-fledged application step by step. We ll show you how to use plugins, and how to communicate with the native OS libraries easily so that you can customize your application as if your app was created in Java or Objective C. We then deal with the issues that arise from being cross platform and compensate for the different screen sizes, screen resolutions, and device abilities. Finally, we progress to testing and deploying your app.",
    "name": "Getting Started with NativeScript",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Michael David",
    "pages": 318,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1451/41568adfa17d19e.jpeg",
    "download_link_epub": null,
    "ISBN": "1785887645",
    "download_link_pdf": "http://file.allitebooks.com/20160104/WordPress Search Engine Optimization, 2nd Edition.pdf",
    "year": "2015",
    "language": "English",
    "price": 167,
    "description": "WordPress is a powerful platform for creating feature-rich and attractive websites but, with a little extra tweaking and effort, your WordPress site can dominate search engines and bring thousands of new customers to your business.\nWordPress Search Engine Optimization will show you the secrets that professional SEO companies use to take websites to the top of search results. You ll take your WordPress site to the next level; you ll brush aside even the stiffest competition with the advanced tutorials in this book.",
    "name": "WordPress Search Engine Optimization, 2nd Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Peter Kent",
    "pages": 456,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2015/12/SEO-For-Dummies-6th-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "1119129559",
    "download_link_pdf": "http://file.allitebooks.com/20151218/SEO For Dummies, 6th Edition.pdf",
    "year": "2015",
    "language": "English",
    "price": 90,
    "description": "Your fully updated guide to search engine optimization\nPacked with tips, tricks, and secrets, <i>SEO For Dummies</i> shows you how to create and maintain a website that ranks at the top of search engines and drives high-volume traffic. Using plain-English explanations and easy-to-follow instructions, this friendly guide helps you come to grips with search engine basics—what they are, which ones are important, and how to get started—and build a search-engine-friendly site.\nSEO is an integral part of getting a site to rank in the various search engines in order to attract potential customers. In the new edition of this bestselling guide to search engine optimization, you ll learn the ins and outs and best practices of successful SEO in order to make your website content more search-engine friendly so that it ranks higher among searches and draws the masses. Covering the latest information on pay-per-click options, using social media to boost your profile, and managing your platform and reputation to positively impact your search engine rankings, this hands-on guide is the fun and friendly place to start learning how to move your site to the top of the rankings.Develop a search strategy and use local search capabilities\nBuild sites that increase your search visibility\nAnalyze results with updated tracking tools\nMaximize content marketing strategiesIf you re asking yourself the essential question ofhow do I get people to visit my site,you ve come to the right place!",
    "name": "SEO For Dummies, 6th Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Dharmesh Shah",
    "pages": 236,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2015/09/Inbound-Marketing-Get-Found-Using-Google-Social-Media-and-Blogs.jpg",
    "download_link_epub": null,
    "ISBN": "0470499311",
    "download_link_pdf": "http://file.allitebooks.com/20150901/Inbound Marketing Get Found Using Google, Social Media, and Blogs.pdf",
    "year": "2009",
    "language": "English",
    "price": 102,
    "description": "Stop pushing your message out and start pulling your customers in Traditionaloutboundmarketing methods like cold-calling, email blasts, advertising, and direct mail are increasingly less effective. People are getting better at blocking these interruptions out using Caller ID, spam protection, TiVo, etc. People are now increasingly turning to Google, social media, and blogs to find products and services. Inbound Marketing helps you take advantage of this change by showing you how to get found by customers online. Inbound Marketing is a how-to guide to getting found via Google, the blogosphere, and social media sites.\n* Improve your rankings in Google to get more traffic<br />\n* Build and promote a blog for your business<br />\n* Grow and nurture a community in Facebook, LinkedIn, Twitter, etc.<br />\n* Measure what matters and do more of what works online\nThe rules of marketing have changed, and your business can benefit from this change. Inbound Marketing shows you how to get found by more prospects already looking for what you have to sell.",
    "name": "Inbound Marketing",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Sean Odom",
    "pages": 264,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2015/12/SEO-For-2016-The-Complete-Do-It-Yourself-SEO-Guide.jpg",
    "download_link_epub": null,
    "ISBN": "0990564460",
    "download_link_pdf": "http://file.allitebooks.com/20151221/SEO For 2016.pdf",
    "year": "2015",
    "language": "English",
    "price": 149,
    "description": "With over twenty thousand online pre-orders, this is the SEO book the industry waits for every year! With over seven million copies sold since 2001, Sean Odom is the industry expert you can count on to deliver what you need to know to succeed in your website marketing in 2016. With new and updated coverage of Google Webmaster Tools, the Data Highlighter Tools, and specific algorithm changes you need to know to succeed including the all new RankBrain AI! Businesses pay big money to have Sean Odom and his team handle their SEO every year and he places all of his secrets in this book every year! It has become the trusted blue print of how to succeed in SEO whether you use, WordPress, Joomla, HTML4/5 or any other website design platform you need this book. Trust no other SEO provider or book to your businesses success or you may be sorry.",
    "name": "SEO For 2016",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Rupak Nepali",
    "pages": 208,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1438/3155c45af7d3b4d.jpeg",
    "download_link_epub": null,
    "ISBN": "1783987685",
    "download_link_pdf": "http://file.allitebooks.com/20150807/OpenCart Theme and Module Development.pdf",
    "year": "2015",
    "language": "English",
    "price": 59,
    "description": "OpenCart is an e-commerce cart application built with its own in-house Model-View-Controller-Language framework. With its popularity and ease of use for e-commerce, OpenCart is being used more and more to create custom extensions, themes, and pages.\nThis book embarks on an exciting journey of creating custom themes, pages, and templates in OpenCart.\nIt shows you how to change and manage the general setting of your store and manage the modules and their layout, along with files and folders of the default theme. You will explore the featured module to help you understand module code and its functionality. Finally, you will learn to create customized pages for feedback management and make an admin section where you will make forms and lists to perform CRUD functionalities and show this feedback at the frontend.",
    "name": "OpenCart Theme and Module Development",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Cristian Darie",
    "pages": 387,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1448/81565612f762d08.jpeg",
    "download_link_epub": null,
    "ISBN": "0470100923",
    "download_link_pdf": "http://file.allitebooks.com/20151125/Professional Search Engine Optimization with PHP.pdf",
    "year": "2007",
    "language": "English",
    "price": 33,
    "description": "Maybe you re a great programmer or IT professional, but marketing isn t your thing. Or perhaps you re a tech-savvy search engine marketer who wants a peek under the hood of a search engine optimized web site. Search engine marketing is a field where technology and marketing are both critical and interdependent, because small changes in the implementation of a web site can make you or break you in search engine rankings. Furthermore, the fusion of technology and marketing know-how can create web site features that attract more visitors. The mission of this book is to help web developers create web sites that rank well with the major search engines, and to teach search engine marketers how to use technology to their advantage. We assert that neither marketing nor IT can exist in a vacuum, and it is essential that they not see themselves as opposing forces in an organization. They must work together. This book aims to educate both sides in that regard.",
    "name": "Professional Search Engine Optimization with PHP",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Simon Brew",
    "pages": 132,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1443/135605af7bc23dc.jpeg",
    "download_link_epub": null,
    "ISBN": "1781064474",
    "download_link_pdf": "http://file.allitebooks.com/20150925/Independent Guide to Ebay 2016.pdf",
    "year": "2016",
    "language": "English",
    "price": 37,
    "description": "Thinking of diving into the exciting world of eBay but not quite sure where to start? You ve come to the right place. You are holding in your hands a thorough guide to everything you need to know about the online marketplace: from how it started to how it can help you, from making your first bid on an exciting item to setting up your own eBay shop. Through this guide, we look at how to be a successful buyer and seller on eBay. We won t sugar coat it we ll point out the cons as well as the pros, and help you avoid common pitfalls.",
    "name": "Independent Guide to Ebay 2016",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Kristina Cutura",
    "pages": 372,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/52556db0b3ecccb.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84968-584-9",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Advertising on Google The High Performance Cookbook.pdf",
    "year": "2013",
    "language": "English",
    "price": 130,
    "description": "Google Adwords is one of the most effective ways to advertise today with unprecedented reach and potential to show your ads to millions of Internet users instantly. It helps in bringing highly relevant ads to customers who are searching for you in real-time, resulting in highly accountable and cost-effective campaigns that even the smallest advertisers can take advantage of.\nAdvertising on Google: The High Performance Cookbook is a step-by-step guide with practical tips and everyday examples that will arm you with the tools necessary to run effective Adwords campaigns.\nAdvertising on Google: The High Performance Cookbook is a collection of hands-on recipes for creating and optimizing Adwords campaigns The book begins with the research you ll need to conduct before starting with Adwords, including figuring out how competitive your market is and finding out what your competitors are doing.",
    "name": "Advertising on Google: The High Performance Cookbook",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Simon Kloostra",
    "pages": 200,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1436/7455a4f8ed6bbeb.jpeg",
    "download_link_epub": null,
    "ISBN": "1484211251",
    "download_link_pdf": "http://file.allitebooks.com/20150714/Joomla! 3 SEO and Performance.pdf",
    "year": "2015",
    "language": "English",
    "price": 140,
    "description": "Joomla 3 SEO and Performance is a concise, 188-page book that helps you to build websites that dominate search engine rankings and have super-fast load times, giving your sites an increased audience. The book takes a very practical approach full of real-world examples. It does not just provide instructions, but also teaches you the logic behind what you are doing. It will make you breathe SEO while building your websites, which is the only way to success.\nJoomla 3 SEO and Performance starts with the Joomla core SEO possibilities. It shows how even if you are a relative newcomer to Joomla you will be able to build sites that rank high in Google without having to install complicated plugins. The remaining chapters dig much deeper, both into Joomla, and into the use of SEO plugins and extensions with a full chapter dedicated to SH404SEF, probably the best SEO extension for Joomla. In order to keep the visitors that you acquire, Joomla 3 SEO and Performance also shows you how to make your website load faster. This is achieved using Joomla core features as well as plugins. You will be stunned how easy it is to achieve massive improvements!",
    "name": "Joomla! 3 SEO and Performance",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Jeff Sauro",
    "pages": 340,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/52556db0c32094d.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-93759-4, 1118937597",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Customer Analytics For Dummies.pdf",
    "year": "2015",
    "language": "English",
    "price": 158,
    "description": "The easy way to grasp customer analytics\nEnsuring your customers are having positive experiences with your company at all levels, including initial brand awareness and loyalty, is crucial to the success of your business. Customer Analytics For Dummies shows you how to measure each stage of the customer journey and use the right analytics to understand customer behavior and make key business decisions.\nCustomer Analytics For Dummies gets you up to speed on what you should be testing. You ll also find current information on how to leverage A/B testing, social media s role in the post-purchasing analytics, usability metrics, prediction and statistics, and much more to effectively manage the customer experience. Written by a highly visible expert in the area of customer analytics, this guide will have you up and running on putting customer analytics into practice at your own business in no time.",
    "name": "Customer Analytics For Dummies",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "John Haydon",
    "pages": 792,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/52556db0be209ec.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-81618-9",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Facebook Marketing All-in-One For Dummies, 3rd Edition.pdf",
    "year": "2014",
    "language": "English",
    "price": 55,
    "description": "Facebook Marketing All-in-One For Dummies, 3rd Edition is a detailed resource for businesses, brands, and people who are interested in promoting themselves, their goods, and their services on Facebook. Fully updated to cover new Facebook features, this new Third Edition includes guidance on Graph Search, the updated News Feed design, cover photo rules, advertising changes, updated mobile apps, and more. Examples and case studies illustrate best practices, and the book provides step-by-step guidance on creating a successful Facebook marketing campaign, from setting up a fan page to analyzing results.\nFacebook is considered the most fully-engaged social media platform for most marketers. With more than a billion users who comment over 3.2 billion times per day, Facebook provides a ready and willing customer base to businesses savvy enough to take advantage.",
    "name": "Facebook Marketing All-in-One For Dummies, 3rd Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Ben Griffith",
    "pages": 136,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/52556db0aecba2d.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78217-778-4",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Marketing Automation with Eloqua.pdf",
    "year": "2013",
    "language": "English",
    "price": 192,
    "description": "Eloqua is a powerful platform that develops automated marketing and demand generation software and services for business-to-business marketers. It provides enough tools to start to centralize marketing operations and build holistic views of demand generation across multiple channels. This, in turn, gives marketers actionable results for their campaigns and the ability to centralize more of this data from one or a few systems. It helps ensure every component of marketing works harder and more efficiently to drive revenue.\nThis practical guide will help you realize your full potential by demonstrating how your campaign vision can be translated into a digital campaign in Eloqua, and how to measure its success.It will walk you through building a practical campaign, and explains the powerful features of Eloqua on this journey. You ll also learn how to utilize these features in your campaign along with various tools that will enhance its marketing value.",
    "name": "Marketing Automation with Eloqua",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "John Myles White",
    "pages": 88,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db09f94944.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4493-4133-6",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Bandit Algorithms for Website Optimization.pdf",
    "year": "2012",
    "language": "English",
    "price": 157,
    "description": "When looking for ways to improve your website, how do you decide which changes to make? And which changes to keep? This concise book shows you how to use Multiarmed Bandit algorithms to measure the real-world value of any modifications you make to your site. Author John Myles White shows you how this powerful class of algorithms can help you boost website traffic, convert visitors to customers, and increase many other measures of success.",
    "name": "Bandit Algorithms for Website Optimization",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Tim Ash",
    "pages": 482,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db09a7c72d.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-61012-1, 978-1-118-22072-6, 978-1-118-23453-2, 978-1-118-25902-3",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Landing Page Optimization.pdf",
    "year": "2012",
    "language": "English",
    "price": 30,
    "description": "A fully updated guide to making your landing pages profitable. Effective Internet marketing requires that you test and optimize your landing pages to maximize exposure and conversion rate. This second edition of a bestselling guide to landing page optimization includes case studies with before-and-after results as well as new information on web site usability. It covers how to prepare all types of content for testing, how to interpret results, recognize the seven common design mistakes, and much more. Included is a gift card for Google AdWords.",
    "name": "Landing Page Optimization",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "John Haydon",
    "pages": 340,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/52556db0b916679.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-95132-3, 1118951328",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Facebook Marketing For Dummies, 5th Edition.pdf",
    "year": "2014",
    "language": "English",
    "price": 61,
    "description": "Practical Facebook marketing strategies, tactics, and techniques\nThis new edition of Facebook Marketing For Dummies arms novice to expert marketers with everything they need to plan, refine, execute, and maintain a successful Facebook marketing campaign. Fully updated to cover the latest tools and techniques of Facebook marketing, you ll find hands-on guidance to create and administer your Page Timeline, understand the psychology of the Facebook user, build your fan base, utilize events, contests, and polls to promote your Page, increase your brand awareness, integrate your Facebook marketing campaign with other marketing strategies, and monitor, measure, and adjust your Facebook marketing campaigns.\nWritten by a leading expert on helping others use Facebook and other social media tools to promote and enhance their brands, this practical guide gets you up and running on Facebook marketing—fast. In plain English, it walks you through all the latest features, including new designs for the News Feed, Timeline, and Pages, as well as major changes to the Facebook advertising platform.\n* Includes real-world case studies that illustrate how successful Facebook marketing really works<br />\n* Fully updated to cover the latest tools and techniques in Facebook marketing<br />\n* Shows marketers how to use Facebook to reach and engage their target audience<br />\n* Provides step-by-step instructions on how to organize, optimize, and manage your Facebook advertising campaigns\nIf you re a marketer looking to develop or refine a social media marketing plan that includes significant Facebook presence, Facebook Marketing For Dummies is your go-to guide.",
    "name": "Facebook Marketing For Dummies, 5th Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Michael Beasley",
    "pages": 251,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/52556db0a9b824f.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-12-404619-1",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Practical Web Analytics for User Experience.pdf",
    "year": "2013",
    "language": "English",
    "price": 177,
    "description": "Practical Web Analytics for User Experienceteaches you how to use web analytics to help answer the complicated questions facing UX professionals. Within this book, you ll find a quantitative approach for measuring a website s effectiveness and the methods for posing and answering specific questions about how users navigate a website. The book is organized according to the concerns UX practitioners face. Chapters are devoted to traffic, clickpath, and content use analysis, measuring the effectiveness of design changes, including A/B testing, building user profiles based on search habits, supporting usability test findings with reporting, and more. This is the must-have resource you need to start capitalizing on web analytics and analyze websites effectively.",
    "name": "Practical Web Analytics for User Experience",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Rafiq Elmansy",
    "pages": 320,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/52556db0a49e4e4.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-47066-4",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Teach Yourself Visually Search Engine Optimization.pdf",
    "year": "2013",
    "language": "English",
    "price": 111,
    "description": "Whether promoting yourself, your business, or your hobbies and interest, you want your website or blog to appear near the top when your customers search. Search engine optimization, or SEO, is increasingly essential to businesses. This full-color, step-by-step guide demonstrates key SEO concepts and practices in an easy-to-follow visual format. Learn how to set up your website and what to implement to help your business or product make a great showing in search results.",
    "name": "Teach Yourself Visually Search Engine Optimization",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Matthew MacDonald",
    "pages": 60,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db06c63e71.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4493-8252-0",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Attract Visitors to Your Site The Mini Missing Manual.pdf",
    "year": "2010",
    "language": "English",
    "price": 137,
    "description": "To be a success, a website has to attract-and keep visitors. This Mini Missing Manual shows you how to attract new and return visitors and use the power of keywords and Web search engines to rise up in the rankings of search results. You ll also learn how to use a powerful-and free service that tracks visitor activity on your site so you know which of your Web pages they love, and-just as important which pages don t work for them. Using this information, you can fine-tune your site to keep the visitors coming.\nThis Mini Missing Manual is excerpted from Creating a Web Site: The Missing Manual.",
    "name": "Attract Visitors to Your Site: The Mini Missing Manual",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Stephan Spencer",
    "pages": 718,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db086095f7.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-44930-421-8",
    "download_link_pdf": "http://file.allitebooks.com/20150602/The Art of SEO, 2nd Edition.pdf",
    "year": "2012",
    "language": "English",
    "price": 91,
    "description": "Four acknowledged experts in search engine optimization share guidelines and innovative techniques that will help you plan and execute a comprehensive SEO strategy. This second edition brings you up to date on recent changes in search engine behaviorsuch as new ranking methods involving user engagement and social mediawith an array of effective tactics, from basic to advanced.",
    "name": "The Art of SEO, 2nd Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Matthew A. Russell",
    "pages": 360,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db0717acfe.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4493-8834-8",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Mining the Social Web.pdf",
    "year": "2011",
    "language": "English",
    "price": 161,
    "description": "Facebook, Twitter, and LinkedIn generate a tremendous amount of valuable social data, but how can you find out who s making connections with social media, what theyâ\u0080\u0099re talking about, or where theyâ\u0080\u0099re located? This concise and practical book shows you how to answer these questions and more. You ll learn how to combine social web data, analysis techniques, and visualization to help you find what you ve been looking for in the social haystack, as well as useful information you didn t know existed.\nEach standalone chapter introduces techniques for mining data in different areas of the social Web, including blogs and email. All you need to get started is a programming background and a willingness to learn basic Python tools.",
    "name": "Mining the Social Web",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Mathew Patterson",
    "pages": 200,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db06762b86.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-9805768-6-3",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Create Stunning HTML Email That Just Works.pdf",
    "year": "2010",
    "language": "English",
    "price": 64,
    "description": "Create Stunning HTML Email That Just Works is a step-by-step guide to creating beautiful HTML emails that consistently work. It begins with an introduction to email covering topics such as: how email design differs from web design; permission based marketing, and the anatomy of an email.\nThe book shows the reader how to plan, design, and build gorgeous HTML email designs that look great in every email program: Outlook, Gmail, Apple Mail, etc. All-important tasks like legal requirements, testing, spam compliance and known hacks and workarounds are covered.",
    "name": "Create Stunning HTML Email That Just Works",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Antonio Cangiano",
    "pages": 288,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db08b1aaad.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-93435-688-3",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Technical Blogging.pdf",
    "year": "2012",
    "language": "English",
    "price": 113,
    "description": "Become more influential and earn extra money by blogging. Whether you want to create a popular technical blog from scratch or take your blog to the next level, this book shows you how.\nYou ll learn how to promote your blog, understand traffic statistics, and build a community. And once you ve built it, you ll learn how to benefit from it: advance your career, make money from your blog, use it to promote your products or company, and take advantage of your blog to the fullest. And when your blog takes off, Antonio will show you how to avoid the pitfalls of success.\nTechnical Blogging is the only guide you ll need to create and maintain a successful technical blog.",
    "name": "Technical Blogging",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Kevin Purdy",
    "pages": 232,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db0768fc4e.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4493-1187-2",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Google+ The Missing Manual.pdf",
    "year": "2011",
    "language": "English",
    "price": 198,
    "description": "If you want to gain more control over your social networking activities with Google+, this jargon-free guide helps you quickly master the ins and outs of the site. Learn how to organize your contacts, hold video chats with as many as ten people, and determine exactly who may learn what about you. With this book, youâ\u0080\u0099ll navigate Google+ with ease.",
    "name": "Google+: The Missing Manual",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Peter Kent",
    "pages": 459,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db0903b96b.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-33685-4, 978-1-118-39619-3, 1118336852",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Search Engine Optimization For Dummies, 5th Edition.pdf",
    "year": "2012",
    "language": "English",
    "price": 182,
    "description": "Increase your online ranking with this beginner guide to SEO!\nSearch engine optimization (SEO) is an integral part of getting a site to rank high in the various search engines in order to attract potential customers. With this new edition of a bestseller, you?ll learn the ins and outs and best practices of successful SEO in order to make your website content more search-engine friendly so that it ranks higher among search engines and draws high-volume traffic.\n* Covers search engine basics to help you get started<br />\n* Introduces new coverage on content marketing and reuse, new tracking tools, platform management, and reputation management<br />\n* Details ways to build search-engine friendly sites, register your site with directories and indexes, and use analysis tools to track results<br />\n* Explains how to use link popularity in order to boost rankings<br />\n* Zeroes in on advertising your site by using pay-per-click options\nSearch Engine Optimization For Dummies, 5th Edition is the fun and friendly place to start learning how to move your site to the top of the rankings.",
    "name": "Search Engine Optimization For Dummies, 5th Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Arnold",
    "pages": 570,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db07b9de40.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-94767-8, 0470947675, 978-3527302215",
    "download_link_pdf": "http://file.allitebooks.com/20150602/E-Mail Marketing For Dummies.pdf",
    "year": "2011",
    "language": "English",
    "price": 32,
    "description": "Updated to reflect the hottest new trends, technologies, and strategies!\nMuch has happened in e-mail marketing since the first edition of this book appeared in 2007. With the dramatic rise of social media and mobile devices, there are more ways than ever to target campaigns and maximize your e-mail marketing dollars. The new edition of this helpful book is full of practical advice, whether you?re an enterprise-level marketer using a third-party e-mail marketing company or small business owner handling everything yourself.\n* Helps you map out an e-mail marketing strategy with reachable objectives<br />\n* Simplifies the process of list-building, message-creation, and results-tracking<br />\n* Offers legal guidance, so you stay compliant with anti-spam laws<br />\n* Shows you how to deliver your message and incorporate social media<br />\n* Explains how to track and interpret results<br />\n* Includes the top ten things you should not put in your messages, and much more\nGet more out of your e-mail marketing campaigns with this easy-to-follow guide.",
    "name": "E-Mail Marketing For Dummies",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Lori Calcott",
    "pages": 388,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db080ea054.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-4014-3",
    "download_link_pdf": "http://file.allitebooks.com/20150602/The Definitive Guide to Google AdWords.pdf",
    "year": "2012",
    "language": "English",
    "price": 117,
    "description": "There is one simple way to exponentially increase the amount of traffic coming to your website and the number of people aware of your product or service: through the use of Google AdWords and related marketing technologies. The Definitive Guide to Google AdWords will walk you through every step needed to maximize your marketing and advertising power.\nEverything related to the platforms are covered in detailaccount setup, campaign creation, reporting, optimization, analytics, ad creation, mobile advertising, and much more.",
    "name": "The Definitive Guide to Google AdWords",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Janice (Ginny) Redish",
    "pages": 369,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db0954d203.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-12-385930-3, 0123859301",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Letting Go of the Words, 2nd Edition.pdf",
    "year": "2012",
    "language": "English",
    "price": 74,
    "description": "Web site design and development continues to become more sophisticated. An important part of this maturity originates with well-laid-out and well-written content. Ginny Redish is a world-renowned expert on information design and how to produce clear writing in plain language for the web. All of the invaluable information that she shared in the first edition is included with numerous new examples. New information on content strategy for web sites, search engine optimization (SEO), and social media make this once again the only book you need to own to optimize your writing for the web.\n* New material on content strategy, search engine optimization, and social media<br />\n* Lots of new and updated examples<br />\n* More emphasis on new hardware like tablets, iPads, and iPhones",
    "name": "Letting Go of the Words, 2nd Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Bud E. Smith",
    "pages": 240,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db0580fd50.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-672-33545-7",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Sams Teach Yourself Google AdWords in 10 Minutes.pdf",
    "year": "2010",
    "language": "English",
    "price": 178,
    "description": "Sams Teach Yourself Google AdWords in 10 Minutes gives you straightforward, practical answers when you need fast results. By working through its 10-minute lessons, you ll learn everything you need to use Google AdWords to find more customers, sell more of your products and services, and earn higher profits at lower cost!",
    "name": "Sams Teach Yourself Google AdWords in 10 Minutes",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Michael Miller",
    "pages": 241,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db052f32a9.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-672-33320-0, 0-672-33320-1",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Sams Teach Yourself Google Analytics in 10 Minutes.pdf",
    "year": "2010",
    "language": "English",
    "price": 179,
    "description": "Sams Teach Yourself Google Analytics™ in 10 Minutes gives you straightforward, practical answers when you need fast results. By working through its 10-minute lessons, you’ll learn everything you need to use Google Analytics to accurately measure your website’s performance–and improve it!\n10 minutes is all you need to learn how to…<br />\n* Quickly create a Google Analytics account and add Google Analytics to your site<br />\n* Define goals and measure how well your site is achieving them<br />\n* Track visitors from search engines, pay-per-click advertising, email, and other sources<br />\n* Discover the pages your visitors view, how long they stay, and where they exit<br />\n* Monitor specific user actions, such as playing embedded video, selecting Flash menu items, or downloading files<br />\n* Identify your best and worst content, and fix poorly performing pages<br />\n* Improve your site by tracking error pages and broken links<br />\n* Measure AdWords traffic, position, and e-commerce performance<br />\n* Manage Google Analytics through the Dashboard<br />\n* Customize Google Analytics to work more effectively with your site<br />\n* Capture more accurate information by filtering out internal traffic<br />\n* Choose the right reports and data, understand them, and act on what you learn",
    "name": "Sams Teach Yourself Google Analytics in 10 Minutes",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Michael Becker",
    "pages": 384,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db05d47f1a.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-61668-0",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Mobile Marketing For Dummies.pdf",
    "year": "2010",
    "language": "English",
    "price": 177,
    "description": "Mobile communication is hot, and so is marketing on mobile devices. Mobile Marketing For Dummies provides a clear and easy path for creating, launching, and making the most of a mobile marketing program. Designed for marketing professionals and other business people who may have little experience with the medium, it explains mobile marketing and how to convert a traditional marketing plan to mobile. Topics include assembling resources and budget, creating a plan, following best practices, building mobile sites, and much more.",
    "name": "Mobile Marketing For Dummies",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "John I Jerkovic",
    "pages": 496,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db03390c6d.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-15707-4",
    "download_link_pdf": "http://file.allitebooks.com/20150602/SEO Warrior.pdf",
    "year": "2009",
    "language": "English",
    "price": 195,
    "description": "How can you make it easier for people to find your website? And how can you convert casual visitors into active users? SEO Warrior shows you how it s done through a collection of tried and true techniques, hacks, and best practices. Learn the nuts and bolts of SEO theory, the importance of keyword strategy, and how to avoid and remedy search engine traps. This book serves as a tutorial, and as a reference guide for implementing effective SEO techniques.",
    "name": "SEO Warrior",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Dan Zarrella",
    "pages": 288,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db04defc94.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4493-8848-5",
    "download_link_pdf": "http://file.allitebooks.com/20150602/The Facebook Marketing Book.pdf",
    "year": "2010",
    "language": "English",
    "price": 184,
    "description": "How can Facebook help you promote your brand, products, and services? This book provides proven tactics that you can use right away to build your brand and engage prospective customers. Whether you re a marketing and PR professional, an entrepreneur, or a small business owner, you ll learn about the tools and features that will help you reach specific Facebook audiences. You ll also get an in-depth overview, with colorful and easy-to-understand introductions to Profiles, Groups, Pages, Applications, Ads, Events, and Facebook etiquette.",
    "name": "The Facebook Marketing Book",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Stephanie Brown",
    "pages": 384,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db0625b6f9.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-49742-5",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Local Online Advertising For Dummies.pdf",
    "year": "2010",
    "language": "English",
    "price": 41,
    "description": "Add the newest means of advertising your business into your marketing mix by developing an online advertising strategy. This get-down-to-business guide will show you how. Written by executives from Yodle, a New York-based firm specializing in online advertising, this book reveals the best and brightest ways to get the word out, from creating a Web presence that draws visitors, to using SEO, to jumping boldly into social media advertising.",
    "name": "Local Online Advertising For Dummies",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Mary Tyler",
    "pages": 435,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db03897d12.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-53128-0, 0470531282",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Google Analytics, 3rd Edition.pdf",
    "year": "2009",
    "language": "English",
    "price": 57,
    "description": "Get the most out of the free Google Analytics service—and get more customers\nGoogle Analytics allows you to discover vital information about how end users interact with their Web sites by collecting vital data and providing tools to analyze it, with the intention of improving the end-user experience and, ultimately converting users into customers. This indispensible guide delves into the latest updates to the newest version of Google Analytics—3.0—and explains the concepts behind this amazing free tool.<br />\nYou ll discover what information to track, how to choose the right goals and filters, techniques for reading Google Analytics reports and graphs, and, most importantly, how to compile this data and use it to improve your Web site and attract more potential customers.\n* Takes an in-depth look at Google Analytics 3.0 and walks you through the possibilities it offers<br />\n* Explains how to read Google Analytics reports and graphs so that you can compile this data and use it to improve your Web site and attract more users<br />\n* Shares techniques for converting end users into customers<br />\n* Features tips and suggestions for getting the information you need from Google Analytics reports and then converting that information into actionable tasks you can use\nWith Google Analytics, Third Edition, you&amp;amp; ll be well on your way to retrieving the information you need to convert visitors to your site into customers!",
    "name": "Google Analytics, 3rd Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Howie Jacobson",
    "pages": 432,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db03da62ed.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-45577-7",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Google AdWords For Dummies, 2nd Edition.pdf",
    "year": "2009",
    "language": "English",
    "price": 184,
    "description": "Google AdWords is a unique tool that allows you to set your own budget and create ads and choose keywords that are specifically related to your business. When your ad appears next to the search results, people can simply click your ad to learn more about you or make a purchase. This handy guide walks you through the newest tips, tricks, and techniques for maximizing your AdWords campaign.\nOffering valuable advice, this new edition includes case studies from readers who have shared what they learned from using the techniques revealed in the first edition.",
    "name": "Google AdWords For Dummies, 2nd Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Richard Krueger",
    "pages": 312,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db047c7100.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-48762-4",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Facebook Marketing For Dummies.pdf",
    "year": "2009",
    "language": "English",
    "price": 30,
    "description": "Facebook boasts an extremely devoted user base, with more than 65 billion page visits per month. With Facebook, an organization can market and promote their brand, products, or services via the network s built-in components of profile pages, polls, community building, advertising, word-of-mouth marketing, and business applications. This insightful resource focuses on the strategies, tactics, and techniques necessary to lead your organization into the world of Facebook marketing.\nPacked with vital real-world case studies, the book serves as a must-have guide for the most reliable, responsible, and ethical business and marketing practices with Facebook.",
    "name": "Facebook Marketing For Dummies",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Harold Davis",
    "pages": 432,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db042b5c4c.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-15579-7",
    "download_link_pdf": "http://file.allitebooks.com/20150602/Google Advertising Tools, 2nd Edition.pdf",
    "year": "2009",
    "language": "English",
    "price": 121,
    "description": "With this book, you ll learn how to take full advantage of Google AdWords and AdSense, sophisticated online advertising tools used by thousands of businesses large and small. The second edition provides a substantially updated guide to advertising on the Web: how it works in general, and how Google s advertising programs in particular help you make money. Several business case studies demonstrate which approaches work well, which don t, and why.",
    "name": "Google Advertising Tools, 2nd Edition",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Dan Zarrella",
    "pages": 240,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db02452e1c.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-80660-6",
    "download_link_pdf": "http://file.allitebooks.com/20150602/The Social Media Marketing Book.pdf",
    "year": "2009",
    "language": "English",
    "price": 151,
    "description": "Take advantage of the phenomenon that is quickly becoming the most effective way to market brands, products, and servicessocial media. This easy-to-understand book introduces you to social networks, blogging, and several other websites, and helps you plan and execute strategies with actionable advice every step of the way. Determine which networks fit your marketing program, and learn the techniques necessary to measure results and track return on investment.",
    "name": "The Social Media Marketing Book",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Stephan Spencer",
    "pages": 608,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db02e73c34.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-51886-8",
    "download_link_pdf": "http://file.allitebooks.com/20150602/The Art of SEO.pdf",
    "year": "2009",
    "language": "English",
    "price": 128,
    "description": "If your company is going to succeed in the web economy, optimizing your site for search engine visibility is essential. In this book, four of the most noted experts in the field of search engine optimization (SEO) provide you with proven guidelines and cutting-edge techniques for planning and executing a comprehensive SEO strategy. The authors clearly explain SEO fundamentals, while correcting many common misconceptions.",
    "name": "The Art of SEO",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Dan Gillmor",
    "pages": 336,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db019b421d.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-10227-2",
    "download_link_pdf": "http://file.allitebooks.com/20150602/We the Media.pdf",
    "year": "2006",
    "language": "English",
    "price": 189,
    "description": "In We the Media, nationally acclaimed newspaper columnist and blogger Dan Gillmor shows how anyone can produce the news, using personal blogs, internet chat groups, email, and a host of other tools. He tells the story of this emerging phenomenon and sheds light on this deep shift in how we make and consume the news. Journalism in the 21st century will be fundamentally different from the Big Media oligarchy that prevails today. We the Media casts light on the future of journalism, and invites us all to be part of it.",
    "name": "We the Media",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Jerri L. Ledford",
    "pages": 408,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db01f4639c.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-470-17500-2",
    "download_link_pdf": "http://file.allitebooks.com/20150602/SEO Bible.pdf",
    "year": "2007",
    "language": "English",
    "price": 92,
    "description": "This in-depth Bible delivers the holy grail of online marketing: how to influence search engine results to drive online shoppers to specific Web sites; the process is called search engine optimization (SEO) and it is a hot topic. One-stop resource offers readers what they need to plan and implement a successful SEO program, including useful tips on finding the shortest routes to success, strategy suggestions, and sidebars with more information and additional resources. Features interviews with executives from top search companies, plus appendices on creating successful listings with Google, MSN, Yahoo!, and others.",
    "name": "SEO Bible",
    "category": "Marketing &amp; SEO"
  },
  {
    "author": "Tamar Weinberg",
    "pages": 368,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1433/51556db02953551.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-15681-7",
    "download_link_pdf": "http://file.allitebooks.com/20150602/The New Community Rules.pdf",
    "year": "2009",
    "language": "English",
    "price": 60,
    "description": "The social web provides businesses with a largely untapped marketing channel for products and servicesthe trick is knowing how to take advantage of it. With this book, you ll understand how social web technologies work, and learn the most practical and effective ways to reach the people who frequent these websites. You ll get intelligent advice and strategiesincluding what works and what doesn t.",
    "name": "The New Community Rules",
    "category": "Marketing &amp; SEO"
  }
]