[
  {
    "author": "Piyush Verma",
    "pages": 138,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2019/03/Wireshark-Network-Security-400x493.jpg",
    "download_link_epub": "http://file.allitebooks.com/20190315/Wireshark Network Security.epub",
    "ISBN": "1784393339",
    "download_link_pdf": "http://file.allitebooks.com/20190315/Wireshark Network Security.pdf",
    "year": "2015",
    "language": "English",
    "price": 188,
    "description": "Wireshark is the world s foremost network protocol analyzer for network analysis and troubleshooting.\nThis book will walk you through exploring and harnessing the vast potential of Wireshark, the world s foremost network protocol analyzer.\nThe book begins by introducing you to the foundations of Wireshark and showing you how to browse the numerous features it provides. You ll be walked through using these features to detect and analyze the different types of attacks that can occur on a network. As you progress through the chapters of this book, you ll learn to perform sniffing on a network, analyze clear-text traffic on the wire, recognize botnet threats, and analyze Layer 2 and Layer 3 attacks along with other common hacks.\nBy the end of this book, you will be able to fully utilize the features of Wireshark that will help you securely administer your network.\nAbout This BookMake the most of Wireshark by breezing through all its features and analyzing network security threats\nFull of scenarios faced by security analysts along with comprehensive solutions\nPacked with step-by-step instructions to walk you through the capabilities of WiresharkWho This Book Is For\nIf you are network administrator or a security analyst with an interest in using Wireshark for security analysis, then this is the book for you. Basic familiarity with common network and application services terms and technologies is assumed.\nWhat You Will LearnFamiliarize yourself with the robust features offered by Wireshark\nUse the powerful command-line utilities shipped with Wireshark\nAnalyze numerous threats to network security using Wireshark\nInvestigate attacks performed using popular security tools such as Nmap, Nessus, Metasploit, and more\nSolve real-world CTF challenges using Wireshark\nCreate your own security-related profile in Wireshark\nConfigure Wireshark for effective network troubleshooting\nGet accustomed to common scenarios faced by security analysts\nAnalyze malware traffic successfully by using Wireshark\nUnearth anomalies hampering the speed of network communications",
    "name": "Wireshark Network Security",
    "category": "Security"
  },
  {
    "author": "Chey Cobb",
    "pages": 336,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2019/03/Cryptography-For-Dummies-400x493.jpg",
    "download_link_epub": null,
    "ISBN": "0764541889",
    "download_link_pdf": "http://file.allitebooks.com/20190313/Cryptography For Dummies.pdf",
    "year": "2004",
    "language": "English",
    "price": 60,
    "description": "Cryptography is the most effective way to achieve data security and is essential to e-commerce activities such as online shopping, stock trading, and banking\nThis invaluable introduction to the basics of encryption covers everything from the terminology used in the field to specific technologies to the pros and cons of different implementations\nDiscusses specific technologies that incorporate cryptography in their design, such as authentication methods, wireless encryption, e-commerce, and smart cards\nBased entirely on real-world issues and situations, the material provides instructions for already available technologies that readers can put to work immediately\nExpert author Chey Cobb is retired from the NRO, where she held a Top Secret security clearance, instructed employees of the CIA and NSA on computer security and helped develop the computer security policies used by all U.S. intelligence agencies",
    "name": "Cryptography For Dummies",
    "category": "Security"
  },
  {
    "author": "Carey Parker",
    "pages": 400,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2018/08/Firewalls-Dont-Stop-Dragons.jpg",
    "download_link_epub": "http://file.allitebooks.com/20180827/Firewalls Don't Stop Dragons, 3rd Edition.epub",
    "ISBN": "1484238516",
    "download_link_pdf": "http://file.allitebooks.com/20180827/Firewalls Don't Stop Dragons, 3rd Edition.pdf",
    "year": "2018",
    "language": "English",
    "price": 152,
    "description": "Rely on this practical, end-to-end guide on cyber safety and online security written expressly for a non-technical audience. You will have just what you need to protect yourself―step by step, without judgment, and with as little jargon as possible. Just how secure is your computer right now? You probably don t really know. Computers and the Internet have revolutionized the modern world, but if you re like most people, you have no clue how these things work and don t know the real threats.\nProtecting your computer is like defending a medieval castle. While moats, walls, drawbridges, and castle guards can be effective, you d go broke trying to build something dragon-proof. This book is not about protecting yourself from a targeted attack by the NSA; it s about armoring yourself against common hackers and mass surveillance. There are dozens of no-brainer things we all should be doing to protect our computers and safeguard our data―just like wearing a seat belt, installing smoke alarms, and putting on sunscreen.\nAuthor Carey Parker has structured this book to give you maximum benefit with minimum effort. If you just want to know what to do, every chapter has a complete checklist with step-by-step instructions and pictures. The book contains more than 150 tips to make you and your family safer. It includes:Added steps for Windows 10 (Spring 2018) and Mac OS X High Sierra\nExpanded coverage on mobile device safety\nExpanded coverage on safety for kids online\nMore than 150 tips with complete step-by-step instructions and picturesWhat You’ll LearnSolve your password problems once and for all\nBrowse the web safely and with confidence\nBlock online tracking and dangerous ads\nChoose the right antivirus software for you\nSend files and messages securely\nSet up secure home networking\nConduct secure shopping and banking online\nLock down social media accounts\nCreate automated backups of all your devices\nManage your home computers\nUse your smartphone and tablet safely\nSafeguard your kids online\nAnd more!",
    "name": "Firewalls Don&#8217;t Stop Dragons, 3rd Edition",
    "category": "Security"
  },
  {
    "author": "Aditya Gupta",
    "pages": 320,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2019/04/The-IoT-Hackers-Handbook.jpg",
    "download_link_epub": "http://file.allitebooks.com/20190401/The IoT Hacker's Handbook.epub",
    "ISBN": "1484242998",
    "download_link_pdf": "http://file.allitebooks.com/20190401/The IoT Hacker's Handbook.pdf",
    "year": "2019",
    "language": "English",
    "price": 70,
    "description": "Take a practioner’s approach in analyzing the Internet of Things (IoT) devices and the security issues facing an IoT architecture.You’ll review the architecture s central components, from hardware communication interfaces, such as UARTand SPI, to radio protocols, such as BLE or ZigBee. You ll also learn to assess a device physically by opening it, looking at the PCB, and identifying the chipsets and interfaces. You ll then use that information to gain entry to the device or to perform other actions, such as dumping encryption keys and firmware.As the IoT rises to one of the most popular tech trends, manufactures need to take necessary steps to secure devices and protect them from attackers. The IoT Hacker s Handbook breaks down the Internet of Things, exploits it, and reveals how these devices can be built securely.What You’ll LearnPerform a threat model of a real-world IoT device and locate all possible attacker entry points\nUse reverse engineering of firmware binaries to identify security issues\nAnalyze,assess, and identify security issues in exploited ARM and MIPS based binaries\nSniff, capture, and exploit radio communication protocols, such as Bluetooth Low Energy (BLE), and ZigBeeWho This Book is ForThose interested in learning about IoT security, such as pentesters working in different domains, embedded device developers, or IT people wanting to move to an Internet of Things security role.",
    "name": "The IoT Hacker&#8217;s Handbook",
    "category": "Security"
  },
  {
    "author": "Steven M. Rice",
    "pages": 320,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2018/12/Securities-Industry-Essentials-Exam-For-Dummies-with-Online-Practice.jpg",
    "download_link_epub": "http://file.allitebooks.com/20181222/Securities Industry Essentials Exam For Dummies with Online Practice.epub",
    "ISBN": "1119545005",
    "download_link_pdf": null,
    "year": "2019",
    "language": "English",
    "price": 110,
    "description": "Get ready to qualify for the security industry job of your dreams\nThe Securities Industry Essentials (SIE) Exam is a new test administered by FINRA beginning in October 2018. This exam is required as a prerequisite to each series level knowledge exam (such as Series 7). If you’re prepping for the exam, you need a trusted resource to ensure your very best performance.\nSecurities Industry Essentials Exam For Dummies with Online Practice gives you everything you need to score high on this important exam. With two practice tests in the book, plus two bonus tests online, you can practice your way to a calm and confident experience on exam day.Take 4 full-length practice tests with answers and full explanations\nGet 1-year access to practice and tests online\nFind strategies and tips for breaking into the securities industry\nIncrease your chances of scoring higherSIE scores are expected to be a critical factor in determining qualification to enter the securities industry, so the stakes are high. With the help of this book, you’ll up your chances of breaking into this field and landing your dream job.",
    "name": "Securities Industry Essentials Exam For Dummies with Online Practice",
    "category": "Security"
  },
  {
    "author": "Gavin Wood Ph. D.",
    "pages": 424,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2019/02/Mastering-Ethereum.jpg",
    "download_link_epub": null,
    "ISBN": "1491971940",
    "download_link_pdf": "http://file.allitebooks.com/20190222/Mastering Ethereum.pdf",
    "year": "2018",
    "language": "English",
    "price": 182,
    "description": "If you re looking to get started with the Ethereum protocol or are among the many open source developers, integrators, and system administrators already working with this platform Mastering Ethereum is the definitive book on the topic.\nEthereum represents the gateway to a worldwide, decentralized computing paradigm. This platform enables you to run decentralized applications (DApps) and smart contracts that have no central points of failure or control, integrate with a payment network, and operate on an open blockchain. With this practical guide, Andreas M. Antonopoulos and Gavin Wood provide everything you need to know about building smart contracts and DApps on Ethereum and other virtual-machine blockchains.\nDiscover why IBM, Microsoft, NASDAQ, and hundreds of other organizations are experimenting with Ethereum. This essential guide shows you how to develop the skills necessary to be an innovator in this growing and exciting new industry.",
    "name": "Mastering Ethereum",
    "category": "Security"
  },
  {
    "author": "Nihad A. Hassan",
    "pages": 335,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2019/02/Digital-Forensics-Basics.jpg",
    "download_link_epub": "http://file.allitebooks.com/20190227/Digital Forensics Basics.epub",
    "ISBN": "1484238370",
    "download_link_pdf": "http://file.allitebooks.com/20190227/Digital Forensics Basics.pdf",
    "year": "2019",
    "language": "English",
    "price": 55,
    "description": "Use this hands-on, introductory guide to understand and implement digital forensics to investigate computer crime using Windows, the most widely used operating system. This book provides you with the necessary skills to identify an intruder s footprints and to gather the necessary digital evidence in a forensically sound manner to prosecute in a court of law.\nDirected toward users with no experience in the digital forensics field, this book provides guidelines and best practices when conducting investigations as well as teaching you how to use a variety of tools to investigate computer crime. You will be prepared to handle problems such as law violations, industrial espionage, and use of company resources for private use.\nDigital Forensics Basics is written as a series of tutorials with each task demonstrating how to use a specific computer forensics tool or technique. Practical information is provided and users can read a task and then implement it directly on their devices. Some theoretical information is presented to define terms used in each technique and for users with varying IT skills.\nWhat You’ll LearnAssemble computer forensics lab requirements, including workstations, tools, and more\nDocument the digital crime scene, including preparing a sample chain of custody form\nDifferentiate between law enforcement agency and corporate investigations\nGather intelligence using OSINT sources\nAcquire and analyze digital evidence\nConduct in-depth forensic analysis of Windows operating systems covering Windows 10–specific feature forensics\nUtilize anti-forensic techniques, including steganography, data destruction techniques, encryption, and anonymity techniquesWho This Book Is For\nPolice and other law enforcement personnel, judges (with no technical background), corporate and nonprofit management, IT specialists and computer security professionals, incident response team members, IT military and intelligence services officers, system administrators, e-business security professionals, and banking and insurance professionals",
    "name": "Digital Forensics Basics",
    "category": "Security"
  },
  {
    "author": "Eric C. Thompson",
    "pages": 176,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2018/09/Cybersecurity-Incident-Response.jpg",
    "download_link_epub": "http://file.allitebooks.com/20180921/Cybersecurity Incident Response.epub",
    "ISBN": "1484238699",
    "download_link_pdf": "http://file.allitebooks.com/20180921/Cybersecurity Incident Response.pdf",
    "year": "2018",
    "language": "English",
    "price": 34,
    "description": "Create, maintain, and manage a continual cybersecurity incident response program using the practical steps presented in this book. Don t allow your cybersecurity incident responses (IR) to fall short of the mark due to lack of planning, preparation, leadership, and management support.\nSurviving an incident, or a breach, requires the best response possible. This book provides practical guidance for the containment, eradication, and recovery from cybersecurity events and incidents.\nThe book takes the approach that incident response should be a continual program. Leaders must understand the organizational environment, the strengths and weaknesses of the program and team, and how to strategically respond. Successful behaviors and actions required for each phase of incident response are explored in the book. Straight from NIST 800-61, these actions include:Planning and practicing\nDetection\nContainment\nEradication\nPost-incident actionsWhat You’ll LearnKnow the sub-categories of the NIST Cybersecurity Framework\nUnderstand the components of incident response\nGo beyond the incident response plan\nTurn the plan into a program that needs vision, leadership, and culture to make it successful\nBe effective in your role on the incident response teamWho This Book Is For\nCybersecurity leaders, executives, consultants, and entry-level professionals responsible for executing the incident response plan when something goes wrong",
    "name": "Cybersecurity Incident Response",
    "category": "Security"
  },
  {
    "author": "Jacob G. Oakley",
    "pages": 210,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2019/03/Professional-Red-Teaming.jpg",
    "download_link_epub": "http://file.allitebooks.com/20190309/Professional Red Teaming.epub",
    "ISBN": "1484243080",
    "download_link_pdf": "http://file.allitebooks.com/20190309/Professional Red Teaming.pdf",
    "year": "2019",
    "language": "English",
    "price": 59,
    "description": "Use this unique book to leverage technology when conducting offensive security engagements. You will understand practical tradecraft, operational guidelines, and offensive security best practices as carrying out professional cybersecurity engagements is more than exploiting computers, executing scripts, or utilizing tools.\nProfessional Red Teaming introduces you to foundational offensive security concepts. The importance of assessments and ethical hacking is highlighted, and automated assessment technologies are addressed. The state of modern offensive security is discussed in terms of the unique challenges present in professional red teaming.\nBest practices and operational tradecraft are covered so you feel comfortable in the shaping and carrying out of red team engagements. Anecdotes from actual operations and example scenarios illustrate key concepts and cement a practical understanding of the red team process.\nYou also are introduced to counter advanced persistent threat red teaming (CAPTR teaming). This is a reverse red teaming methodology aimed at specifically addressing the challenges faced from advanced persistent threats (APTs) by the organizations they target and the offensive security professionals trying to mitigate them.\nWhat You’ll LearnUnderstand the challenges faced by offensive security assessments\nIncorporate or conduct red teaming to better mitigate cyber threats\nInitiate a successful engagement\nGet introduced to counter-APT red teaming (CAPTR)\nEvaluate offensive security processesWho This Book Is For\nOffensive security assessors and those who want a working knowledge of the process, its challenges, and its benefits. Current professionals will gain tradecraft and operational insight and non-technical readers will gain a high-level perspective of what it means to provide and be a customer of red team assessments.",
    "name": "Professional Red Teaming",
    "category": "Security"
  },
  {
    "author": "Richard Caetano",
    "pages": 236,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2019/03/Learning-Bitcoin-400x493.jpg",
    "download_link_epub": "http://file.allitebooks.com/20190308/Learning Bitcoin.epub",
    "ISBN": "1785287303",
    "download_link_pdf": "http://file.allitebooks.com/20190308/Learning Bitcoin.pdf",
    "year": "2015",
    "language": "English",
    "price": 179,
    "description": "The financial crisis of 2008 raised attention to the need for transparency and accountability in the financial world. As banks and governments were scrambling to stay solvent while seeking a sustainable plan, a powerfully new and resilient technology emerged.\nBitcoin, built on a fundamentally new technology called “The Blockchain,” offered the promise of a new financial system where transactions are sent directly between two parties without the need for central control.\nBitcoin exists as an open and transparent financial system without banks, governments, or corporate support. Simply put, Bitcoin is “programmable money” that has the potential to change the world on the same scale as the Internet itself.\nThis book arms you with immense knowledge of Bitcoin and helps you implement the technology in your money matters, enabling secure transactions.\nWe first walk through the fundamentals of Bitcoin, illustrate how the technology works, and exemplify how to interact with this powerful and new financial technology. You will learn how to set up your online Bitcoin wallet, indulge in buying and selling of bitcoins, and manage their storage. We then get to grips with the most powerful algorithm of all times: the Blockchain, and learn how crypto-currencies can reduce the risk of fraud for e-commerce merchants and consumers.\nWith a solid base of Blockchain, you will write and execute your own custom transactions. Most importantly, you will be able to protect and secure your Bitcoin with the help of effective solutions provided in the book. Packed with plenty of screenshots, Learning Bitcoin is a simple and painless guide to working with Bitcoin.\nAbout This BookSet up your own wallet, buy and sell Bitcoin, and execute custom transactions on the Blockchain\nLeverage the power of Bitcoin to reduce transaction costs and eliminate fraud\nA practical step-by-step guide to break down the Bitcoin technology to ensure safe transactionsWho This Book Is For\nIf you are familiar with online banking and want to expand your finances into a resilient and transparent currency, this book is ideal for you. A basic understanding of online wallets and financial systems will be highly beneficial to unravel the mysteries of Bitcoin.\nWhat You Will LearnSet up your wallet and buy a Bitcoin in a flash while understanding the basics of addresses and transactions\nAcquire the knack of buying, selling, and trading Bitcoins with online marketplaces\nSecure and protect your Bitcoins from online theft using Brainwallets and cold storage\nUnderstand how Bitcoin s underlying technology, the Blockchain, works with simple illustrations and explanations\nConfigure your own Bitcoin node and execute common operations on the network\nDiscover various aspects of mining Bitcoin and how to set up your own mining rig\nDive deeper into Bitcoin and write scripts and multi-signature transactions on the network\nExplore the various alt-coins and get to know how to compare them and their value",
    "name": "Learning Bitcoin",
    "category": "Software"
  },
  {
    "author": "Ric Messier",
    "pages": 402,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2018/07/Learning-Kali-Linux.jpg",
    "download_link_epub": "http://file.allitebooks.com/20180724/Learning Kali Linux.epub",
    "ISBN": "149202869X",
    "download_link_pdf": null,
    "year": "2018",
    "language": "English",
    "price": 108,
    "description": "With more than 600 security tools in its arsenal, the Kali Linux distribution can be overwhelming. Experienced and aspiring security professionals alike may find it challenging to select the most appropriate tool for conducting a given test. This practical book covers Kali’s expansive security capabilities and helps you identify the tools you need to conduct a wide range of security tests and penetration tests. You’ll also explore the vulnerabilities that make those tests necessary.\nAuthor Ric Messier takes you through the foundations of Kali Linux and explains methods for conducting tests on networks, web applications, wireless security, password vulnerability, and more. You’ll discover different techniques for extending Kali tools and creating your own toolset.Learn tools for stress testing network stacks and applications\nPerform network reconnaissance to determine what’s available to attackers\nExecute penetration tests using automated exploit tools such as Metasploit\nUse cracking tools to see if passwords meet complexity requirements\nTest wireless capabilities by injecting frames and cracking passwords\nAssess web application vulnerabilities with automated or proxy-based tools\nCreate advanced attack techniques by extending Kali tools or developing your own\nUse Kali Linux to generate reports once testing is complete",
    "name": "Learning Kali Linux",
    "category": "Security"
  },
  {
    "author": "Darril Gibson",
    "pages": 560,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2018/08/CompTIA-Security-.jpg",
    "download_link_epub": null,
    "ISBN": "1939136024",
    "download_link_pdf": "http://file.allitebooks.com/20180823/CompTIA Security Get Certified Get Ahead SY0-401 Study Guide.pdf",
    "year": "2014",
    "language": "English",
    "price": 120,
    "description": "The CompTIA Security+ Get Certified Get Ahead SY0-401 Study Guide is an update to the top-selling SY0-201 and SY0-301 study guides, which have helped thousands of readers pass the exam the first time they took it.\nAfter a comprehensive review by ProCert Labs, the SY0-401 version has been certified as CompTIA Approved Quality Content (CAQC) and covers every aspect of the SY0-401 exam. It includes the same elements readers raved about in the previous two versions. Each of the eleven chapters presents topics in an easy to understand manner and includes real-world examples of security principles in action. The author uses many of the same analogies and explanations he’s honed in the classroom that have helped hundreds of students master the Security+ content.\nYou’ll understand the important and relevant security topics for the Security+ exam, without being overloaded with unnecessary details. Additionally, each chapter includes a comprehensive review section to help you focus on what’s important.\nOver 400 realistic practice test questions with in-depth explanations will help you test your comprehension and readiness for the exam. The book includes a 100 question pre-test, a 100 question post-test, and practice test questions at the end of every chapter. Each practice test question includes a detailed explanation to help you understand the content and the reasoning behind the question. You’ll be ready to take and pass the exam the first time you take it.\nIf you plan to pursue any of the advanced security certifications, this guide will also help you lay a solid foundation of security knowledge. Learn this material, and you’ll be a step ahead for other exams. This SY0-401 study guide is for any IT or security professional interested in advancing in their field, and a must read for anyone striving to master the basics of IT systems security.",
    "name": "CompTIA Security+: Get Certified Get Ahead: SY0-401 Study Guide",
    "category": "Security"
  },
  {
    "author": "Al Sweigart",
    "pages": 416,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2018/07/untitled-378x500.png",
    "download_link_epub": "http://file.allitebooks.com/20180725/Cracking Codes with Python.epub",
    "ISBN": "1593278225",
    "download_link_pdf": null,
    "year": "2018",
    "language": "English",
    "price": 128,
    "description": "Learn how to program in Python while making and breaking ciphers—algorithms used to create and send secret messages!\nAfter a crash course in Python programming basics, you’ll learn to make, test, and hack programs that encrypt text with classical ciphers like the transposition cipher and Vigenère cipher. You’ll begin with simple programs for the reverse and Caesar ciphers and then work your way up to public key cryptography, the type of encryption used to secure today’s online transactions, including digital signatures, email, and Bitcoin.\nEach program includes the full code and a line-by-line explanation of how things work. By the end of the book, you’ll have learned how to code in Python and you’ll have the clever programs to prove it!\nYou’ll also learn how to:Combine loops, variables, and flow control statements into real working programs<br />Use dictionary files to instantly detect whether decrypted messages are valid English or gibberish<br />Create test programs to make sure that your code encrypts and decrypts correctly<br />Code (and hack!) a working example of the affine cipher, which uses modular arithmetic to encrypt a message<br />Break ciphers with techniques such as brute-force and frequency analysis\nThere’s no better way to learn to code than to play with real programs. Cracking Codes with Pythonmakes the learning fun!",
    "name": "Cracking Codes with Python",
    "category": "Security"
  },
  {
    "author": "Eric Butow",
    "pages": 160,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2018/08/Pro-iOS-Security-and-Forensics.jpg",
    "download_link_epub": "http://file.allitebooks.com/20180806/Pro iOS Security and Forensics.epub",
    "ISBN": "1484237560",
    "download_link_pdf": "http://file.allitebooks.com/20180806/Pro iOS Security and Forensics.pdf",
    "year": "201",
    "language": "English",
    "price": 181,
    "description": "Examine how to keep iOS devices safe in the physical world, including creating company policies for iPhones; assessing and defending against cyber vulnerabilities and attacks; working with preinstalled as well as third party tools; and strategies for keeping your data safe including backing up and screen locks.Managing and maintaining iPhones and iPads in a corporate or other business environment inherently requires strict attention to security concerns. Managers and IT professionals need to know how to create and communicate business policies for using iOS devices in the workplace, and implement security and forensics tools to manage and protect them.The iPhone and iPad are both widely used across businesses from Fortune 500 companies down to garage start-ups. All of these devices must have secure and monitorable ways to connect to the internet, store and transmit data without leaks, and even be managed in the event of a physical theft. Pro iOS Security and Forensics covers all these concerns as well as also offering tips for communicating with employees about the policies your business puts in place, why those policies are important, and how to follow them.What You ll LearnReview communicating policies and requirements for use of iPhones\nKeep your iPhone safe in the physical world\nConnect to the Internet securely\nExplore strategies for keeping your data safe including backing up and screen locksWho This Book Is ForManagers and IT professionals working in a business environment with iPhones and iPads.",
    "name": "Pro iOS Security and Forensics",
    "category": "iOS"
  },
  {
    "author": "Scott J. Roberts",
    "pages": 284,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2018/06/Intelligence-Driven-Incident-Response.jpg",
    "download_link_epub": null,
    "ISBN": "1491934948",
    "download_link_pdf": "http://file.allitebooks.com/20180620/Intelligence-Driven Incident Response.pdf",
    "year": "2017",
    "language": "English",
    "price": 123,
    "description": "Using a well-conceived incident response plan in the aftermath of an online security breach enables your team to identify attackers and learn how they operate. But, only when you approach incident response with a cyber threat intelligence mindset will you truly understand the value of that information. With this practical guide, you’ll learn the fundamentals of intelligence analysis, as well as the best ways to incorporate these techniques into your incident response process.\nEach method reinforces the other: threat intelligence supports and augments incident response, while incident response generates useful threat intelligence. This book helps incident managers, malware analysts, reverse engineers, digital forensics specialists, and intelligence analysts understand, implement, and benefit from this relationship.\nIn three parts, this in-depth book includes:The fundamentals: get an introduction to cyber threat intelligence, the intelligence process, the incident-response process, and how they all work together\nPractical application: walk through the intelligence-driven incident response (IDIR) process using the F3EAD process—Find, Fix Finish, Exploit, Analyze, and Disseminate\nThe way forward: explore big-picture aspects of IDIR that go beyond individual incident-response investigations, including intelligence team building",
    "name": "Intelligence-Driven Incident Response",
    "category": "Security"
  },
  {
    "author": "Rami Hijazi",
    "pages": 354,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2018/07/Open-Source-Intelligence-Methods-and-Tools.jpg",
    "download_link_epub": null,
    "ISBN": "1484232127",
    "download_link_pdf": "http://file.allitebooks.com/20180702/Open Source Intelligence Methods and Tools.pdf",
    "year": "2018",
    "language": "English",
    "price": 115,
    "description": "Apply Open Source Intelligence (OSINT) techniques, methods, and tools to acquire information from publicly available online sources to support your intelligence analysis. Use the harvested data in different scenarios such as financial, crime, and terrorism investigations as well as performing business competition analysis and acquiring intelligence about individuals and other entities. This book will also improve your skills to acquire information online from both the regular Internet as well as the hidden web through its two sub-layers: the deep web and the dark web.The author includes many OSINT resources that can be used by intelligence agencies as well as by enterprises to monitor trends on a global level, identify risks, and gather competitor intelligence so more effective decisions can be made. You will discover techniques, methods, and tools that are equally used by hackers and penetration testers to gather intelligence about a specific target online. And you will be aware of how OSINT resources can be used in conducting social engineering attacks.Open Source Intelligence Methods and Tools takes a practical approach and lists hundreds of OSINT resources that can be used to gather intelligence from online public sources. The book also covers how to anonymize your digital identity online so you can conduct your searching activities without revealing your identity.What You’ll LearnIdentify intelligence needs and leverage a broad range of tools and sources to improve data collection, analysis, and decision making in your organization\nUse OSINT resources to protect individuals and enterprises by discovering data that is online, exposed, and sensitive and hide the data before it is revealed by outside attackers\nGather corporate intelligence about business competitors and predict future market directions\nConduct advanced searches to gather intelligence from social media sites such as Facebook and Twitter\nUnderstand the different layers that make up the Internet and how to search within the invisible web which contains both the deep and the dark websWho This Book Is For\nPenetration testers, digital forensics investigators, intelligence services, military, law enforcement, UN agencies, and for-profit/non-profit enterprises",
    "name": "Open Source Intelligence Methods and Tools",
    "category": "Security"
  },
  {
    "author": "Eric C. Thompson",
    "pages": 297,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/11/Building-a-HIPAA-Compliant-Cybersecurity-Program.jpg",
    "download_link_epub": null,
    "ISBN": "1484230590",
    "download_link_pdf": "http://file.allitebooks.com/20171113/Building a HIPAA-Compliant Cybersecurity Program.pdf",
    "year": "2017",
    "language": "English",
    "price": 128,
    "description": "Use this book to learn how to conduct a timely and thorough Risk Analysis and Assessment documenting all risks to the confidentiality, integrity, and availability of electronic Protected Health Information (ePHI), which is a key component of the HIPAA Security Rule. The requirement is a focus area for the Department of Health and Human Services (HHS) Office for Civil Rights (OCR) during breach investigations and compliance audits. This book lays out a plan for healthcare organizations of all types to successfully comply with these requirements and use the output to build upon the cybersecurity program.\nWith the proliferation of cybersecurity breaches, the number of healthcare providers, payers, and business associates investigated by the OCR has risen significantly. It is not unusual for additional penalties to be levied when victims of breaches cannot demonstrate that an enterprise-wide risk assessment exists, comprehensive enough to document all of the risks to ePHI.\nWhy is it that so many covered entities and business associates fail to comply with this fundamental safeguard? Building a HIPAA Compliant Cybersecurity Program cuts through the confusion and ambiguity of regulatory requirements and provides detailed guidance to help readers:Understand and document all known instances where patient data exist\nKnow what regulators want and expect from the risk analysis process\nAssess and analyze the level of severity that each risk poses to ePHI\nFocus on the beneficial outcomes of the process: understanding real risks, and optimizing deployment of resources and alignment with business objectivesWhat You’ll LearnUse NIST 800-30 to execute a risk analysis and assessment, which meets the expectations of regulators such as the Office for Civil Rights (OCR)\nUnderstand why this is not just a compliance exercise, but a way to take back control of protecting ePHI\nLeverage the risk analysis process to improve your cybersecurity program\nKnow the value of integrating technical assessments to further define risk management activities\nEmploy an iterative process that continuously assesses the environment to identify improvement opportunitiesWho This Book Is For\nCybersecurity, privacy, and compliance professionals working for organizations responsible for creating, maintaining, storing, and protecting patient information",
    "name": "Building a HIPAA-Compliant Cybersecurity Program",
    "category": "Security"
  },
  {
    "author": "Morey J. Haber",
    "pages": 371,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2018/06/Asset-Attack-Vectors.jpg",
    "download_link_epub": null,
    "ISBN": "1484236262",
    "download_link_pdf": "http://file.allitebooks.com/20180616/Asset Attack Vectors.pdf",
    "year": "2018",
    "language": "English",
    "price": 80,
    "description": "Build an effective vulnerability management strategy to protect your organization’s assets, applications, and data.\nToday’s network environments are dynamic, requiring multiple defenses to mitigate vulnerabilities and stop data breaches. In the modern enterprise, everything connected to the network is a target. Attack surfaces are rapidly expanding to include not only traditional servers and desktops, but also routers, printers, cameras, and other IOT devices. It doesn’t matter whether an organization uses LAN, WAN, wireless, or even a modern PAN―savvy criminals have more potential entry points than ever before. To stay ahead of these threats, IT and security leaders must be aware of exposures and understand their potential impact.\nAsset Attack Vectors will help you build a vulnerability management program designed to work in the modern threat environment. Drawing on years of combined experience, the authors detail the latest techniques for threat analysis, risk measurement, and regulatory reporting. They also outline practical service level agreements (SLAs) for vulnerability management and patch management.\nVulnerability management needs to be more than a compliance check box; it should be the foundation of your organization’s cybersecurity strategy. Read Asset Attack Vectors to get ahead of threats and protect your organization with an effective asset protection strategy.\nWhat You’ll LearnCreate comprehensive assessment and risk identification policies and procedures\nImplement a complete vulnerability management workflow in nine easy steps\nUnderstand the implications of active, dormant, and carrier vulnerability states\nDevelop, deploy, and maintain custom and commercial vulnerability management programs\nDiscover the best strategies for vulnerability remediation, mitigation, and removal\nAutomate credentialed scans that leverage least-privilege access principles\nRead real-world case studies that share successful strategies and reveal potential pitfallsWho This Book Is For\nNew and intermediate security management professionals, auditors, and information technology staff looking to build an effective vulnerability management program and defend against asset based cyberattacks",
    "name": "Asset Attack Vectors",
    "category": "Security"
  },
  {
    "author": "Emmett Dulaney",
    "pages": 512,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2018/03/CompTIA-Security-Study-Guide.jpg",
    "download_link_epub": null,
    "ISBN": "1119416876",
    "download_link_pdf": "http://file.allitebooks.com/20180309/CompTIA CySA+ Practice Tests.pdf",
    "year": "2018",
    "language": "English",
    "price": 128,
    "description": "Some copies of CompTIA Security+ Study Guide: Exam SY0-501 (9781119416876) were printed without discount exam vouchers in the front of the books. If you did not receive a discount exam voucher with your book, please visit http://media.wiley.com/product_ancillary/5X/11194168/DOWNLOAD/CompTIA_Coupon.pdf to download one.\nExpert preparation covering 100% of Security+ exam SY0-501 objectives\nCompTIA Security+ Study Guide, Seventh Edition offers invaluable preparation for Exam SY0-501. Written by an expert author team, this book covers 100% of the exam objectives with clear, concise explanation. You ll learn how to handle threats, attacks, and vulnerabilities using industry-standard tools and technologies, while understanding the role of architecture and design. From everyday tasks like identity and access management to complex topics like risk management and cryptography, this study guide helps you consolidate your knowledge base in preparation for the Security+ exam. Practical examples illustrate how these processes play out in real-world scenarios, allowing you to immediately translate essential concepts to on-the-job application. You also gain access to the Sybex online learning environment, which features a robust toolkit for more thorough prep: flashcards, glossary of key terms, practice questions, and a pre-assessment exam equip you with everything you need to enter the exam confident in your skill set.\nThis study guide is approved and endorsed by CompTIA, and has been fully updated to align with the latest version of the exam.Master essential security technologies, tools, and tasks\nUnderstand how Security+ concepts are applied in the real world\nStudy on the go with electronic flashcards and more\nTest your knowledge along the way with hundreds of practice questionsTo an employer, the CompTIA Security+ certification proves that you have the knowledge base and skill set to secure applications, devices, and networks; analyze and respond to threats; participate in risk mitigation, and so much more. As data threats loom larger every day, the demand for qualified security professionals will only continue to grow. If you re ready to take the first step toward a rewarding career, CompTIA Security+ Study Guide, Seventh Edition is the ideal companion for thorough exam preparation.",
    "name": "CompTIA CySA+ Practice Tests",
    "category": "Security"
  },
  {
    "author": "Neelesh Ajmani",
    "pages": 168,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2018/06/Achieving-and-Sustaining-Secured-Business-Operations.jpg",
    "download_link_epub": null,
    "ISBN": "1484230981",
    "download_link_pdf": "http://file.allitebooks.com/20180601/Achieving and Sustaining Secured Business Operations.pdf",
    "year": "2018",
    "language": "English",
    "price": 157,
    "description": "<div class=\"row book-top\">\n<div class=\"col-md-9\">\n<div class=\"info\">Proactively plan and manage innovation in your business while keeping operations safe and secure. This book provides a framework and practices to help you safeguard customer information, prevent unauthorized access, and protect your brand and assets.Securing company operations is a board-level discussion. Across all industries, companies are pouring millions of dollars into taming cybercrime and other related security crime. Achieving and Sustaining Secured Business Operations presents a holistic approach looking top down, bottom up, and sideways. The end goal is to achieve and sustain a safe environment to conduct secured business operations while continuously innovating for competitive advantage.",
    "name": "Achieving and Sustaining Secured Business Operations",
    "category": "Security"
  },
  {
    "author": "Jonathan Peterson",
    "pages": 336,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/10/Social-Security-For-Dummies-3rd-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "1119375738",
    "download_link_pdf": "http://file.allitebooks.com/20171015/Social Security For Dummies, 3rd Edition.pdf",
    "year": "2017",
    "language": "English",
    "price": 199,
    "description": "Make sure you get the benefits you ve earned\nNavigate your way around the complex system with ease\nIncorporate Social Security into your financial planYour Social Security safety net\nSocial Security exists to give us peace of mind, yet most of us spend sleepless nights anxious about our finances as we move on to the next phase of life. Luckily, this easy-to-access guide takes the worry out of navigating the complex Social Security system, offering the sound, trusted guidance you need to ensure you re getting the most out of your benefits. In no time, it gives you a clear understanding of when and how to apply so you can rest easy knowing that you and your family are getting the benefits you ve earned.\nInside…Get advice on when to start collecting\nProtect your dependents\nFile for benefits\nManage the appeals process\nGet the paperwork right\nHelp a loved one apply\nDecipher disability benefits\nFind out how Social Security and Medicare work together",
    "name": "Social Security For Dummies, 3rd Edition",
    "category": "Security"
  },
  {
    "author": "Andreas M. Antonopoulos",
    "pages": 408,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/08/Mastering-Bitcoin-2nd-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "1491954388",
    "download_link_pdf": "http://file.allitebooks.com/20170829/Mastering Bitcoin, 2nd Edition.pdf",
    "year": "2017",
    "language": "English",
    "price": 37,
    "description": "Join the technological revolution that s taking the world of finance by storm. Mastering Bitcoin is your guide through the seemingly complex world of bitcoin, providing the knowledge you need to participate in the internet of money. Whether you re building the next killer app, investing in a startup, or simply curious about the technology, this revised and expanded second edition provides essential detail to get you started.<br />\nBitcoin, the first successful decentralized digital currency, is still in its early stages and yet it s already spawned a multi-billion dollar global economy. This economy is open to anyone with the knowledge and passion to participate. Mastering Bitcoin provides the knowledge. You simply supply the passion.<br />\nThe second edition includes:A broad introduction to bitcoin ideal for non-technical users, investors, and business executives\nAn explanation of the technical foundations of bitcoin and cryptographic currencies for developers, engineers, and software and systems architects\nDetails of the bitcoin decentralized network, peer-to-peer architecture, transaction lifecycle, and security principles\nNew developments such as Segregated Witness, Payment Channels, and Lightning Network\nImproved explanations of keys, addresses and wallets\nUser stories, analogies, examples, and code snippets illustrating key technical concepts",
    "name": "Mastering Bitcoin, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Richard Boddington",
    "pages": 372,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/04/Practical-Digital-Forensics-400x493.jpg",
    "download_link_epub": null,
    "ISBN": "1785887106",
    "download_link_pdf": "http://file.allitebooks.com/20170428/Practical Digital Forensics.pdf",
    "year": "2016",
    "language": "English",
    "price": 189,
    "description": "Digital Forensics is a methodology which includes using various tools, techniques, and programming language. This book will get you started with digital forensics and then follow on to preparing investigation plan and preparing toolkit for investigation.\nIn this book you will explore new and promising forensic processes and tools based on ‘disruptive technologythat offer experienced and budding practitioners the means to regain control of their caseloads. During the course of the book, you will get to know about the technical side of digital forensics and various tools that are needed to perform digital forensics. This book will begin with giving a quick insight into the nature of digital evidence, where it is located and how it can be recovered and forensically examined to assist investigators. This book will take you through a series of chapters that look at the nature and circumstances of digital forensic examinations and explains the processes of evidence recovery and preservation from a range of digital devices, including mobile phones, and other media. This book has a range of case studies and simulations will allow you to apply the knowledge of the theory gained to real-life situations.\nBy the end of this book you will have gained a sound insight into digital forensics and its key components.\nWhat You Will LearnGain familiarity with a range of different digital devices and operating and application systems that store digital evidence.\nAppreciate and understand the function and capability of forensic processes and tools to locate and recover digital evidence.\nDevelop an understanding of the critical importance of recovering digital evidence in pristine condition and ensuring its safe handling from seizure to tendering it in evidence in court.\nRecognise the attributes of digital evidence and where it may be hidden and is often located on a range of digital devices.\nUnderstand the importance and challenge of digital evidence analysis and how it can assist investigations and court cases.\nExplore emerging technologies and processes that empower forensic practitioners and other stakeholders to harness digital evidence more effectively.",
    "name": "Practical Digital Forensics",
    "category": "Security"
  },
  {
    "author": "Drew Van Dure",
    "pages": 336,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/05/Practical-Internet-of-Things-Security-400x493.jpg",
    "download_link_epub": null,
    "ISBN": "178588963X",
    "download_link_pdf": "http://file.allitebooks.com/20170513/Practical Internet of Things Security.pdf",
    "year": "2016",
    "language": "English",
    "price": 36,
    "description": "With the advent of Intenret of Things (IoT), businesses will be faced with defending against new types of threats. The business ecosystem now includes cloud computing infrastructure, mobile and fixed endpoints that open up new attack surfaces, a desire to share information with many stakeholders and a need to take action quickly based on large quantities of collected data. . It therefore becomes critical to ensure that cyber security threats are contained to a minimum when implementing new IoT services and solutions. . The interconnectivity of people, devices, and companies raises stakes to a new level as computing and action become even more mobile, everything becomes connected to the cloud, and infrastructure is strained to securely manage the billions of devices that will connect us all to the IoT. This book shows you how to implement cyber-security solutions, IoT design best practices and risk mitigation methodologies to address device and infrastructure threats to IoT solutions.\nThis book will take readers on a journey that begins with understanding the IoT and how it can be applied in various industries, goes on to describe the security challenges associated with the IoT, and then provides a set of guidelines to architect and deploy a secure IoT in your Enterprise. The book will showcase how the IoT is implemented in early-adopting industries and describe how lessons can be learned and shared across diverse industries to support a secure IoT.\nWho This Book Is For\nThis book targets IT Security Professionals and Security Engineers (including pentesters, security architects and ethical hackers) who would like to ensure security of their organization s data when connected through the IoT. Business analysts and managers will also find it useful.\nWhat You Will LearnLearn how to break down cross-industry barriers by adopting the best practices for IoT deployments\nBuild a rock-solid security program for IoT that is cost-effective and easy to maintain\nDemystify complex topics such as cryptography, privacy, and penetration testing to improve your security posture\nSee how the selection of individual components can affect the security posture of the entire system\nUse Systems Security Engineering and Privacy-by-design principles to design a secure IoT ecosystem\nGet to know how to leverage the burdgening cloud-based systems that will support the IoT into the future.",
    "name": "Practical Internet of Things Security",
    "category": "Security"
  },
  {
    "author": "Nanda Nachimuthu",
    "pages": 164,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/10/Spring-Security-Essentials-400x493.jpg",
    "download_link_epub": null,
    "ISBN": "178528262X",
    "download_link_pdf": "http://file.allitebooks.com/20171007/Spring Security Essentials.pdf",
    "year": "2016",
    "language": "English",
    "price": 65,
    "description": "Spring Security is a framework that focuses on providing both authentication and authorization to Java applications. Like all Spring projects, the real power of Spring Security is how easily it can be extended to meet custom requirements. The popularity of the Spring framework is increasing and the security package of Spring addresses vast mechanisms of Security in a rich way. Due to an increasing number of applications for various business needs, the integration of multiple applications is becoming inevitable. The standard security procedures available across multiple implementations in Spring will protect vulnerable applications that are open to larger public and private audiences.\nSpring Security Essentials focuses on the need to master the security layer, which is an area not often explored by a Spring developer.\nAt the beginning, we ll introduce various industry standard security mechanisms and the practical ways to integrate with them. We will also teach you about some up-to-date use cases such as building a security layer for RESTful web services and applications.\nThe IDEs used and security servers involved are briefly explained, including the steps to install them. Many sample projects are also provided to help you practice your newly developed skills. Step-by-step instructions will help you master the security layer integration with the Server, then implement the experience gained from this book in your own real-time application.\nWho This Book Is For\nIf you are a developer who is familiar with Spring and you are looking to explore its security features, then this book is for you. All beginners and experienced users will benefit from this book since it is explores both the theory and practical usage in detail.\nWhat You Will LearnSee industry standard security implementations in action\nUnderstand the principles of security servers, concepts, installation, and integration\nUse Spring Extensions for various security mechanisms\nGet to grips with the internals of the tools and servers involved in the security layer\nWork through practical projects and working programs\nCompare different security servers and techniques\nUse the sample projects in practical, real-time applications\nGet further readings and guidance on advanced security mechanisms",
    "name": "Spring Security Essentials",
    "category": "Security"
  },
  {
    "author": "Prasenjit Sarkar",
    "pages": 114,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/06/VMware-vCloud-Security-400x494.jpg",
    "download_link_epub": null,
    "ISBN": "1782170960",
    "download_link_pdf": "http://file.allitebooks.com/20170617/VMware vCloud Security.pdf",
    "year": "2013",
    "language": "English",
    "price": 74,
    "description": "VMware vCloud Security provides the reader with in depth knowledge and practical exercises sufficient to implement a secured private cloud using VMware vCloud Director and vCloud Networking and Security. This book is primarily for technical professionals with system administration and security administration skills with significant VMware vCloud experience who want to learn about advanced concepts of vCloud security and compliance.",
    "name": "VMware vCloud Security",
    "category": "Security"
  },
  {
    "author": "Soufiane Tahiri",
    "pages": 318,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/04/Mastering-Mobile-Forensics-400x493.jpg",
    "download_link_epub": null,
    "ISBN": "1785287818",
    "download_link_pdf": "http://file.allitebooks.com/20170426/Mastering Mobile Forensics.pdf",
    "year": "2016",
    "language": "English",
    "price": 82,
    "description": "Mobile forensics presents a real challenge to the forensic community due to the fast and unstoppable changes in technology. This book aims to provide the forensic community an in-depth insight into mobile forensic techniques when it comes to deal with recent smartphones operating systems\nStarting with a brief overview of forensic strategies and investigation procedures, you will understand the concepts of file carving, GPS analysis, and string analyzing. You will also see the difference between encryption, encoding, and hashing methods and get to grips with the fundamentals of reverse code engineering. Next, the book will walk you through the iOS, Android and Windows Phone architectures and filesystem, followed by showing you various forensic approaches and data gathering techniques.\nYou will also explore advanced forensic techniques and find out how to deal with third-applications using case studies. The book will help you master data acquisition on Windows Phone 8. By the end of this book, you will be acquainted with best practices and the different models used in mobile forensics.\nWhat you will learnUnderstand the mobile forensics process model and get guidelines on mobile device forensics\nAcquire in-depth knowledge about smartphone acquisition and acquisition methods\nGain a solid understanding of the architecture of operating systems, file formats, and mobile phone internal memory\nExplore the topics of of mobile security, data leak, and evidence recovery\nDive into advanced topics such as GPS analysis, file carving, encryption, encoding, unpacking, and decompiling mobile application processes",
    "name": "Mastering Mobile Forensics",
    "category": "Security"
  },
  {
    "author": "M. L. Srinivasan",
    "pages": 402,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/05/CISSP-in-21-Days-Second-Edition-400x493.jpg",
    "download_link_epub": null,
    "ISBN": "1785884492",
    "download_link_pdf": "http://file.allitebooks.com/20170523/CISSP in 21 Days, Second Edition.pdf",
    "year": "2016",
    "language": "English",
    "price": 89,
    "description": "Certified Information Systems Security Professional (CISSP) is an internationally recognized and coveted qualification. Success in this respected exam opens the door to your dream job as a security expert with an eye-catching salary. But passing the final exam is challenging. This happens when they cover everything but do not revise properly and hence lack confidence.\nThis simple yet informative book provides concise explanations of important concepts in all 10 domains of the CISSP Common Body of Knowledge (CBK). This book will take you through the final weeks before the exam with a day-by-day plan covering all of the exam topics. It will build your confidence and enable you to crack the Gold Standard exam, knowing that you have done all you can to prepare for the big day. This book is not a replacement for full study guides; instead, it builds on and re-emphasizes concepts learned from them.\nWhat You Will LearnReview Exam Cram and Practice review questions to reinforce the required concepts\nFollow the day-by-day plan to revise important concepts a month before the CISSP® exam\nBoost your time management for the exam by attempting the mock question paper\nDevelop a structured study plan for all 10 CISSP® domains\nBuild your understanding of myriad concepts in the information security domain\nPractice the full-blown mock test to evaluate your knowledge and exam preparation",
    "name": "CISSP in 21 Days, Second Edition",
    "category": "Security"
  },
  {
    "author": "Kevin Beaver",
    "pages": 408,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/05/Hacking-For-Dummies-3rd-Edition-400x500.jpg",
    "download_link_epub": null,
    "ISBN": "0470550937",
    "download_link_pdf": "http://file.allitebooks.com/20170518/Hacking For Dummies, 3rd Edition.pdf",
    "year": "2010",
    "language": "English",
    "price": 63,
    "description": "A new edition of the bestselling guide-now updated to cover the latest hacks and how to prevent them!\nIt s bad enough when a hack occurs-stealing identities, bank accounts, and personal information. But when the hack could have been prevented by taking basic security measures-like the ones described in this book-somehow that makes a bad situation even worse. This beginner guide to hacking examines some of the best security measures that exist and has been updated to cover the latest hacks for Windows 7 and the newest version of Linux.\nOffering increased coverage of Web application hacks, database hacks, VoIP hacks, and mobile computing hacks, this guide addresses a wide range of vulnerabilities and how to identify and prevent them. Plus, you ll examine why ethical hacking is oftentimes the only way to find security flaws, which can then prevent any future malicious attacks.Explores the malicious hackers s mindset so that you can counteract or avoid attacks completely\nCovers developing strategies for reporting vulnerabilities, managing security changes, and putting anti-hacking policies and procedures in place\nCompletely updated to examine the latest hacks to Windows 7 and the newest version of Linux\nExplains ethical hacking and why it is essentialHacking For Dummies, 3rd Edition shows you how to put all the necessary security measures in place so that you avoid becoming a victim of malicious hacking.",
    "name": "Hacking For Dummies, 3rd Edition",
    "category": "Security"
  },
  {
    "author": "Rami Hijazi",
    "pages": 284,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/07/Digital-Privacy-and-Security-Using-Windows.jpg",
    "download_link_epub": null,
    "ISBN": "1484227980",
    "download_link_pdf": "http://file.allitebooks.com/20170708/Digital Privacy and Security Using Windows.pdf",
    "year": "201",
    "language": "English",
    "price": 32,
    "description": "Use this hands-on guide to understand the ever growing and complex world of digital security. Learn how to protect yourself from digital crime, secure your communications, and become anonymous online using sophisticated yet practical tools and techniques.\nThis book teaches you how to secure your online identity and personal devices, encrypt your digital data and online communications, protect cloud data and Internet of Things (IoT), mitigate social engineering attacks, keep your purchases secret, and conceal your digital footprint. You will understand best practices to harden your operating system and delete digital traces using the most widely used operating system, Windows.\nDigital Privacy and Security Using Windows offers a comprehensive list of practical digital privacy tutorials in addition to being a complete repository of free online resources and tools assembled in one place. The book helps you build a robust defense from electronic crime and corporate surveillance. It covers general principles of digital privacy and how to configure and use various security applications to maintain your privacy, such as TOR, VPN, and BitLocker. You will learn to encrypt email communications using Gpg4win and Thunderbird.\nWhat You’ll LearnKnow the various parties interested in having your private data\nDifferentiate between government and corporate surveillance, and the motivations behind each one\nUnderstand how online tracking works technically\nProtect digital data, secure online communications, and become anonymous online\nCover and destroy your digital traces using Windows OS\nSecure your data in transit and at rest\nBe aware of cyber security risks and countermeasuresWho This Book Is For\nEnd users, information security professionals, management, infosec students",
    "name": "Digital Privacy and Security Using Windows",
    "category": "Security"
  },
  {
    "author": "Marvin Waschke",
    "pages": 240,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/01/Personal-Cybersecurity.jpg",
    "download_link_epub": null,
    "ISBN": "1484224299",
    "download_link_pdf": "http://file.allitebooks.com/20170114/Personal Cybersecurity.pdf",
    "year": "2017",
    "language": "English",
    "price": 59,
    "description": "Discover the most prevalent cyber threats against individual users of all kinds of computing devices. This book teaches you the defensive best practices and state-of-the-art tools available to you to repel each kind of threat.\nPersonal Cybersecurity addresses the needs of individual users at work and at home. This book covers personal cybersecurity for all modes of personal computing whether on consumer-acquired or company-issued devices: desktop PCs, laptops, mobile devices, smart TVs, WiFi and Bluetooth peripherals, and IoT objects embedded with network-connected sensors. In all these modes, the frequency, intensity, and sophistication of cyberattacks that put individual users at risk are increasing in step with accelerating mutation rates of malware and cybercriminal delivery systems.\nTraditional anti-virus software and personal firewalls no longer suffice to guarantee personal security. Users who neglect to learn and adopt the new ways of protecting themselves in their work and private environments put themselves, their associates, and their companies at risk of inconvenience, violation, reputational damage, data corruption, data theft, system degradation, system destruction, financial harm, and criminal disaster. This book shows what actions to take to limit the harm and recover from the damage.\nInstead of laying down a code ofthou shalt notrules that admit of too many exceptions and contingencies to be of much practical use, cloud expert Marvin Waschke equips you with the battlefield intelligence, strategic understanding, survival training, and proven tools you need to intelligently assess the security threats in your environment and most effectively secure yourself from attacks. Through instructive examples and scenarios, the author shows you how to adapt and apply best practices to your own particular circumstances, how to automate and routinize your personal cybersecurity, how to recognize security breaches and act swiftly to seal them, and how to recover losses and restore functionality when attacks succeed.\nWhat You ll LearnDiscover how computer security works and what it can protect us from\nSee how a typical hacker attack worksEvaluate computer security threats to the individual user and corporate systemsIdentify the critical vulnerabilities of a computer connected to the Internet\nManage your computer to reduce vulnerabilities to yourself and your employer\nDiscover how the adoption of newer forms of biometric authentication affects you\nStop your router and other online devices from being co-opted into disruptive denial of service attacksWho This Book Is ForProficient and technically knowledgeable computer users who are anxious about cybercrime and want to understand the technology behind both attack and defense but do not want to go so far as to become security experts. Some of this audience will be purely home users, but many will be executives, technical managers, developers, and members of IT departments who need to adopt personal practices for their own safety and the protection of corporate systems. Many will want to impart good cybersecurity practices to their colleagues. IT departments tasked with indoctrinating their users with good safety practices may use the book as training material.",
    "name": "Personal Cybersecurity",
    "category": "Security"
  },
  {
    "author": "Darril Gibson",
    "pages": 480,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/10/SSCP-Systems-Security-Certified-Practitioner-All-in-One-Exam-Guide-2nd-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "1259583074",
    "download_link_pdf": "http://file.allitebooks.com/20161005/SSCP Systems Security Certified Practitioner All-in-One Exam Guide, 2nd Edition.pdf",
    "year": "2015",
    "language": "English",
    "price": 174,
    "description": "This fully-updated, integrated self-study system offers complete coverage of the revised 2015 Systems Security Certified Practitioner (SSCP) exam domains\nThoroughly revised for the April 2015 exam update, SSCP Systems Security Certified Practitioner All-in-One Exam Guide, Second Edition enables you to take the exam with complete confidence. To aid in self-study, each chapter includes Exam Tips that highlight key exam information, chapter summaries that reinforce salient points, and end-of-chapter questions that are an accurate reflection of the content and question format of the real exam.\nBeyond exam prep, the practical examples and real-world insights offered in this guide make it an ideal on-the-job reference for IT security professionals. You will learn the security concepts, tools, and procedures needed to employ and enforce solid security policies and effectively react to security incidents.Features 100% coverage of the revised SSCP Common Body of Knowledge (CBK), effective April 2015\nCD-ROM contains two full-length, customizable practice exams in the Total Tester exam engine and a searchable PDF copy of the book\nWritten by a bestselling IT security certification and training expert",
    "name": "SSCP Systems Security Certified Practitioner All-in-One Exam Guide, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Swarup Bhunia",
    "pages": 351,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/01/Hardware-IP-Security-and-Trust.jpg",
    "download_link_epub": null,
    "ISBN": "3319490249",
    "download_link_pdf": "http://file.allitebooks.com/20170105/Hardware IP Security and Trust.pdf",
    "year": "2017",
    "language": "English",
    "price": 161,
    "description": "This book provides an overview of current Intellectual Property (IP) based System-on-Chip (SoC) design methodology and highlights how security of IP can be compromised at various stages in the overall SoC design-fabrication-deployment cycle. Readers will gain a comprehensive understanding of the security vulnerabilities of different types of IPs. This book would enable readers to overcome these vulnerabilities through an efficient combination of proactive countermeasures and design-for-security solutions, as well as a wide variety of IP security and trust assessment and validation techniques. This book serves as a single-source of reference for system designers and practitioners for designing secure, reliable and trustworthy SoCs.",
    "name": "Hardware IP Security and Trust",
    "category": "Security"
  },
  {
    "author": "Belen Cruz Zapata",
    "pages": 162,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/11/Testing-and-Securing-Android-Studio-Applications-400x493.jpg",
    "download_link_epub": null,
    "ISBN": "1783988800",
    "download_link_pdf": "http://file.allitebooks.com/20161108/Testing and Securing Android Studio Applications.pdf",
    "year": "2014",
    "language": "English",
    "price": 74,
    "description": "Today, mobile applications are increasingly being used to access the Web. Mobile developers play a key role in how consumers access the Web with millions of people depending on them to create secure and functional applications. This book, beginning with the fundamentals of Android security, will guide you through the process of creating a secure and debugged application. We will look at the Android Studio development environment and take you through the steps needed to protect your local data and secure your network communications.\nInitially covering the threats, risks, and vulnerabilities in software and in the Android environment, this book will then dig deeper, exploring different types of authentication methods that can be adopted in your Android application. You will be introduced to techniques and classes to test your application, before finally learning about supporting tools that will help you to improve your application.\nBy the end of this book, your Android application will be debugged and secure and you will be able to apply what you ve learned to further application projects.\nWhat You Will LearnControl the execution of your Android application by working with the debugging environment in Android Studio\nMitigate the existing vulnerabilities in Android applications\nCreate unit tests to verify the state and behavior of an activity\nUse local storage and encryption appropriately to preserve the privacy of your application data\nEnsure that communications between your applications and external servers are safe by protecting network connections\nChoose the appropriate authentication method for your Android application\nSet up the test environment to create test cases\nCreate functional tests to check the interaction between components",
    "name": "Testing and Securing Android Studio Applications",
    "category": "Security"
  },
  {
    "author": "Shon Harris",
    "pages": 1456,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/09/CISSP-All-in-One-Exam-Guide-7th-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "0071849270",
    "download_link_pdf": "http://file.allitebooks.com/20160919/CISSP All-in-One Exam Guide, 7th Edition.pdf",
    "year": "2016",
    "language": "English",
    "price": 64,
    "description": "A fully revised edition of the #1 CISSP training resource\nThoroughly updated for the latest release of the Certified Information Systems Security Professional exam, this comprehensive resource covers all exam domains, as well as the new 2015 CISSP Common Body of Knowledge developed by the International Information Systems Security Certification Consortium (ISC)<sup>2®</sup>. CISSP All-in-One Exam Guide, Seventh Edition features learning objectives at the beginning of each chapter, exam tips, practice questions, and in-depth explanations. Written by leading experts in IT security certification and training, this completely up-to-date self-study system helps you pass the exam with ease and also serves as an essential on-the-job reference.\nCovers all 8 CISSP domains:Security and risk management\nAsset security\nSecurity engineering\nCommunication and network security\nIdentity and access management\nSecurity assessment and testing\nSecurity operations\nSoftware development security",
    "name": "CISSP All-in-One Exam Guide, 7th Edition",
    "category": "Certification"
  },
  {
    "author": "Robert Svensson",
    "pages": 190,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/11/From-Hacking-to-Report-Writing.jpg",
    "download_link_epub": null,
    "ISBN": "1484222822",
    "download_link_pdf": "http://file.allitebooks.com/20161108/From Hacking to Report Writing.pdf",
    "year": "2016",
    "language": "English",
    "price": 54,
    "description": "This book will teach you everything you need to know to become a professional security and penetration tester. It simplifies hands-on security and penetration testing by breaking down each step of the process so that finding vulnerabilities and misconfigurations becomes easy. The book explains how to methodically locate, exploit, and professionally report security weaknesses using techniques such as SQL-injection, denial-of-service attacks, and password hacking.\nAlthough From Hacking to Report Writing will give you the technical know-how needed to carry out advanced security tests, it also offers insight into crafting professional looking reports describing your work and how your customers can benefit from it. The book will give you the tools you need to clearly communicate the benefits of high-quality security and penetration testing to IT-management, executives and other stakeholders.\nEmbedded in the book are a number of on-the-job stories that will give you a good understanding of how you can apply what you have learned to real-world situations.\nWe live in a time where computer security is more important than ever. Staying one step ahead of hackers has never been a bigger challenge. From Hacking to Report Writing clarifies how you can sleep better at night knowing that your network has been thoroughly tested.\nWhat you’ll learnClearly understand why security and penetration testing is important.\nHow to find vulnerabilities in any system using the same techniques as hackers do.\nWrite professional looking reports.\nKnow which security and penetration testing method to apply for any given situation.\nHow to successfully hold together a security and penetration test project.",
    "name": "From Hacking to Report Writing",
    "category": "Security"
  },
  {
    "author": "Malcolm W. Harkins",
    "pages": 186,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/09/Managing-Risk-and-Information-Security.jpg",
    "download_link_epub": null,
    "ISBN": "1484214560",
    "download_link_pdf": "http://file.allitebooks.com/20160902/Managing Risk and Information Security.pdf",
    "year": "2016",
    "language": "English",
    "price": 71,
    "description": "This updated version describes, at a high level, the evolving enterprise security landscape and provides guidance for a management-level audience about how to manage and survive risk. While based primarily on the author’s experience and insights at major companies where he has served as CISO and CSPO, the book also includes many examples from other well-known companies.\nManaging Risk and Information Security provides thought leadership in the increasingly important area of enterprise information risk and security. It describes the changing risk environment and why a fresh approach to information security is needed. Because almost every aspect of an enterprise is now dependent on technology not only for internal operations but increasing as a part of product or service creation, the focus of IT security must shift from locking down assets to enabling the business while managing and surviving risk.\nThis edition discusses business risk from a broader perspective, including privacy and regulatory considerations. It describes the increasing number of threats and vulnerabilities and offers strategies for developing solutions. These include discussions of how enterprises can take advantage of new and emerging technologies―such as social media and the huge proliferation of Internet-enabled devices―while minimizing risk.\nWhat You ll LearnLearn how enterprise risk and security requirements are changing, and why a new approach to risk and security management is needed\nLearn how people perceive risk and the effects it has on information security\nLearn why different perceptions of risk within an organization matters, and why it is necessary to understand and reconcile these views\nLearn the principles of enterprise information security governance and decision-making, and the other groups they need to need to work with\nLearn the impact of new technologies on information security, and gain insights into how to safely enable the use of new technologies",
    "name": "Managing Risk and Information Security",
    "category": "Security"
  },
  {
    "author": "Fernando Carbone",
    "pages": 110,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/12/Computer-Forensics-with-FTK-400x493.jpg",
    "download_link_epub": null,
    "ISBN": "1783559020",
    "download_link_pdf": "http://file.allitebooks.com/20161202/Computer Forensics with FTK.pdf",
    "year": "2014",
    "language": "English",
    "price": 126,
    "description": "With the increase of electronic crimes and the need to constantly audit the proper use of resources, companies need qualified professionals and appropriate tools to carry out these activities. The FTK platform, with the ability to collect and analyze digital evidence quickly and with integrity, is a great solution to help professionals achieve these goals. It is extremely useful for conducting digital investigations, helping you conduct a thorough investigation through a single tool and ensure the integrity of evidence. It is hard to find technical information on this tool and that s where this book will come in handy, helping professionals perform their activities with greater excellence.\nThis tutorial leads by example, providing you with everything you need to use FTK and the tools included such as FTK Imager, Registry View, and PRTK in order to enhance your Computer Forensics knowledge in an easier and more efficient way.\nYou will be introduced to the background of Computer Forensics, which include the types of digital devices that can be acquired and how to prepare for a new case of investigation. You will become acquainted with the FTK architecture and learn how to leverage its features in order to help you find the evidence as fast as possible. Through this book, you will also learn the memory forensics technique using the memory dump feature of FTK Imager. Furthermore, you will learn how to extract some important information such as process and DLL information, Sockets, and Driver List Open Handles.\nTo conclude your tutorial, you will learn how to extract information from Windows Registry and how to recover passwords from the system and files. You will find this book an invaluable supplement to teach you all the steps required for the completion of investigations on digital media and to generate consistent and irrefutable evidence in court.",
    "name": "Computer Forensics with FTK",
    "category": "Security"
  },
  {
    "author": "Josh Datko",
    "pages": 162,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2017/04/BeagleBone-for-Secret-Agents-400x493.jpg",
    "download_link_epub": null,
    "ISBN": "1783986042",
    "download_link_pdf": "http://file.allitebooks.com/20170407/BeagleBone for Secret Agents.pdf",
    "year": "2014",
    "language": "English",
    "price": 164,
    "description": "The BeagleBone Black is a small but powerful low-powered computer that can be used to protect personal secrets and enable privacy enhancing technologies. With increasing concerns over Internet surveillance, you can combine time-tested open source security software with the small form factor of the BeagleBone Black to create custom personal security applications.\nStarting with an introduction to development with the BeagleBone Black, we ll show you how to use the BeagleBone to create custom hardware projects involving security and privacy. Each chapter provides the history and background of each technology with a self-contained and practical project. You ll explore devices such as a fingerprint scanner and the Trusted Platform Module on the CryptoCape while learning about authentication and encryption. Filled with projects that utilize security tools used by journalists, activists, and government agents, this book shows you how to apply these tools with a BeagleBone Black.\nWhat You Will LearnBuild a complete BeagleBone development environment with Emacs and modern Emacs extensions\nUnderstand how Tor protects Internet privacy and how to run a Tor bridge\nAdd custom hardware to the BeagleBone s I2C, serial, GPIO, and analog to digital interfaces\nGain insight into the BeagleBone cape ecosystem by exploring the design of the CryptoCape\nUse a Trusted Platform Module to protect your GPG keys\nBuild an Off-the-Record chat gateway\nDevelop and analyze threat models for security-related projects",
    "name": "BeagleBone for Secret Agents",
    "category": "Security"
  },
  {
    "author": "Luis Ayala",
    "pages": 156,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/09/Cybersecurity-for-Hospitals-and-Healthcare-Facilities.jpg",
    "download_link_epub": null,
    "ISBN": "1484221540",
    "download_link_pdf": "http://file.allitebooks.com/20160911/Cybersecurity for Hospitals and Healthcare Facilities.pdf",
    "year": "2016",
    "language": "English",
    "price": 35,
    "description": "This book is a wake-up call explaining how to detect and prevent the hacking of medical equipment at hospitals and healthcare facilities. The vulnerability of the medical equipment inside the hospital to cyber-attacks far eclipses the actual building equipment. A cyber-physical attack on building equipment pales in comparison to the damage a determined hacker can do if he/she gains access to a medical grade network. A medical grade network controls the diagnostic, treatment and life support equipment on which lives depend.\nRecent news reports how hackers struck hospitals with ransomware that prevented staff from accessing patient records or scheduling appointments. Unfortunately, medical equipment can also be hacked and shut down remotely as a form of extortion. Criminal hackers will not ask for a $500 payment to unlock an MRI, PET, CT Scan, or X-Ray machine—they will ask for much more.\nLitigation is bound to follow and the resulting punitive awards will drive up hospital insurance costs and healthcare costs in general. This will undoubtedly result in increased regulations for hospitals and higher costs for compliance. Unless hospitals and other healthcare facilities take the steps necessary now to secure their medical grade networks, they will be targeted for cyber-physical attack, possibly with life-threatening consequences.\nCybersecurity for Hospitals and Healthcare Facilities shows what hackers can do, why hackers would target a hospital, the way they research a target, ways they can gain access to a medical grade network (cyber-attack vectors), and ways they hope to monetize their cyber-attack. By understanding and detecting the threats, hospital administrators can take action now – before their hospital becomes the next victim.\nTable of Contents\nChapter 1: Hacker Reconnaissance of a Hospital Network<br />\nChapter 2: How Hackers Gain Access to a Healthcare Facility or Hospital Network<br />\nChapter 3: Active Medical Device Cyber-Attacks<br />\nChapter 4: Medical Facility Cyber-Physical Attacks<br />\nChapter 5: Hospital Insider Threat<br />\nChapter 6: Detection of Cyber-Attacks<br />\nChapter 7: Preventing Cyber-Attacks<br />\nChapter 8: Cyber-Attack Response and Recovery Planning<br />\nChapter 9: Appendix. Cyber-Attack Response Procedures Template",
    "name": "Cybersecurity for Hospitals and Healthcare Facilities",
    "category": "Security"
  },
  {
    "author": "Jeremy Wittkop",
    "pages": 220,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1470/0857a4a913b181e.jpg",
    "download_link_epub": null,
    "ISBN": "1484220528",
    "download_link_pdf": "http://file.allitebooks.com/20160805/Building a Comprehensive IT Security Program.pdf",
    "year": "2016",
    "language": "English",
    "price": 110,
    "description": "This book explains the ongoing war between private business and cyber criminals, state-sponsored attackers, terrorists, and hacktivist groups. Further, it explores the risks posed by trusted employees that put critical information at risk through malice, negligence, or simply making a mistake. It clarifies the historical context of the current situation as it relates to cybersecurity, the challenges facing private business, and the fundamental changes organizations can make to better protect themselves. The problems we face are difficult, but they are not hopeless.\nCybercrime continues to grow at an astounding rate. With constant coverage of cyber-attacks in the media, there is no shortage of awareness of increasing threats. Budgets have increased and executives are implementing stronger defenses. Nonetheless, breaches continue to increase in frequency and scope.\nBuilding a Comprehensive IT Security Program shares why organizations continue to fail to secure their critical information assets and explains the internal and external adversaries facing organizations today. This book supplies the necessary knowledge and skills to protect organizations better in the future by implementing a comprehensive approach to security.\nJeremy Wittkop’s security expertise and critical experience provides insights into topics such as:Who is attempting to steal information and why?\nWhat are critical information assets?\nHow are effective programs built?\nHow is stolen information capitalized?\nHow do we shift the paradigm to better protect our organizations?\nHow we can make the cyber world safer for everyone to do business?",
    "name": "Building a Comprehensive IT Security Program",
    "category": "Security"
  },
  {
    "author": "Daniel W Dieterle",
    "pages": 494,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/05/Intermediate-Security-Testing-with-Kali-Linux-2.jpg",
    "download_link_epub": null,
    "ISBN": "1516945867",
    "download_link_pdf": "http://file.allitebooks.com/20160509/Intermediate Security Testing with Kali Linux 2.pdf",
    "year": "2015",
    "language": "English",
    "price": 193,
    "description": "With computer hacking attacks making headline news on a frequent occasion, learning ethical hacking has become a priority for those tasked with defending their networks. But in the sea of training material it is hard to find effectual training using the latest tools and techniques. In “Intermediate Security Testing with Kali Linux 2”, you will learn how hackers find out information about your systems, locate weaknesses in your security and how they gain access to your devices.\nThis hands-on, step by step learning book doesn’t dwell on the theory of security, but instead walks you through implementing and using the latest security tools that are included in the most popular computer security testing platform, Kali Linux 2.\nThis book takes off were my first Basic book ends, showing you what has changed in the latest version of Kali Linux. We then cover putting together a penetration testing lab using Windows and Linux based systems.\nNext we cover in-depth ways to use Metasploit, by seeing the latest techniques to create backdoor shells and bypassing anti-virus. We also cover automating Metasploit, including scripting based attacks using both Railgun and PowerShell.\nIn the web application section we cover many of the tools and techniques used against websites. Over 30 tools are covered ranging from scanning to exploiting, including the ever popular BurpSuite.\nIn the Attacking Smart Devices section we will see how to create virtual phones or tablets, getting remote shells on Android devices and how Wi-Fi and Man-in-The Middle attacks work against smart devices.\nLastly, the book has an entire section of using computer security tools for forensics, an Internet of Things section and an entire chapter devoted to defending your systems.",
    "name": "Intermediate Security Testing with Kali Linux 2",
    "category": "Security"
  },
  {
    "author": "Jeffrey Carr",
    "pages": 316,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1468/185789582613a0d.jpeg",
    "download_link_epub": null,
    "ISBN": "1449310044",
    "download_link_pdf": "http://file.allitebooks.com/20160715/Inside Cyber Warfare, 2nd Edition.pdf",
    "year": "2011",
    "language": "English",
    "price": 118,
    "description": "When the Stuxnet computer worm damaged the Iranian nuclear program in 2010, the public got a small glimpse into modern cyber warfare—without truly realizing the scope of this global conflict. Inside Cyber Warfare provides fascinating and disturbing details on how nations, groups, and individuals throughout the world increasingly rely on Internet attacks to gain military, political, and economic advantages over their adversaries.\nThis updated second edition takes a detailed look at the complex domain of cyberspace, and the players and strategies involved. You’ll discover how sophisticated hackers working on behalf of states or organized crime patiently play a high-stakes game that could target anyone, regardless of affiliation or nationality.Discover how Russian investment in social networks benefits the Kremlin\nLearn the role of social networks in fomenting revolution in the Middle East and Northern Africa\nExplore the rise of anarchist groups such as Anonymous and LulzSec\nLook inside cyber warfare capabilities of nations including China and Israel\nUnderstand how the U.S. can legally engage in covert cyber operations\nLearn how the Intellectual Property war has become the primary focus of state-sponsored cyber operations",
    "name": "Inside Cyber Warfare, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "William Stallings",
    "pages": 758,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/08/Cryptography-and-Network-Security-6th-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "0133354695",
    "download_link_pdf": "http://file.allitebooks.com/20160827/Cryptography and Network Security, 6th Edition.pdf",
    "year": "2013",
    "language": "English",
    "price": 188,
    "description": "For one-semester, undergraduate- or graduate-level courses in Cryptography, Computer Security, and Network Security. The book is suitable for self-study and so provides a solid and up-to-date tutorial. The book is also a comprehensive treatment of cryptography and network security and so is suitable as a reference for a system engineer, programmer, system manager, network manager, product marketing personnel, or system support specialist.\nA practical survey of cryptography and network security with unmatched support for instructors and students\nIn this age of universal electronic connectivity, viruses and hackers, electronic eavesdropping, and electronic fraud, security is paramount. This text provides a practical survey of both the principles and practice of cryptography and network security. First, the basic issues to be addressed by a network security capability are explored through a tutorial and survey of cryptography and network security technology. Then, the practice of network security is explored via practical applications that have been implemented and are in use today. An unparalleled support package for instructors and students ensures a successful teaching and learning experience.",
    "name": "Cryptography and Network Security, 6th Edition",
    "category": "Security"
  },
  {
    "author": "Fei Hu",
    "pages": 604,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1464/03574907225c998.jpg",
    "download_link_epub": null,
    "ISBN": "1498723187",
    "download_link_pdf": "http://file.allitebooks.com/20160528/Security and Privacy in Internet of Things (IoTs).pdf",
    "year": "2016",
    "language": "English",
    "price": 140,
    "description": "The Internet of Things (IoT) has attracted strong interest from both academia and industry. Unfortunately, it has also attracted the attention of hackers. Security and Privacy in Internet of Things (IoTs): Models, Algorithms, and Implementations brings together some of the top IoT security experts from around the world who contribute their knowledge regarding different IoT security aspects. It answers the questionHow do we use efficient algorithms, models, and implementations to cover the four important aspects of IoT security, i.e., confidentiality, authentication, integrity, and availability?",
    "name": "Security and Privacy in Internet of Things (IoTs)",
    "category": "Security"
  },
  {
    "author": "Sherri Davidoff",
    "pages": 76,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/06/Network-Forensics.jpg",
    "download_link_epub": null,
    "ISBN": "0132564718",
    "download_link_pdf": "http://file.allitebooks.com/20160607/Network Forensics.pdf",
    "year": "2012",
    "language": "English",
    "price": 89,
    "description": "“This is a must-have work for anybody in information security, digital forensics, or involved with incident handling. As we move away from traditional disk-based analysis into the interconnectivity of the cloud, Sherri and Jonathan have created a framework and roadmap that will act as a seminal work in this developing field.”\n– Dr. Craig S. Wright (GSE), Asia Pacific Director at Global Institute for Cyber Security + Research.\n“It’s like a symphony meeting an encyclopedia meeting a spy novel.”\n–Michael Ford, Corero Network Security\nOn the Internet, every action leaves a mark–in routers, firewalls, web proxies, and within network traffic itself. When a hacker breaks into a bank, or an insider smuggles secrets to a competitor, evidence of the crime is always left behind.\nLearn to recognize hackers’ tracks and uncover network-based evidence in Network Forensics: Tracking Hackers through Cyberspace. Carve suspicious email attachments from packet captures. Use flow records to track an intruder as he pivots through the network. Analyze a real-world wireless encryption-cracking attack (and then crack the key yourself). Reconstruct a suspect’s web surfing history–and cached web pages, too–from a web proxy. Uncover DNS-tunneled traffic. Dissect the Operation Aurora exploit, caught on the wire.\nThroughout the text, step-by-step case studies guide you through the analysis of network-based evidence. You can download the evidence files from the authors’ web site (lmgsecurity.com), and follow along to gain hands-on experience.\nHackers leave footprints all across the Internet. Can you find their tracks and solve the case? Pick up Network Forensics and find out.",
    "name": "Network Forensics",
    "category": "Security"
  },
  {
    "author": "Thiel",
    "pages": 296,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/08/iOS-Application-Security.jpg",
    "download_link_epub": null,
    "ISBN": "159327601X",
    "download_link_pdf": "http://file.allitebooks.com/20160817/iOS Application Security.pdf",
    "year": "2016",
    "language": "English",
    "price": 155,
    "description": "Eliminating security holes in iOS apps is critical for any developer who wants to protect their users from the bad guys. In iOS Application Security, mobile security expert David Thiel reveals common iOS coding mistakes that create serious security problems and shows you how to find and fix them.\nAfter a crash course on iOS application structure and Objective-C design patterns, you ll move on to spotting bad code and plugging the holes. You l learn about:The iOS security model and the limits of its built-in protections\nThe myriad ways sensitive data can leak into places it shouldn t, such as through the pasteboard\nHow to implement encryption with the Keychain, the Data Protection API, and CommonCryptoLegacy flaws from C that still cause problems in modern iOS applications\nPrivacy issues related to gathering user data and how to mitigate potential pitfallsDon t let your app s security leak become another headline. Whether you re looking to bolster your app s defenses or hunting bugs in other people s code, iOS Application Security will help you get the job done well.",
    "name": "iOS Application Security",
    "category": "Security"
  },
  {
    "author": "George Murphy",
    "pages": 576,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1469/635794b570e98d2.jpg",
    "download_link_epub": null,
    "ISBN": "1119059658",
    "download_link_pdf": "http://file.allitebooks.com/20160724/SSCP (ISC)2 Systems Security Certified Practitioner Official Study Guide.pdf",
    "year": "2015",
    "language": "English",
    "price": 139,
    "description": "Fully updated Study Guide for the SSCP\nThis guide prepares you for the SSCP, Systems Security Certified Practitioner certification examination by focusing on the Common Body of Knowledge (CBK) as determined by ISC<sup>2</sup> in seven high level topics. This Sybex Study Guide covers 100% of all exam objectives. You ll prepare for the exam smarter and faster with Sybex thanks to expert content, real-world practice, access to the Sybex online interactive learning environment and much more. Reinforce what you ve learned with key topic exam essentials and chapter review questions.\nAlong with the book you also get access to Sybex s superior online interactive learning environment that includes:125 question practice exam to help you identify where you need to study more. Get more than 90 percent of the answers correct, you re ready to take the certification exam.\nMore than 100 Electronic Flashcards to reinforce your learning and give you last minute test prep before the exam\nA searchable glossary in PDF to give you instant access to the key terms you need to know for the exam\nAppendix of charts, tables, typical applications, and programsCoverage of all of the exam topics in the book means you ll be ready for:Access Controls\nSecurity Operations and Administration\nRisk Identification, Monitoring and Analysis Incident Response and Recovery\nCryptography\nNetwork and Communications Security\nSystems and Application Security",
    "name": "SSCP (ISC)2 Systems Security Certified Practitioner Official Study Guide",
    "category": "Certification"
  },
  {
    "author": "Mark Stamp",
    "pages": 608,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/05/Information-Security-2nd-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "0470626399",
    "download_link_pdf": "http://file.allitebooks.com/20160522/Information Security, 2nd Edition.pdf",
    "year": "2011",
    "language": "English",
    "price": 191,
    "description": "Now updated—your expert guide to twenty-first century information security\nInformation security is a rapidly evolving field. As businesses and consumers become increasingly dependent on complex multinational information systems, it is more imperative than ever to protect the confidentiality and integrity of data. Featuring a wide array of new information on the most current security issues, this fully updated and revised edition of Information Security: Principles and Practice provides the skills and knowledge readers need to tackle any information security challenge.\nTaking a practical approach to information security by focusing on real-world examples, this book is organized around four major themes:Cryptography: classic cryptosystems, symmetric key cryptography, public key cryptography, hash functions, random numbers, information hiding, and cryptanalysis\nAccess control: authentication and authorization, password-based security, ACLs and capabilities, multilevel security and compartments, covert channels and inference control, security models such as BLP and Biba s model, firewalls, and intrusion detection systems\nProtocols: simple authentication protocols, session keys, perfect forward secrecy, timestamps, SSH, SSL, IPSec, Kerberos, WEP, and GSM\nSoftware: flaws and malware, buffer overflows, viruses and worms, malware detection, software reverse engineering, digital rights management, secure software development, and operating systems securityThis Second Edition features new discussions of relevant security topics such as the SSH and WEP protocols, practical RSA timing attacks, botnets, and security certification. New background material has been added, including a section on the Enigma cipher and coverage of the classicorange bookview of security. Also featured are a greatly expanded and upgraded set of homework problems and many new figures, tables, and graphs to illustrate and clarify complex topics and problems. A comprehensivesolutions manual is available to assist in course development.\nMinimizing theory while providing clear, accessible content, Information Security remains the premier text for students and instructors in information technology, computer science, and engineering, as well as for professionals working in these fields.",
    "name": "Information Security, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Samir Datt",
    "pages": 274,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1465/38576072abd0a41.jpg",
    "download_link_epub": null,
    "ISBN": "1782174907",
    "download_link_pdf": "http://file.allitebooks.com/20160614/Learning Network Forensics.pdf",
    "year": "2016",
    "language": "English",
    "price": 116,
    "description": "We live in a highly networked world. Every digital device―phone, tablet, or computer is connected to each other, in one way or another. In this new age of connected networks, there is network crime. Network forensics is the brave new frontier of digital investigation and information security professionals to extend their abilities to catch miscreants on the network.\nThe book starts with an introduction to the world of network forensics and investigations. You will begin by getting an understanding of how to gather both physical and virtual evidence, intercepting and analyzing network data, wireless data packets, investigating intrusions, and so on. You will further explore the technology, tools, and investigating methods using malware forensics, network tunneling, and behaviors. By the end of the book, you will gain a complete understanding of how to successfully close a case.\nWhat you will learnUnderstand Internetworking, sources of network-based evidence and other basic technical fundamentals, including the tools that will be used throughout the book\nAcquire evidence using traffic acquisition software and know how to manage and handle the evidence\nPerform packet analysis by capturing and collecting data, along with content analysis\nLocate wireless devices, as well as capturing and analyzing wireless traffic data packets\nImplement protocol analysis and content matching; acquire evidence from NIDS/NIPS\nAct upon the data and evidence gathered by being able to connect the dots and draw links between various events\nApply logging and interfaces, along with analyzing web proxies and understanding encrypted web traffic\nUse IOCs (Indicators of Compromise) and build real-world forensic solutions, dealing with malware",
    "name": "Learning Network Forensics",
    "category": "Security"
  },
  {
    "author": "Kim Schulz",
    "pages": 244,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1456/3156d0e7fa123d1.jpeg",
    "download_link_epub": null,
    "ISBN": "1849510504",
    "download_link_pdf": "http://file.allitebooks.com/20160227/Hacking Vim 7.2.pdf",
    "year": "2010",
    "language": "English",
    "price": 42,
    "description": "This book is a tutorial packed with ready-to-use hacks that give solutions for common problems faced by Vim users in their everyday life. Every chapter covers a set of recipes, each of which follows a systematic approach with a self-contained description of the task it covers, how to use it, and what you gain by using it. The minimum version of Vim required for each hack is clearly indicated. If you are a Vim user who wants to get more out of this legendary text editor, this book is for you. It focuses on making life easier for intermediate to experienced Vim users.",
    "name": "Hacking Vim 7.2",
    "category": "Security"
  },
  {
    "author": "Kevin Beaver",
    "pages": 408,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/03/Hacking-For-Dummies-5th-Edition.jpg",
    "download_link_epub": null,
    "ISBN": "1119154685",
    "download_link_pdf": "http://file.allitebooks.com/20160319/Hacking For Dummies, 5th Edition.pdf",
    "year": "2015",
    "language": "English",
    "price": 98,
    "description": "Learn to hack your own system to protect against malicious attacks from outside\nIs hacking something left up to the bad guys? Certainly not!Hacking For Dummies, 5th Editionis a fully updated resource that guides you in hacking your system to better protect your network against malicious attacks. This revised text helps you recognize any vulnerabilities that are lurking in your system, allowing you to fix them before someone else finds them. Penetration testing, vulnerability assessments, security best practices, and other aspects of ethical hacking are covered in this book, including Windows 10 hacks, Linux hacks, web application hacks, database hacks, VoIP hacks, and mobile computing hacks. Additionally, you have access to free testing tools and an appendix detailing valuable tools and resources.\nEthical hacking entails thinking like the bad guys to identify any vulnerabilities that they might find in your system and fixing them before they do. Also called penetration testing, ethical hacking is essential to keeping your system, and all of its data, secure. Understanding how to perform effective ethical hacking can improve the safety of your network. Defend your system and all of the data it holds against the latest Windows 10 and Linux hacks Develop an effective ethical hacking plan that keeps your system safe Protect your web applications, databases, laptops, and smartphones by going beyond simple hacking strategies Leverage the latest testing tools and techniques when using ethical hacking to keep your system secureHacking For Dummies, 5th Editionis a fully updated resource that guides you in hacking your own system to protect it and it will become your go-to reference when ethical hacking is on your to-do list.",
    "name": "Hacking For Dummies, 5th Edition",
    "category": "Security"
  },
  {
    "author": "Aditya Balapure",
    "pages": 294,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1455/3656beaa7fe7aef.jpg",
    "download_link_epub": null,
    "ISBN": "1782163581",
    "download_link_pdf": "http://file.allitebooks.com/20160213/Learning Metasploit Exploitation and Development.pdf",
    "year": "2013",
    "language": "English",
    "price": 122,
    "description": "Metasploit is an open source exploit framework that provides you with heaps of exploits, as well as tools to assist you in creating your own exploits. This includes the ability to generate a large range of shellcodes for different purposes and platforms that can be customized to attack your target. The recent improvements in network security mechanisms have given rise to new trends and techniques of compromising a network. This book deals with these recent trends and attack tips to compromise the weakest to the strongest of networks. Metasploit Exploitation and Development describes actual penetration testing skills and ways to penetrate and assess different types of networks.\nMetasploit Exploitation and Development is a perfect fit for hackers who want to develop some real exploitation skills. This book has been designed with a practical approach which emphasizes hands-on rather than theoretical reading. It covers all the new exploits for new operating systems and tips from the experience of real hackers. This is a best buy book for learning the art of exploitation and skills of a penetration tester.\nMetasploit Exploitation and Development is a guide to real network hacking with the best tricks to master the art of exploitation.\nThis book has been designed in well-defined stages so the reader learns more effectively. From the actual setup to vulnerability assessment, this book provides an individual with in-depth knowledge of an expert penetration tester. The book deals with vulnerability assessment exercises with some of the industrially-used tools and report-making tips. It covers topics such as client exploitation, backdoors, post exploitation, and also exploitation development with Metasploit.\nThis book has been developed with a practical hands-on approach so that readers can effectively try and test what they actually read.\nMetasploit Exploitation and Development covers the experience of real network hacking with some of the latest operating systems. The readers will go through a journey in which they will learn from basic to advanced levels of the art of exploitation.\nThis book covers real hacking and exploitation of the current vulnerabilities in some of the latest operating systems.",
    "name": "Learning Metasploit Exploitation and Development",
    "category": "Security"
  },
  {
    "author": "Omar Siliceo",
    "pages": 312,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/03/IBM-WebSphere-Application-Server-v7.0-Security.jpg",
    "download_link_epub": null,
    "ISBN": "1849681481",
    "download_link_pdf": "http://file.allitebooks.com/20160323/IBM WebSphere Application Server v7.0 Security.pdf",
    "year": "2011",
    "language": "English",
    "price": 109,
    "description": "For IBM WebSphere users, this is the complete guide to securing your applications with Java EE and JAAS security standards. From a far-ranging overview to the fundamentals of data encryption, all the essentials are here. Overview Discover the salient and new security features offered by WebSphere Application Server version 7.0 to create secure installations Explore and learn how to secure Application Servers, Java Applications, and EJB Applications along with setting up user authentication and authorization With the help of extensive hands-on exercises and mini-projects, explore the various aspects needed to produce secure IBM WebSphere Application Server Network Deployment v7.0 infrastructures A practical reference with ready-to-implement best practices and tricks for configuring, hardening, tuning, and troubleshooting secure IBM WebSphere Application Server Network Deployment v7.0 environments What you will learn from this book Create security domains using the wsadmin scripting tool Get hands-on experience working with a mini-project to protect a Java EE Application Server Secure your frontend with Secure Socket Layer Protocol and IBM HTTP Server Get to grips with user authentication and authorization by building a multi-module Enterprise Web Application; packaging, deploying, and testing it Work around to secure an EJB application by building on the existing mini-project Configure authentication and resource access (authorization) using user registry groups and application-defined roles Configure WebSphere Application Server v7.0 for SSO and LTPA and work across remote servers Explore the powerful concepts of data encryption and SSL certificates practically Practice platform hardening with respect to the Operating System, File System, and network configuration Approach With this book you will explore WebSphere Application Server security concepts, which you can expand upon while working on mini-projects.",
    "name": "IBM WebSphere Application Server v7.0 Security",
    "category": "Security"
  },
  {
    "author": "Josep Domingo-Ferrer",
    "pages": 138,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1453/5256a8087870237.jpeg",
    "download_link_epub": null,
    "ISBN": "1627058435",
    "download_link_pdf": "http://file.allitebooks.com/20160126/Database Anonymization.pdf",
    "year": "2016",
    "language": "English",
    "price": 124,
    "description": "The current social and economic context increasingly demands open data to improve scientific research and decision making. However, when published data refer to individual respondents, disclosure risk limitation techniques must be implemented to anonymize the data and guarantee by design the fundamental right to privacy of the subjects the data refer to. Disclosure risk limitation has a long record in the statistical and computer science research communities, who have developed a variety of privacy-preserving solutions for data releases. This Synthesis Lecture provides a comprehensive overview of the fundamentals of privacy in data releases focusing on the computer science perspective. Specifically, we detail the privacy models, anonymization methods, and utility and risk metrics that have been proposed so far in the literature. Besides, as a more advanced topic, we identify and discuss in detail connections between several privacy models (i.e., how to accumulate the privacy guarantees they offer to achieve more robust protection and when such guarantees are equivalent or complementary); we also explore the links between anonymization methods and privacy models (how anonymization methods can be used to enforce privacy models and thereby offer ex ante privacy guarantees). These latter topics are relevant to researchers and advanced practitioners, who will gain a deeper understanding on the available data anonymization solutions and the privacy guarantees they can offer.",
    "name": "Database Anonymization",
    "category": "Security"
  },
  {
    "author": "John K Grant",
    "pages": 200,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/05/The-Architecture-of-Privacy.jpg",
    "download_link_epub": null,
    "ISBN": "1491904011",
    "download_link_pdf": "http://file.allitebooks.com/20160501/The Architecture of Privacy.pdf",
    "year": "2015",
    "language": "English",
    "price": 109,
    "description": "Technology’s influence on privacy not only concerns consumers, political leaders, and advocacy groups, but also the software architects who design new products. In this practical guide, experts in data analytics, software engineering, security, and privacy policy describe how software teams can make privacy-protective features a core part of product functionality, rather than add them late in the development process.\nIdeal for software engineers new to privacy, this book helps you examine privacy-protective information management architectures and their foundational components—building blocks that you can combine in many ways. Policymakers, academics, students, and advocates unfamiliar with the technical terrain will learn how these tools can help drive policies to maximize privacy protection.Restrict access to data through a variety of application-level controls\nUse security architectures to avoid creating a single point of trust in your systems\nExplore federated architectures that let users retrieve and view data without compromising data security\nMaintain and analyze audit logs as part of comprehensive system oversight\nExamine case studies to learn how these building blocks help solve real problems\nUnderstand the role and responsibilities of a Privacy Engineer for maintaining your privacy architecture",
    "name": "The Architecture of Privacy",
    "category": "Security"
  },
  {
    "author": "Josh Datko",
    "pages": 162,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/03/BeagleBone-for-Secret-Agents.jpg",
    "download_link_epub": null,
    "ISBN": "1783986042",
    "download_link_pdf": "http://file.allitebooks.com/20160314/BeagleBone for Secret Agents.pdf",
    "year": "2014",
    "language": "English",
    "price": 133,
    "description": "The BeagleBone Black is a small but powerful low-powered computer that can be used to protect personal secrets and enable privacy enhancing technologies. With increasing concerns over Internet surveillance, you can combine time-tested open source security software with the small form factor of the BeagleBone Black to create custom personal security applications.\nStarting with an introduction to development with the BeagleBone Black, we ll show you how to use the BeagleBone to create custom hardware projects involving security and privacy. Each chapter provides the history and background of each technology with a self-contained and practical project. You ll explore devices such as a fingerprint scanner and the Trusted Platform Module on the CryptoCape while learning about authentication and encryption. Filled with projects that utilize security tools used by journalists, activists, and government agents, this book shows you how to apply these tools with a BeagleBone Black.",
    "name": "BeagleBone for Secret Agents",
    "category": "Security"
  },
  {
    "author": "Albert Szmigielski",
    "pages": 130,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/03/Bitcoin-Essentials.jpg",
    "download_link_epub": null,
    "ISBN": "1785281976",
    "download_link_pdf": "http://file.allitebooks.com/20160319/Bitcoin Essentials.pdf",
    "year": "2016",
    "language": "English",
    "price": 82,
    "description": "Blockchain is being billed as the technology of the future. Bitcoin is the first application of that technology. Mining is what makes it all possible. Exploring mining from a practical perspective will help you make informed decisions about your mining setup. Understanding what the future may hold for blockchains, and therefore for mining, will help you position yourself to take advantage of the impending changes.\nThis practical guide starts with an introduction to Bitcoin wallets, as well as mining hardware and software. You will move on to learn about different mining techniques using the CPU, GPU, FPGA, and ultimately the ASIC as an example. After this, you will gain an insight into solo mining and pool mining, and see the differences between the two. The book will then walk you through large-scale mining and the challenges faced during such operations. Finally, you will take a look into the future to see a world where blockchain-based applications are commonplace and mining is ubiquitous.\nWhat you will learnGet introduced to Bitcoin mining from the ground up\nFind out about mining software and the different types of mining hardware\nMaster setup techniques to enable efficient mining\nExamine the pros and cons of the different types of mining hardware\nDeduce the differences between solo and pool mining\nTake a peek into professional mining farms\nExplore the future of mining and blockchain-based applications",
    "name": "Bitcoin Essentials",
    "category": "Security"
  },
  {
    "author": "Joe Sremack",
    "pages": 264,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/04/Big-Data-Forensics-Learning-Hadoop-Investigations.jpg",
    "download_link_epub": null,
    "ISBN": "1785288105",
    "download_link_pdf": "http://file.allitebooks.com/20160426/Big Data Forensics - Learning Hadoop Investigations.pdf",
    "year": "2015",
    "language": "English",
    "price": 100,
    "description": "Big Data forensics is an important type of digital investigation that involves the identification, collection, and analysis of large-scale Big Data systems. Hadoop is one of the most popular Big Data solutions, and forensically investigating a Hadoop cluster requires specialized tools and techniques. With the explosion of Big Data, forensic investigators need to be prepared to analyze the petabytes of data stored in Hadoop clusters. Understanding Hadoop s operational structure and performing forensic analysis with court-accepted tools and best practices will help you conduct a successful investigation.\nDiscover how to perform a complete forensic investigation of large-scale Hadoop clusters using the same tools and techniques employed by forensic experts. This book begins by taking you through the process of forensic investigation and the pitfalls to avoid. It will walk you through Hadoop s internals and architecture, and you will discover what types of information Hadoop stores and how to access that data. You will learn to identify Big Data evidence using techniques to survey a live system and interview witnesses. After setting up your own Hadoop system, you will collect evidence using techniques such as forensic imaging and application-based extractions. You will analyze Hadoop evidence using advanced tools and techniques to uncover events and statistical information. Finally, data visualization and evidence presentation techniques are covered to help you properly communicate your findings to any audience.\nWhat You Will LearnUnderstand Hadoop internals and file storage\nCollect and analyze Hadoop forensic evidence\nPerform complex forensic analysis for fraud and other investigations\nUse state-of-the-art forensic tools\nConduct interviews to identify Hadoop evidence\nCreate compelling presentations of your forensic findings\nUnderstand how Big Data clusters operate\nApply advanced forensic techniques in an investigation, including file carving, statistical analysis, and more",
    "name": "Big Data Forensics &#8211; Learning Hadoop Investigations",
    "category": "Security"
  },
  {
    "author": "Cameron Buchanan",
    "pages": 243,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2016/05/Kali-Linux-CTF-Blueprints.jpg",
    "download_link_epub": null,
    "ISBN": "1783985984",
    "download_link_pdf": "http://file.allitebooks.com/20160508/Kali Linux CTF Blueprints.pdf",
    "year": "2014",
    "language": "English",
    "price": 130,
    "description": "As attackers develop more effective and complex ways to compromise computerized systems, penetration testing skills and tools are in high demand. A tester must have varied skills to combat these threats or fall behind. This book provides practical and customizable guides to set up a variety of exciting challenge projects that can then be tested with Kali Linux.\nLearn how to create, customize, and exploit penetration testing scenarios and assault courses. Start by building flawed fortresses for Windows and Linux servers, allowing your testers to exploit common and not-so-common vulnerabilities to break down the gates and storm the walls. Mimic the human element with practical examples of social engineering projects. Facilitate vulnerable wireless and mobile installations and cryptographic weaknesses, and replicate the Heartbleed vulnerability. Finally, combine your skills and work to create a full red-team assessment environment that mimics the sort of corporate network encountered in the field.\nWhat You Will LearnSet up vulnerable services for both Windows and Linux\nCreate dummy accounts for social engineering manipulation\nSet up Heartbleed replication for vulnerable SSL servers\nDevelop full-size labs to challenge current and potential testers\nConstruct scenarios that can be applied to Capture the Flag style challenges\nAdd physical components to your scenarios and fire USB missile launchers at your opponents\nChallenge your own projects with a best-practice exploit guide to each scenario",
    "name": "Kali Linux CTF Blueprints",
    "category": "Security"
  },
  {
    "author": "Chris McNab",
    "pages": 456,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1451/825686eaf862234.jpeg",
    "download_link_epub": null,
    "ISBN": "149191095X",
    "download_link_pdf": "http://file.allitebooks.com/20160101/Network Security Assessment, 3rd edition.pdf",
    "year": "2015",
    "language": "English",
    "price": 48,
    "description": "How secure is your network? The best way to find out is to attack it. Network Security Assessment provides you with the tools and techniques that professional security analysts use to identify and assess risks in government, military, and commercial networks. Armed with this book, you can work to create environments that are hardened and immune from unauthorized use and attack.\nAuthor Chris McNab demonstrates how determined adversaries map attack surface and exploit security weaknesses at both the network and application level. The third edition is a complete overhaul—grouping and detailing the latest hacking techniques used to attack enterprise networks. By categorizing individual threats, you will be able to adopt defensive strategies against entire attack classes, providing protection now and into the future.\nThe testing approaches within the book are written in-line with internationally recognized standards, including NIST SP 800-115, NSA IAM, CESG CHECK, and PCI DSS.",
    "name": "Network Security Assessment, 3rd edition",
    "category": "Security"
  },
  {
    "author": "Josiah Dykstra",
    "pages": 190,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1450/32566f4590b41e4.jpeg",
    "download_link_epub": null,
    "ISBN": "1491920947",
    "download_link_pdf": "http://file.allitebooks.com/20151214/Essential Cybersecurity Science.pdf",
    "year": "2016",
    "language": "English",
    "price": 74,
    "description": "If you’re involved in cybersecurity as a software developer, forensic investigator, or network administrator, this practical guide shows you how to apply the scientific method when assessing techniques for protecting your information systems. You’ll learn how to conduct scientific experiments on everyday tools and procedures, whether you’re evaluating corporate security systems, testing your own security product, or looking for bugs in a mobile game.\nOnce author Josiah Dykstra gets you up to speed on the scientific method, he helps you focus on standalone, domain-specific topics, such as cryptography, malware analysis, and system security engineering. The latter chapters include practical case studies that demonstrate how to use available tools to conduct domain-specific scientific experiments.Learn the steps necessary to conduct scientific experiments in cybersecurity\nExplore fuzzing to test how your software handles various inputs\nMeasure the performance of the Snort intrusion detection system\nLocate malicious “needles in a haystack” in your network and IT environment\nEvaluate cryptography design and application in IoT products\nConduct an experiment to identify relationships between similar malware binaries\nUnderstand system-level security requirements for enterprise networks and web services",
    "name": "Essential Cybersecurity Science",
    "category": "Security"
  },
  {
    "author": "Dr. Michael Spreitzenbarth",
    "pages": 192,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1451/5456898a1d1a8f5.jpeg",
    "download_link_epub": null,
    "ISBN": "1783988045",
    "download_link_pdf": "http://file.allitebooks.com/20160103/Mastering Python Forensics.pdf",
    "year": "2015",
    "language": "English",
    "price": 170,
    "description": "Digital forensic analysis is the process of examining and extracting data digitally and examining it. Python has the combination of power, expressiveness, and ease of use that makes it an essential complementary tool to the traditional, off-the-shelf digital forensic tools.\nThis book will teach you how to perform forensic analysis and investigations by exploring the capabilities of various Python libraries.\nThe book starts by explaining the building blocks of the Python programming language, especially ctypes in-depth, along with how to automate typical tasks in file system analysis, common correlation tasks to discover anomalies, as well as templates for investigations. Next, we ll show you cryptographic algorithms that can be used during forensic investigations to check for known files or to compare suspicious files with online services such as VirusTotal or Mobile-Sandbox.\nMoving on, you ll learn how to sniff on the network, generate and analyze network flows, and perform log correlation with the help of Python scripts and tools. You ll get to know about the concepts of virtualization and how virtualization influences IT forensics, and you ll discover how to perform forensic analysis of a jailbroken/rooted mobile device that is based on iOS or Android.\nFinally, the book teaches you how to analyze volatile memory and search for known malware samples based on YARA rules.",
    "name": "Mastering Python Forensics",
    "category": "Security"
  },
  {
    "author": "Mark Gregory",
    "pages": 297,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2015/12/Security-and-the-Networked-Society.jpg",
    "download_link_epub": null,
    "ISBN": "3319023896",
    "download_link_pdf": "http://file.allitebooks.com/20151218/Security and the Networked Society.pdf",
    "year": "2013",
    "language": "English",
    "price": 154,
    "description": "This book examines technological and social events during 2011 and 2012, a period that saw the rise of the hacktivist, the move to mobile platforms, and the ubiquity of social networks. It covers key technological issues such as hacking, cyber-crime, cyber-security and cyber-warfare, the internet, smart phones, electronic security, and information privacy. This book traces the rise into prominence of these issues while also exploring the resulting cultural reaction. The authors’ analysis forms the basis of a discussion on future technological directions and their potential impact on society. The book includes forewords by Professor Margaret Gardner AO, Vice-Chancellor and President of RMIT University, and by Professor Robyn Owens, Deputy Vice-Chancellor (Research) at the University of Western Australia. Security and the Networked Society provides a reference for professionals and industry analysts studying digital technologies. Advanced-level students in computer science and electrical engineering will also find this book useful as a thought-provoking resource.",
    "name": "Security and the Networked Society",
    "category": "Security"
  },
  {
    "author": "Uday veer Singh",
    "pages": 74,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2015/12/Immune-Web-What-makes-the-Internet-Safe.jpg",
    "download_link_epub": null,
    "ISBN": "1522785930",
    "download_link_pdf": "http://file.allitebooks.com/20151224/Immune Web.pdf",
    "year": "2015",
    "language": "English",
    "price": 72,
    "description": "A personalized Internet Guide to protect your from everything unsafe on 21st century Web. Covering dozens of topic from simple passwords to complex dark internet. It s the only thing you will ever need for your personal protection of your virtual briefcase.",
    "name": "Immune Web: What makes the Internet Safe?",
    "category": "Security"
  },
  {
    "author": "Monika Agarwal",
    "pages": 320,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1451/825686eb0b0b695.jpeg",
    "download_link_epub": null,
    "ISBN": "1782166785",
    "download_link_pdf": "http://file.allitebooks.com/20160101/Metasploit Penetration Testing Cookbook, Second Edition.pdf",
    "year": "2013",
    "language": "English",
    "price": 40,
    "description": "Metasploit software helps security and IT professionals identify security issues, verify vulnerability mitigations, and manage expert-driven security assessments. Capabilities include smart exploitation, password auditing, web application scanning, and social engineering. Teams can collaborate in Metasploit and present their findings in consolidated reports. The goal of the software is to provide a clear understanding of the critical vulnerabilities in any environment and to manage those risks.\nMetasploit Penetration Testing Cookbook, Second Edition contains chapters that are logically arranged with an increasing level of complexity and thoroughly covers some aspects of Metasploit, ranging from pre-exploitation to the post-exploitation phase. This book is an update from version 4.0 to version 4.5. It covers the detailed penetration testing techniques for different specializations like wireless networks, VOIP systems, and the cloud.\nMetasploit Penetration Testing Cookbook, Second Edition covers a number of topics which were not part of the first edition. You will learn how to penetrate an operating system (Windows 8 penetration testing) to the penetration of a wireless network, VoIP network, and then to cloud.\nThe book starts with the basics, such as gathering information about your target, and then develops to cover advanced topics like building your own framework scripts and modules. The book goes deep into operating-systems-based penetration testing techniques and moves ahead with client-based exploitation methodologies. In the post-exploitation phase, it covers meterpreter, antivirus bypass, ruby wonders, exploit building, porting exploits to the framework, and penetration testing, while dealing with VOIP, wireless networks, and cloud computing.\nThis book will help readers to think from a hacker s perspective to dig out the flaws in target networks and also to leverage the powers of Metasploit to compromise them. It will take your penetration skills to the next level.",
    "name": "Metasploit Penetration Testing Cookbook, Second Edition",
    "category": "Security"
  },
  {
    "author": "Masoud Kalali",
    "pages": 296,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1448/995654d144b54e4.jpeg",
    "download_link_epub": null,
    "ISBN": "1847199380",
    "download_link_pdf": "http://file.allitebooks.com/20151124/GlassFish Security.pdf",
    "year": "2010",
    "language": "English",
    "price": 43,
    "description": "Security is driven by requirement and design and we implement security on the basis of the requirements provided by analysts. In this book, we take a programmatic approach to understand Java EE and GlassFish security.You will find plenty of code samples in this book. It is easy to secure your application when you have a demonstration of a complete and working application explained in the book, isn t it? Each chapter starts with the importance and relevance of the topic by introducing some Java EE applications requirement, which will encourage you to read it further.This book is for application designers, developers and administrators who work with GlassFish and are keen to understand Java EE and GlassFish security.To take full advantage of this book, you need to be familiar with Java EE and GlassFish application servers. You will love this book if you are looking for a book that covers Java EE security and using GlassFish features to create secure Java EE applications, or to secure the GlassFish installation and operating environment and using OpenSSO.",
    "name": "GlassFish Security",
    "category": "Security"
  },
  {
    "author": "F. Garzia",
    "pages": 680,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1451/825686eafd06199.jpeg",
    "download_link_epub": null,
    "ISBN": "1845647688",
    "download_link_pdf": "http://file.allitebooks.com/20160101/Handbook of Communications Security.pdf",
    "year": "2013",
    "language": "English",
    "price": 82,
    "description": "Handbook of Communications Securitygives the reader information related to all aspects of communications security, from the fundamental concepts to the most advanced and updated. Communications represent a strategic sector for privacy protection and for personal, corporate, homeland, and international security. The interception, damage or loss of information during its communication can generate material, nonmaterial and economic damage both from a personal and a collective point of view. The book is intended for integrated system designers, telecommunication designers, system engineers, system analysts, security managers, security responsible, technicians, intelligence personnel, security personnel, police, army, private investigators, scientists, graduate and postgraduate students and all those who need to communicate in a secure way. A CD included with the book contains freeware cryptography and steganography programs.",
    "name": "Handbook of Communications Security",
    "category": "Security"
  },
  {
    "author": "Xuemin (Sherman) Shen",
    "pages": 134,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1449/25565e60c1957f5.jpeg",
    "download_link_epub": null,
    "ISBN": "3319247158",
    "download_link_pdf": "http://file.allitebooks.com/20151202/Security and Privacy for Mobile Healthcare Networks.pdf",
    "year": "2015",
    "language": "English",
    "price": 46,
    "description": "This book examines state-of-art research on designing healthcare applications with the consideration of security and privacy. It explains the Mobile Healthcare Network (MHN) architecture and its diverse applications, and reviews the existing works on security and privacy for MHNs. Critical future challenges and research problems are also identified.\nUsing a Quality-of-Protection perspective, the authors provide valuable insights on security and privacy preservation for MHNs. Some promising solutions are proposed to accommodate the issues of secure health data transmission, misbehavior detection, health data processing with privacy preservation and access control in MHNs. Specifically, the secure health data aggregation explores social spots to help forward health data and enable users to select the optimal relay according to their social ties and health data priority. The secure aggregation achieves the desirable delivery ratio with reasonable communication costs and lower delay for the data in different priorities.\nA proposed misbehavior detection scheme distinguishes Sybil attackers from normal users by comparing their mobile contacts and pseudonym changing behaviors. The detection accuracy is high enough to resist various Sybil attacks including forgery. In addition, the health data processing scheme can analyze the encrypted health data and preserve user’s privacy at the same time. Attribute based access control can achieve fine-grained acces\ns control with user-defined access policy in MHNs.<br />\nSecurity and Privacy for Mobile Healthcare Networks is designed for researchers and advanced-level students interested in healthcare security and secure data transmission.",
    "name": "Security and Privacy for Mobile Healthcare Networks",
    "category": "Security"
  },
  {
    "author": "Vyacheslav Fadyushin",
    "pages": 88,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1450/7056790132961c8.jpeg",
    "download_link_epub": null,
    "ISBN": "1849694125",
    "download_link_pdf": "http://file.allitebooks.com/20151222/Instant Penetration Testing.pdf",
    "year": "2013",
    "language": "English",
    "price": 175,
    "description": "Filled with practical, step-by-step instructions and clear explanations for the most important and useful tasks. Get the job done and learn as you go. A how-To book with practical recipes accompanied with rich screenshots for easy comprehension.This is a How-to guide, written with practicality in mind. Theory is downplayed, and we get you started doing the things you need to do, right away.Instant Penetration Testing: Setting Up a Test Lab How-tois written for beginners to penetration testing, and will guide you in avoiding the common mistakes that people new to penetration testing make.",
    "name": "Instant Penetration Testing",
    "category": "Security"
  },
  {
    "author": "Victor Marak",
    "pages": 330,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1443/0256070b8536434.jpeg",
    "download_link_epub": null,
    "ISBN": "1785281518",
    "download_link_pdf": "http://file.allitebooks.com/20150926/Windows Malware Analysis Essentials.pdf",
    "year": "2015",
    "language": "English",
    "price": 104,
    "description": "Windows OS is the most used operating system in the world and hence is targeted by malware writers. There are strong ramifications if things go awry. Things will go wrong if they can, and hence we see a salvo of attacks that have continued to disrupt the normal scheme of things in our day to day lives. This book will guide you on how to use essential tools such as debuggers, disassemblers, and sandboxes to dissect malware samples. It will expose your innards and then build a report of their indicators of compromise along with detection rule sets that will enable you to help contain the outbreak when faced with such a situation.\nWe will start with the basics of computing fundamentals such as number systems and Boolean algebra. Further, you ll learn about x86 assembly programming and its integration with high level languages such as C++.You ll understand how to decipher disassembly code obtained from the compiled source code and map it back to its original design goals.\nBy delving into end to end analysis with real-world malware samples to solidify your understanding, you ll sharpen your technique of handling destructive malware binaries and vector mechanisms. You will also be encouraged to consider analysis lab safety measures so that there is no infection in the process.\nFinally, we ll have a rounded tour of various emulations, sandboxing, and debugging options so that you know what is at your disposal when you need a specific kind of weapon in order to nullify the malware.",
    "name": "Windows Malware Analysis Essentials",
    "category": "Security"
  },
  {
    "author": "James Eldredge",
    "pages": 52,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1447/76564cd7f6d6c19.jpeg",
    "download_link_epub": null,
    "ISBN": "151719301X",
    "download_link_pdf": "http://file.allitebooks.com/20151118/Protect Your Privacy.pdf",
    "year": "2015",
    "language": "English",
    "price": 95,
    "description": "Have you ever thought about your security online? Do you ever wonder how you can stay safe on the web? If your answers to these questions were bothyesthen you need to get this book today. James Eldredge, a thirteen year computer veteran, has put together a book filled with the most essential tips, tricks andHow-To sthat every Internet user must know. Based on his personal experience in working with clients of all skill levels, James put together this book to help novice and moderately skilled computer users tackle some of the most common issues that he has seen in his work. Here s a sampling of what you ll learn fromProtect Your Privacy! :Common Ways Attackers Steal Your DataEasy Ways to Secure Your Web BrowserHow to Secure Your Passwords Against ANY AttackHow to Stay Anonymous When Browsing the WebEssential Habits You Need to Stay Safe OnlineHow to Protect Against Dangerous Software VulnerabilitiesAdvanced Data Protection MethodsAnd much more! Keeping to his philosophy of making things as simple as possible, James stripped out all unnecessary content from this book, reducing it down to the absolute essential tips and tricks and making sure that they re all in plain english, with step-by-step instructions for each one. If you re looking for a gigantic manual filled with computer jargon and hundreds of pages of instructions that you ll never read or use, don t buy this book. If you re looking for a book that covers some of the most essential information you NEED to have to stay safe online, giveProtect Your Privacy!a try. James Eldredge is a thirteen year computer technology veteran and has worked with all types of clients, from stay-at-home moms to multi-million dollar law firms. James focuses on a simple approach to troubleshooting, focusing on the smart way of troubleshooting instead of beating his head against the wall. This unique angle has gained him hundreds of happy clients and helped him build a successful consulting business that helps teach users as much as it fixes their problems.",
    "name": "Protect Your Privacy",
    "category": "Security"
  },
  {
    "author": "Pekka Neittaanmäki",
    "pages": 280,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1444/285619c1ad45d5c.jpeg",
    "download_link_epub": null,
    "ISBN": "331918301X",
    "download_link_pdf": "http://file.allitebooks.com/20151011/Cyber Security- Analytics, Technology and Automation.pdf",
    "year": "2015",
    "language": "English",
    "price": 86,
    "description": "The book, in addition to the cyber threats and technology, processes cyber security from many sides as a social phenomenon and how the implementation of the cyber security strategy is carried out.\nThe book gives a profound idea of the most spoken phenomenon of this time. The book is suitable for a wide-ranging audience from graduate to professionals/practitioners and researchers. Relevant disciplines for the book are Telecommunications / Network security, Applied mathematics / Data analysis, Mobile systems / Security, Engineering / Security of critical infrastructure and Military science / Security.",
    "name": "Cyber Security: Analytics, Technology and Automation",
    "category": "Security"
  },
  {
    "author": "Peter Mularien",
    "pages": 420,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1448/995654d1320c489.jpeg",
    "download_link_epub": null,
    "ISBN": "1847199747",
    "download_link_pdf": "http://file.allitebooks.com/20151124/Spring Security 3.pdf",
    "year": "2010",
    "language": "English",
    "price": 45,
    "description": "Security is of critical importance to all web applications. Vulnerable applications are easy prey for hackers. This book is the perfect tool for Java developers looking to repel attacks against their web applications using the proven Spring Security library to achieve this.\nA comprehensive guide to Spring Security 3. You will learn through real world business scenarios how to guard against the latest threats. You will also learn to combine Spring Security 3 with external security providers such as LDAP, OpenID, CAS, Kerberos, and Active Directory.\nThe book starts by giving an overview of security concepts and techniques, as well as setup and configuration. The book then gets you working with a JSP based web application that implements a simple e-commerce website. At this point you will progressively enhance the application giving you hands on experience implementing features of Spring Security 3 in real world business scenarios.\nThe second half of the book is devoted to common integration scenarios that you will come accross every day. At this stage you will be in a position to solve specific, complex integration problems. The book will end by showing migration from Spring Security 2 to 3.\nThis practical guide will show you how to implement Spring Security 3 and protect your applications from being breached using a combination of real world, straightforward examples.",
    "name": "Spring Security 3",
    "category": "Security"
  },
  {
    "author": "Michael Wall",
    "pages": 552,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2015/11/Accumulo.jpg",
    "download_link_epub": null,
    "ISBN": "1449374182",
    "download_link_pdf": "http://file.allitebooks.com/20151122/Accumulo.pdf",
    "year": "2015",
    "language": "English",
    "price": 58,
    "description": "Get up to speed on Apache Accumulo, the flexible, high-performance key/value store created by the National Security Agency (NSA) and based on Google’s BigTable data storage system. Written by former NSA team members, this comprehensive tutorial and reference covers Accumulo architecture, application development, table design, and cell-level security.\nWith clear information on system administration, performance tuning, and best practices, this book is ideal for developers seeking to write Accumulo applications, administrators charged with installing and maintaining Accumulo, and other professionals interested in what Accumulo has to offer. You will find everything you need to use this system fully.\nGet a high-level introduction to Accumulo’s architecture and data model<br />\nTake a rapid tour through single- and multiple-node installations, data ingest, and query<br />\nLearn how to write Accumulo applications for several use cases, based on examples<br />\nDive into Accumulo internals, including information not available in the documentation<br />\nGet detailed information for installing, administering, tuning, and measuring performance<br />\nLearn best practices based on successful implementations in the field<br />\nFind answers to common questions that every new Accumulo user asks",
    "name": "Accumulo",
    "category": "Security"
  },
  {
    "author": "Stanley Siegel",
    "pages": 536,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1444/92561f4f5639e33.jpeg",
    "download_link_epub": null,
    "ISBN": "1430260823",
    "download_link_pdf": "http://file.allitebooks.com/20151015/Enterprise Cybersecurity.pdf",
    "year": "2015",
    "language": "English",
    "price": 146,
    "description": "Enterprise Cybersecurity empowers organizations of all sizes to defend themselves with next-generation cybersecurity programs against the escalating threat of modern targeted cyberattacks. This book presents a comprehensive framework for managing all aspects of an enterprise cybersecurity program. It enables an enterprise to architect, design, implement, and operate a coherent cybersecurity program that is seamlessly coordinated with policy, programmatics, IT life cycle, and assessment.\nFail-safe cyberdefense is a pipe dream. Given sufficient time, an intelligent attacker can eventually defeat defensive measures protecting an enterprise’s computer systems and IT networks.\nTo prevail, an enterprise cybersecurity program must manage risk by detecting attacks early enough and delaying them long enough that the defenders have time to respond effectively. Enterprise Cybersecurity shows players at all levels of responsibility how to unify their organization’s people, budgets, technologies, and processes into a cost-efficient cybersecurity program capable of countering advanced cyberattacks and containing damage in the event of a breach.\nThe authors of Enterprise Cybersecurity explain at both strategic and tactical levels how to accomplish the mission of leading, designing, deploying, operating, managing, and supporting cybersecurity capabilities in an enterprise environment. The authors are recognized experts and thought leaders in this rapidly evolving field, drawing on decades of collective experience in cybersecurity and IT. In capacities ranging from executive strategist to systems architect to cybercombatant, Scott E. Donaldson, Stanley G. Siegel, Chris K. Williams, and Abdul Aslam have fought on the front lines of cybersecurity against advanced persistent threats to government, military, and business entities.",
    "name": "Enterprise Cybersecurity",
    "category": "Security"
  },
  {
    "author": "Abhinav Singh",
    "pages": 68,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1445/51562c6afe6d8d2.jpeg",
    "download_link_epub": null,
    "ISBN": "1849695660",
    "download_link_pdf": "http://file.allitebooks.com/20151025/Instant Kali Linux.pdf",
    "year": "2013",
    "language": "English",
    "price": 83,
    "description": "Kali Linux is currently the de-facto standard operating system of the security industry. It acts as a Swiss army knife and is a one-stop solution to most of the problems faced by security professionals. The availability of different open source and free tools under a single banner makes it easy and quick while dealing with security assessments.\nTeaching you how to use various tools and techniques effectively using Kali while working on real time scenarios, this concise and practical guide wastes no time, moving straight in to the core topic sand covering various important security assessment tools bundled in Kali Linux.\nBeginning with the journey through security assessments, from basic features such as information gathering to working on vulnerability assessment tools, web application pen-testing, cracking passwords, and more. The book also moves on to some advanced concepts such as exploitation frameworks and their architecture, forensic tools, and more. The book eloquently covers various levels of information security.",
    "name": "Instant Kali Linux",
    "category": "Security"
  },
  {
    "author": "Isaac Sharpe",
    "pages": 132,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1446/87563ab141575d3.jpeg",
    "download_link_epub": null,
    "ISBN": "1512300772",
    "download_link_pdf": "http://file.allitebooks.com/20151105/Hacking Basic Security, Penetration Testing and How to Hack.pdf",
    "year": "2015",
    "language": "English",
    "price": 47,
    "description": "Do You Want To Learn How to Hack? Have you always wanted to hack? Do you want to learn more about hacking? Are you interested in the basics of hacking and successful at it? This easy guide will help transform and increase your hacking skill set. You ll be excited to see your skills improve drastically and effectively whenever your hacking. Hurry! Scroll to the top andBUYyour copy today!",
    "name": "Hacking: Basic Security, Penetration Testing and How to Hack",
    "category": "Security"
  },
  {
    "author": "Stelvio Cimato",
    "pages": 545,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1445/18562d723fe9f4f.jpeg",
    "download_link_epub": null,
    "ISBN": "143983721X",
    "download_link_pdf": "http://file.allitebooks.com/20151026/Visual Cryptography and Secret Image Sharing.pdf",
    "year": "2011",
    "language": "English",
    "price": 117,
    "description": "With rapid progress in Internet and digital imaging technology, there are more and more ways to easily create, publish, and distribute images. Considered the first book to focus on the relationship between digital imaging and privacy protection, Visual Cryptography and Secret Image Sharing is a complete introduction to novel security methods and sharing-control mechanisms used to protect against unauthorized data access and secure dissemination of sensitive information.\nImage data protection and image-based authentication techniques offer efficient solutions for controlling how private data and images are made available only to select people. Essential to the design of systems used to manage images that contain sensitive data—such as medical records, financial transactions, and electronic voting systems—the methods presented in this book are useful to counter traditional encryption techniques, which do not scale well and are less efficient when applied directly to image files.\nAn exploration of the most prominent topics in digital imaging security, this book discusses:\nPotential for sharing multiple secrets<br />\nVisual cryptography schemes—based either on the probabilistic reconstruction of the secret image, or on different logical operations for combining shared images<br />\nInclusion of pictures in the distributed shares<br />\nContrast enhancement techniques<br />\nColor-image visual cryptography<br />\nCheating prevention<br />\nAlignment problems for image shares<br />\nSteganography and authentication<br />\nIn the continually evolving world of secure image sharing, a growing number of people are becoming involved as new applications and business models are being developed all the time. This contributed volume gives academicians, researchers, and professionals the insight of well-known experts on key concepts, issues, trends, and technologies in this emerging field.",
    "name": "Visual Cryptography and Secret Image Sharing",
    "category": "Security"
  },
  {
    "author": "Mano Paul",
    "pages": 800,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1445/685629a1c963ab7.jpeg",
    "download_link_epub": null,
    "ISBN": "1466571276",
    "download_link_pdf": "http://file.allitebooks.com/20151023/Official (ISC)2 Guide to the CSSLP CBK, Second Edition.pdf",
    "year": "2013",
    "language": "English",
    "price": 119,
    "description": "The text allows readers to learn about software security from a renowned security practitioner who is the appointed software assurance advisor for (ISC)2. Complete with numerous illustrations, it makes complex security concepts easy to understand and implement. In addition to being a valuable resource for those studying for the CSSLP examination, this book is also an indispensable software security reference for those already part of the certified elite. A robust and comprehensive appendix makes this book a time-saving resource for anyone involved in secure software development.",
    "name": "Official (ISC)2 Guide to the CSSLP CBK, Second Edition",
    "category": "Security"
  },
  {
    "author": "William Stallings",
    "pages": 814,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1440/9555ddbdd46f867.jpeg",
    "download_link_epub": null,
    "ISBN": "0133773922",
    "download_link_pdf": "http://file.allitebooks.com/20150826/Computer Security- Principles and Practice, 3rd Edition.pdf",
    "year": "2014",
    "language": "English",
    "price": 43,
    "description": "Computer Security: Principles and Practice, Third Edition, is ideal for courses in Computer/Network Security. It also provides a solid, up-to-date reference or self-study tutorial for system engineers, programmers, system managers, network managers, product marketing personnel, system support specialists.\nIn recent years, the need for education in computer security and related topics has grown dramatically—and is essential for anyone studying Computer Science or Computer Engineering. This is the only text available to provide integrated, comprehensive, up-to-date coverage of the broad range of topics in this subject. In addition to an extensive pedagogical program, the book provides unparalleled support for both research and modeling projects, giving students a broader perspective.\nIt covers all security topics considered Core in the EEE/ACM Computer Science Curriculum. This textbook can be used to prep for CISSP Certification, and includes in-depth coverage of Computer Security, Technology and Principles, Software Security, Management Issues, Cryptographic Algorithms, Internet Security and more.\nThe Text and Academic Authors Association named Computer Security: Principles and Practice, First Edition, the winner of the Textbook Excellence Award for the best Computer Science textbook of 2008.\nTeaching and Learning Experience<br />\nThis program presents a better teaching and learning experience—for you and your students. It will help:<br />\nEasily Integrate Projects in your Course: This book provides an unparalleled degree of support for including both research and modeling projects in your course, giving students a broader perspective.<br />\nKeep Your Course Current with Updated Technical Content: This edition covers the latest trends and developments in computer security.<br />\nEnhance Learning with Engaging Features: Extensive use of case studies and examples provides real-world context to the text material.<br />\nProvide Extensive Support Material to Instructors and Students: Student and instructor resources are available to expand on the topics presented in the text.",
    "name": "Computer Security: Principles and Practice, 3rd Edition",
    "category": "Security"
  },
  {
    "author": "Sam Washington",
    "pages": 320,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1439/7555c99aa062999.jpeg",
    "download_link_epub": null,
    "ISBN": "1784396001",
    "download_link_pdf": "http://file.allitebooks.com/20150811/Learning Python Network Programming.pdf",
    "year": "2015",
    "language": "English",
    "price": 182,
    "description": "Network programming has always been a demanding task. With full-featured and well documented libraries all the way up the stack, Python makes network programming the enjoyable experience it should be.\nStarting with a walkthrough of today s major networking protocols, with this book you ll learn how to employ Python for network programming, how to request and retrieve web resources, and how to extract data in major formats over the Web. You ll utilize Python for e-mailing using different protocols and you ll interact with remote systems and IP and DNS networking.\nAs the book progresses, socket programming will be covered, followed by how to design servers and the pros and cons of multithreaded and event-driven architectures. You ll develop practical client-side applications, including web API clients, e-mail clients, SSH, and FTP. These applications will also be implemented through existing web application frameworks.",
    "name": "Learning Python Network Programming",
    "category": "Security"
  },
  {
    "author": "Qing Li",
    "pages": 363,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2015/09/Security-Intelligence.jpg",
    "download_link_epub": null,
    "ISBN": "1118896696",
    "download_link_pdf": "http://file.allitebooks.com/20150909/Security Intelligence.pdf",
    "year": "2015",
    "language": "English",
    "price": 125,
    "description": "Similar to unraveling a math word problem, Security Intelligence: A Practitioner s Guide to Solving Enterprise Security Challenges guides you through a deciphering process that translates each security goal into a set of security variables, substitutes each variable with a specific security technology domain, formulates the equation that is the deployment strategy, then verifies the solution against the original problem by analyzing security incidents and mining hidden breaches, ultimately refines the security formula iteratively in a perpetual cycle. You will learn about: * Secure proxies the necessary extension of the endpoints * Application identification and control visualize the threats * Malnets where is the source of infection and who are the pathogens * Identify the security breach who was the victim and what was the lure * Security in Mobile computing SNAFU\nWith this book, you will be able to: * Identify the relevant solutions to secure the infrastructure * Construct policies that provide flexibility to the users so to ensure productivity * Deploy effective defenses against the ever evolving web threats * Implement solutions that are compliant to relevant rules and regulations * Offer insight to developers who are building new security solutions and products",
    "name": "Security Intelligence",
    "category": "Security"
  },
  {
    "author": "Qurban A. Memon",
    "pages": 412,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1440/3655d9cc562aa85.jpeg",
    "download_link_epub": null,
    "ISBN": "1466559578",
    "download_link_pdf": "http://file.allitebooks.com/20150823/Distributed Networks- Intelligence, Security, and Applications.pdf",
    "year": "2013",
    "language": "English",
    "price": 169,
    "description": "For many civilian, security, and military applications, distributed and networked coordination offers a more promising alternative to centralized command and control in terms of scalability, flexibility, and robustness. It also introduces its own challenges. Distributed Networks: Intelligence, Security, and Applications brings together scientific research in distributed network intelligence, security, and novel applications. The book presents recent trends and advances in the theory and applications of network intelligence and helps you understand how to successfully incorporate them into distributed systems and services.\nFeaturing contributions by leading scholars and experts from around the world, this collection covers:\nApproaches for distributed network intelligence<br />\nDistributed models for distributed enterprises, including forecasting and performance measurement models<br />\nSecurity applications for distributed enterprises, including intrusion tackling and peer-to-peer traffic detection<br />\nFuture wireless networking scenarios, including the use of software sensors instead of hardware sensors<br />\nEmerging enterprise applications and trends such as the smartOR standard and innovative concepts for human–machine interaction in the operating room<br />\nSeveral chapters use a tutorial style to emphasize the development process behind complex distributed networked systems and services, which highlights the difficulties of knowledge engineering of such systems. Delving into novel concepts, theories, and advanced technologies, this book offers inspiration for further research and development in distributed computing and networking, especially related to security solutions for distributed environments.",
    "name": "Distributed Networks: Intelligence, Security, and Applications",
    "category": "Security"
  },
  {
    "author": "Ahmed Mohamed Rafik Moustafa",
    "pages": 109,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1440/2355d811d6604b9.jpeg",
    "download_link_epub": null,
    "ISBN": "1782175539",
    "download_link_pdf": "http://file.allitebooks.com/20150822/Microsoft Dynamics AX 2012 R3 Security.pdf",
    "year": "2015",
    "language": "English",
    "price": 198,
    "description": "Microsoft Dynamics AX is an ERP software that supports multisite operations. The variety of security features in MS Dynamics AX 2012 enables stakeholders to deal with business data smoothly and securely, avoiding security threats and raising their competencies in the market.\nThis book begins by providing you with the skills to develop security policies, permissions, and privileges using the AOT and secure tables. You will learn about the MorphX security system and customizing security and access permissions. Moving on, you will discover security mechanisms at the data level in tables. You will also learn to implement various security features, leading to best practices for setting up protection around your organization s valuable assets. By going step by step through every chapter, you will learn everything you need to configure the security of Microsoft Dynamics AX 2012 R3 to match your business needs.",
    "name": "Microsoft Dynamics AX 2012 R3 Security",
    "category": "Security"
  },
  {
    "author": "Joxean Koret",
    "pages": 384,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1441/1555f1e1e52eca1.jpeg",
    "download_link_epub": null,
    "ISBN": "1119028752",
    "download_link_pdf": "http://file.allitebooks.com/20150910/The Antivirus Hacker-s Handbook.pdf",
    "year": "2015",
    "language": "English",
    "price": 183,
    "description": "Hack your antivirus software to stamp out future vulnerabilities The Antivirus Hacker s Handbook guides you through the process of reverse engineering antivirus software. You explore how to detect and exploit vulnerabilities that can be leveraged to improve future software design, protect your network, and anticipate attacks that may sneak through your antivirusline of defense. You ll begin building your knowledge by diving into the reverse engineering process, which details how to start from a finished antivirus software program and work your way back through its development using the functions and other key elements of the software. Next, you leverage your new knowledge about software development to evade, attack, and exploit antivirus software-all of which can help you strengthen your network and protect your data. While not all viruses are damaging, understanding how to better protect your computer against them can help you maintain the integrity of your network. * Discover how to reverse engineer your antivirus software * Explore methods of antivirus software evasion * Consider different ways to attack and exploit antivirus software * Understand the current state of the antivirus software market, and get recommendations for users and vendors who are leveraging this software The Antivirus Hacker s Handbook is the essential reference for software reverse engineers, penetration testers, security researchers, exploit writers, antivirus vendors, and software engineers who want to understand how to leverage current antivirus software to improve future applications.",
    "name": "The Antivirus Hacker&#8217;s Handbook",
    "category": "Security"
  },
  {
    "author": "Will Arthur",
    "pages": 375,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2015/09/A-Practical-Guide-to-TPM-2.0.jpg",
    "download_link_epub": null,
    "ISBN": "1430265833",
    "download_link_pdf": "http://file.allitebooks.com/20150909/A Practical Guide to TPM 2.0.pdf",
    "year": "2015",
    "language": "English",
    "price": 159,
    "description": "A Practical Guide to TPM 2.0: Using the Trusted Platform Module in the New Age of Security is a straight-forward primer for developers. It shows security and TPM concepts, demonstrating their use in real applications that the reader can try out.<br />\nSimply put, this book is designed to empower and excite the programming community to go out and do cool things with the TPM. The approach is to ramp the reader up quickly and keep their interest.A Practical Guide to TPM 2.0: Using the Trusted Platform Module in the New Age of Security explains security concepts, describes the TPM 2.0 architecture, and provides code and pseudo-code examples in parallel, from very simple concepts and code to highly complex concepts and pseudo-code.\nThe book includes instructions for the available execution environments and real code examples to get readers up and talking to the TPM quickly. The authors then help the users expand on that with pseudo-code descriptions of useful applications using the TPM.",
    "name": "A Practical Guide to TPM 2.0",
    "category": "Security"
  },
  {
    "author": "Susan Lincke",
    "pages": 304,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1440/2355d811ed26bef.jpeg",
    "download_link_epub": null,
    "ISBN": "3319160265",
    "download_link_pdf": "http://file.allitebooks.com/20150822/Security Planning- An Applied Approach.pdf",
    "year": "2015",
    "language": "English",
    "price": 162,
    "description": "This book guides readers through building an IT security plan. Offering a template, it helps readers to prioritize risks, conform to regulation, plan their defense and secure proprietary/confidential information. The process is documented in the supplemental online security workbook. Security Planning is designed for the busy IT practitioner, who does not have time to become a security expert, but needs a security plan now. It also serves to educate the reader of a broader set of concepts related to the security environment through the Introductory Concepts and Advanced sections. The book serves entry level cyber-security courses through those in advanced security planning. Exercises range from easier questions to the challenging case study. This is the first text with an optional semester-long case study: Students plan security for a doctor’s office, which must adhere to HIPAA regulation. For software engineering-oriented students, a chapter on secure software development introduces security extensions to UML and use cases (with case study). The text also adopts the NSA’s Center of Academic Excellence (CAE) revamped 2014 plan, addressing five mandatory and 15 Optional Knowledge Units, as well as many ACM Information Assurance and Security core and elective requirements for Computer Science.",
    "name": "Security Planning: An Applied Approach",
    "category": "Security"
  },
  {
    "author": "Peter Kim",
    "pages": 358,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1442/505601abe60c8a1.jpeg",
    "download_link_epub": null,
    "ISBN": "1512214566",
    "download_link_pdf": "http://file.allitebooks.com/20150922/The Hacker Playbook 2- Practical Guide To Penetration Testing.pdf",
    "year": "2015",
    "language": "English",
    "price": 129,
    "description": "Just as a professional athlete doesn’t show up without a solid game plan, ethical hackers, IT professionals, and security researchers should not be unprepared, either. The Hacker Playbook provides them their own game plans. Written by a longtime security professional and CEO of Secure Planet, LLC, this step-by-step guide to the “game” of penetration hacking features hands-on examples and helpful advice from the top of the field.\nThrough a series of football-style “plays,” this straightforward guide gets to the root of many of the roadblocks people may face while penetration testing—including attacking different types of networks, pivoting through security controls, privilege escalation, and evading antivirus software.\nFrom “Pregame” research to “The Drive” and “The Lateral Pass,” the practical plays listed can be read in order or referenced as needed. Either way, the valuable advice within will put you in the mindset of a penetration tester of a Fortune 500 company, regardless of your career or level of experience.\nThis second version of The Hacker Playbook takes all the bestplaysfrom the original book and incorporates the latest attacks, tools, and lessons learned. Double the content compared to its predecessor, this guide further outlines building a lab, walks through test cases for attacks, and provides more customized code.\nWhether you’re downing energy drinks while desperately looking for an exploit, or preparing for an exciting new job in IT security, this guide is an essential part of any ethical hacker’s library—so there’s no reason not to get in the game.",
    "name": "The Hacker Playbook 2: Practical Guide To Penetration Testing",
    "category": "Security"
  },
  {
    "author": "Earnest Wish",
    "pages": 266,
    "picture": "http://www.allitebooks.org/wp-content/uploads/2015/09/Python-Hacking-Essentials.jpg",
    "download_link_epub": null,
    "ISBN": "1511797568",
    "download_link_pdf": "http://file.allitebooks.com/20150909/Python Hacking Essentials.pdf",
    "year": "2015",
    "language": "English",
    "price": 47,
    "description": "This book is not for professional hackers. Instead, this book is made for beginners who have programming experience and are interested in hacking. Here, hacking techniques that can be easily understood have been described. If you only have a home PC, you can test all the examples provided here. I have included many figures that are intuitively understandable rather than a litany of explanations. Therefore, it is possible to gain some practical experience while hacking, since I have only used examples that can actually be implemented. This book is therefore necessary for ordinary people who have a curiosity of hackers and are interested in computers.",
    "name": "Python Hacking Essentials",
    "category": "Security"
  },
  {
    "author": "Conrad Barski",
    "pages": 256,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1437/0355b19cd533be5.jpeg",
    "download_link_epub": null,
    "ISBN": "1593275730",
    "download_link_pdf": "http://file.allitebooks.com/20150723/Bitcoin for the Befuddled.pdf",
    "year": "2014",
    "language": "English",
    "price": 129,
    "description": "Unless you ve been living under a rock for the last couple of years, you ve probably heard of Bitcoin-the game-changing digital currency used by millions worldwide.\nBut Bitcoin isn t just another way to buy stuff. It s an anonymous, revolutionary, cryptographically secure currency that functions without the oversight of a central authority or government. If you want to get into the Bitcoin game but find yourself a little confused, Bitcoin for the Befuddled may be just what you re looking for. Learn what Bitcoin is; how it works; and how to acquire, store, and spend bitcoins safely and securely.\nYou ll also learn:\nBitcoin s underlying cryptographic principles, and how bitcoins are created<br />\nThe history of Bitcoin and its potential impact on trade and commerce<br />\nAll about the blockchain, the public ledger of Bitcoin transactions<br />\nHow to choose a bitcoin wallet that s safe and easy to use<br />\nHow to accept bitcoins as payment in your physical store or on your website<br />\nAdvanced topics, including Bitcoin mining and Bitcoin programming<br />\nWith its non-technical language and patient, step-by-step approach to this fascinating currency, Bitcoin for the Befuddled is your ticket to getting started with Bitcoin. Get out from under the rock and get in the Bitcoin game. Just make sure not to lose your shirt.",
    "name": "Bitcoin for the Befuddled",
    "category": "Security"
  },
  {
    "author": "George Kostopoulos",
    "pages": 236,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1437/2755b0731e652e8.jpeg",
    "download_link_epub": null,
    "ISBN": "1466501332",
    "download_link_pdf": "http://file.allitebooks.com/20150722/Cyberspace and Cybersecurity.pdf",
    "year": "2012",
    "language": "English",
    "price": 198,
    "description": "English | ISBN: 1466501332 | 2012 | 236 pages | PDF | 2 MB<br />\nBased on relate\nBased on related courses and research on the cyber environment in Europe, the United States, and Asia, Cyberspace and Cybersecurity supplies complete coverage of cyberspace and cybersecurity. It not only emphasizes technologies but also pays close attention to human factors and organizational perspectives.\nDetailing guidelines for quantifying and measuring vulnerabilities, the book also explains how to avoid these vulnerabilities through secure coding. It covers organizational-related vulnerabilities, including access authorization, user authentication, and human factors in information security. Providing readers with the understanding required to build a secure enterprise, block intrusions, and handle delicate legal and ethical issues, the text:\nExamines the risks inherent in information system components, namely hardware, software, and people<br />\nExplains why asset identification should be the cornerstone of any information security strategy<br />\nIdentifies the traits a CIO must have to address cybersecurity challenges<br />\nDescribes how to ensure business continuity in the event of adverse incidents, including acts of nature<br />\nConsiders intrusion detection and prevention systems (IDPS), focusing on configurations, capabilities, selection, management, and deployment<br />\nExplaining how to secure a computer against malware and cyber attacks, the text’s wide-ranging coverage includes security analyzers, firewalls, antivirus software, file shredding, file encryption, and anti-loggers. It reviews international and U.S. federal laws and legal initiatives aimed at providing a legal infrastructure for what transpires over the Internet. The book concludes by examining the role of the U.S. Department of Homeland Security in our country’s cyber preparedness.\nExercises with solutions, updated references, electronic presentations, evaluation criteria for projects, guidelines to project preparations, and teaching suggestions are available upon qualified course adoption.\nd courses and research on the cyber environment in Europe, the United States, and Asia, Cyberspace and Cybersecurity supplies complete coverage of cyberspace and cybersecurity. It not only emphasizes technologies but also pays close attention to human factors and organizational perspectives.\nDetailing guidelines for quantifying and measuring vulnerabilities, the book also explains how to avoid these vulnerabilities through secure coding. It covers organizational-related vulnerabilities, including access authorization, user authentication, and human factors in information security. Providing readers with the understanding required to build a secure enterprise, block intrusions, and handle delicate legal and ethical issues, the text:\nExamines the risks inherent in information system components, namely hardware, software, and people<br />\nExplains why asset identification should be the cornerstone of any information security strategy<br />\nIdentifies the traits a CIO must have to address cybersecurity challenges<br />\nDescribes how to ensure business continuity in the event of adverse incidents, including acts of nature<br />\nConsiders intrusion detection and prevention systems (IDPS), focusing on configurations, capabilities, selection, management, and deployment<br />\nExplaining how to secure a computer against malware and cyber attacks, the text’s wide-ranging coverage includes security analyzers, firewalls, antivirus software, file shredding, file encryption, and anti-loggers. It reviews international and U.S. federal laws and legal initiatives aimed at providing a legal infrastructure for what transpires over the Internet. The book concludes by examining the role of the U.S. Department of Homeland Security in our country’s cyber preparedness.\nExercises with solutions, updated references, electronic presentations, evaluation criteria for projects, guidelines to project preparations, and teaching suggestions are available upon qualified course adoption.",
    "name": "Cyberspace and Cybersecurity",
    "category": "Security"
  },
  {
    "author": "Glenn Fleishman",
    "pages": 126,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1436/85559a722567a25.jpeg",
    "download_link_epub": null,
    "ISBN": "978-0991439959",
    "download_link_pdf": "http://file.allitebooks.com/20150706/A Practical Guide to Networking and Security in iOS 8.pdf",
    "year": "2015",
    "language": "English",
    "price": 111,
    "description": "This book describes how to use your iPhone, iPod touch, or iPad with iOS 8 on Wi-Fi and cellular/mobile networks securely, making connections with ease while protecting your data. It also covers Bluetooth networking, tracking an iOS device, using AirDrop and AirPlay, and solving connection problems.",
    "name": "A Practical Guide to Networking and Security in iOS 8",
    "category": "iOS"
  },
  {
    "author": "Anmol Misra",
    "pages": 280,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1436/0455a25e838378d.jpeg",
    "download_link_epub": null,
    "ISBN": "978-1439896464",
    "download_link_pdf": "http://file.allitebooks.com/20150712/Android Security- Attacks and Defenses.pdf",
    "year": "2013",
    "language": "English",
    "price": 193,
    "description": "Android Security: Attacks and Defenses is for anyone interested in learning about the strengths and weaknesses of the Android platform from a security perspective. Starting with an introduction to Android OS architecture and application programming, it will help readers get up to speed on the basics of the Android platform and its security issues.\nExplaining the Android security model and architecture, the book describes Android permissions, including Manifest permissions, to help readers analyze applications and understand permission requirements. It also rates the Android permissions based on security implications and covers JEB Decompiler.\nThe authors describe how to write Android bots in JAVA and how to use reversing tools to decompile any Android application. They also cover the Android file system, including import directories and files, so readers can perform basic forensic analysis on file system and SD cards. The book includes access to a wealth of resources on its website: www.androidinsecurity.com. It explains how to crack SecureApp.apk discussed in the text and also makes the application available on its site.\nThe book includes coverage of advanced topics such as reverse engineering and forensics, mobile device pen-testing methodology, malware analysis, secure coding, and hardening guidelines for Android. It also explains how to analyze security implications for Android mobile devices/applications and incorporate them into enterprise SDLC processes.\nThe book’s site includes a resource section where readers can access downloads for applications, tools created by users, and sample applications created by the authors under the Resource section. Readers can easily download the files and use them in conjunction with the text, wherever needed. Visit www.androidinsecurity.com for more information.",
    "name": "Android Security: Attacks and Defenses",
    "category": "Administration"
  },
  {
    "author": "Nicholas",
    "pages": 200,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1436/0455a25e791e3c2.jpeg",
    "download_link_epub": null,
    "ISBN": "978-1783263745",
    "download_link_pdf": "http://file.allitebooks.com/20150712/Data Analysis For Network Cyber-Security.pdf",
    "year": "2014",
    "language": "English",
    "price": 142,
    "description": "There is increasing pressure to protect computer networks against unauthorized intrusion, and some work in this area is concerned with engineering systems that are robust to attack. However, no system can be made invulnerable. Data Analysis for Network Cyber-Security focuses on monitoring and analyzing network traffic data, with the intention of preventing, or quickly identifying, malicious activity.<br />\nSuch work involves the intersection of statistics, data mining and computer science. Fundamentally, network traffic is relational, embodying a link between devices. As such, graph analysis approaches are a natural candidate. However, such methods do not scale well to the demands of real problems, and the critical aspect of the timing of communications events is not accounted for in these approaches.\nThis book gathers papers from leading researchers to provide both background to the problems and a description of cutting-edge methodology. The contributors are from diverse institutions and areas of expertise and were brought together at a workshop held at the University of Bristol in March 2013 to address the issues of network cyber security. The workshop was supported by the Heilbronn Institute for Mathematical Research.\nReadership: Researchers and graduate students in the fields of network traffic data analysis and network cyber security.",
    "name": "Data Analysis For Network Cyber-Security",
    "category": "Security"
  },
  {
    "author": "Nataliia Bielova",
    "pages": 240,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1436/0455a25e74101d0.jpeg",
    "download_link_epub": null,
    "ISBN": "978-3319156170",
    "download_link_pdf": "http://file.allitebooks.com/20150712/Engineering Secure Software and Systems.pdf",
    "year": "2015",
    "language": "English",
    "price": 30,
    "description": "This book constitutes the refereed proceedings of the 7th International Symposium on Engineering Secure Software and Systems, ESSoS 2015, held in Milan, Italy, in March 2015. The 11 full papers presented together with 5 short papers were carefully reviewed and selected from 41 submissions. The symposium features the following topics: formal methods; cloud passwords; machine learning; measurements ontologies; and access control.",
    "name": "Engineering Secure Software and Systems",
    "category": "Security"
  },
  {
    "author": "Marie-Helen Maras",
    "pages": 373,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1438/4755bb6f695d9ff.jpeg",
    "download_link_epub": null,
    "ISBN": "1466594446",
    "download_link_pdf": "http://file.allitebooks.com/20150731/Transnational Security.pdf",
    "year": "2014",
    "language": "English",
    "price": 133,
    "description": "Globalization and the easy movement of people, weapons, and toxins across borders has transformed security into a transnational phenomenon. Preventing transnational security threats has proven to be a very difficult challenge for governments and institutions around the world. Transnational Security addresses these issues, which are at the forefront of every global security professional’s agenda.\nThis book analyzes the most pressing current transnational security threats, including weapons of mass destruction, terrorism, organized crime, cybercrime, natural disasters, human-made disasters, infectious diseases, food insecurity, water insecurity, and energy insecurity. It considers the applicable international laws and examines how key international organizations are dealing with these issues.\nThe author uses a combination of theory and real-world examples to illustrate the transnational nature of security risks. By providing a detailed account of the different threats, countermeasures, and their implications for a number of different fields—law, public policy and administration, security, and criminology—this book will be an extremely useful resource for academicians, practitioners, and graduate and upper-level undergraduate students in these areas.",
    "name": "Transnational Security",
    "category": "Security"
  },
  {
    "author": "Neil Broom",
    "pages": 336,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1438/0255b7b437b936e.jpeg",
    "download_link_epub": null,
    "ISBN": "0470931663",
    "download_link_pdf": "http://file.allitebooks.com/20150728/Computer Forensics JumpStart, 2nd Edition.pdf",
    "year": "2011",
    "language": "English",
    "price": 117,
    "description": "Essential reading for launching a career in computer forensics<br />\nInternet crime is on the rise, catapulting the need for computer forensics specialists. This new edition presents you with a completely updated overview of the basic skills that are required as a computer forensics professional. The author team of technology security veterans introduces the latest software and tools that exist and they review the available certifications in this growing segment of IT that can help take your career to a new level. A variety of real-world practices take you behind the scenes to look at the root causes of security attacks and provides you with a unique perspective as you launch a career in this fast-growing field.\nExplores the profession of computer forensics, which is more in demand than ever due to the rise of Internet crime<br />\nDetails the ways to conduct a computer forensics investigation<br />\nHighlights tips and techniques for finding hidden data, capturing images, documenting your case, and presenting evidence in court as an expert witness<br />\nWalks you through identifying, collecting, and preserving computer evidence<br />\nExplains how to understand encryption and examine encryption files<br />\nComputer Forensics JumpStart is the resource you need to launch a career in computer forensics.",
    "name": "Computer Forensics JumpStart, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Joseph Steinberg",
    "pages": 456,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1437/8255ae3cb6a5021.jpeg",
    "download_link_epub": null,
    "ISBN": "1466578955",
    "download_link_pdf": "http://file.allitebooks.com/20150721/Official (ISC)2 Guide to the CISSP-ISSMP CBK, Second Edition.pdf",
    "year": "2015",
    "language": "English",
    "price": 140,
    "description": "The Certified Information Systems Security Professional-Information Systems Security Management Professional (CISSP-ISSMP®) certification was developed for CISSPs who are seeking to further their careers and validate their expertise in information systems security management. Candidates for the ISSMP need to demonstrate a thorough understanding of the five domains of the ISSMP Common Body of Knowledge (CBK®), along with the ability to apply this in-depth knowledge to establish, present, and govern information security programs, while demonstrating management and leadership skills.\nSupplying an authoritative review of key concepts and requirements, the Official (ISC)2® Guide to the CISSP®-ISSMP® CBK®, Second Edition is both up to date and relevant. This book provides a comprehensive review of the five domains in the ISSMP CBK: Security Leadership and Management, Security Lifecycle Management, Security Compliance Management, Contingency Management, and Law, Ethics, and Incident Management.\nNumerous illustrated examples and practical exercises are included in this book to demonstrate concepts and real-life scenarios. Endorsed by (ISC)2 and compiled and reviewed by ISSMPs and industry luminaries around the world, this book provides unrivaled preparation for the exam. Earning your ISSMP is a deserving achievement that should ultimately help to enhance your career path and give you a competitive advantage.",
    "name": "Official (ISC)2 Guide to the CISSP-ISSMP CBK, Second Edition",
    "category": "Certification"
  },
  {
    "author": "Laura Chappell",
    "pages": 986,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1437/0255b321b7299bf.jpeg",
    "download_link_epub": null,
    "ISBN": "1893939944",
    "download_link_pdf": "http://file.allitebooks.com/20150724/Wireshark Network Analysis- The Official Wireshark Certified Network Analyst Study Guide, 2nd Edition.pdf",
    "year": "2012",
    "language": "English",
    "price": 75,
    "description": "Wireshark is the world s most popular network analyzer tool with over 500,000 downloads per month. This book provides insider tips and tricks to spot performance issues fastno more finger pointing because the packets never lie! FromDeath by DatabasetoTroubleshooting Time Syncing,49 case studies offer insight into performance and security situations solved with Wireshark.\nLearn to customize Wireshark for faster and more accurate analysis of your network traffic. Build graphs to identify and expose issues such as packet loss, receiver congestion, slow server response, network queuing and more.\nThis book is the Official Study Guide for the Wireshark Certified Network Analyst program.\nThis Second Edition includes an introduction to IPv6, ICMPv6 and DHCPv6 analysis, updated Wireshark functionality and new trace files. Refer to wiresharkbook.com for book supplements, index, table of contents and more.",
    "name": "Wireshark Network Analysis, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Kevin Cardwell",
    "pages": 430,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec04c36774.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78328-477-1, 1783284773",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Building Virtual Pentesting Labs for Advanced Penetration Testing.pdf",
    "year": "2014",
    "language": "English",
    "price": 106,
    "description": "A penetration test, also known as pentest, is a method of assessing computer and network security by replicating an attack on a computer system or network from the outside world and internal threats. With the increase of advanced hackers and threats to our virtual world, pentesting is an absolute necessity.\nBuilding Virtual Pentesting Labs for Advanced Penetration Testing will teach you how to build your own labs and give you a proven process to test these labs; a process that is currently used in industry by global pentesting teams. You will also learn a systematic approach to professional security testing, building routers, firewalls, and web servers to hone your pentesting skills.\nWhat you will learn from this book<br />\n* Build routers, firewalls, and web servers to hone your pentesting skills<br />\n* Deploy and then find the weaknesses in a firewall architecture<br />\n* Construct a layered architecture and perform a systematic process and methodology to use for conducting an external test<br />\n* Get introduced to several of the different security testing methodologies<br />\n* Design monitored environments and evade them<br />\n* Create complex architecture<br />\n* Bypass antivirus and other protection<br />\n* Practice methods of evasion against today s top defenses<br />\n* Leverage the client configuration\nApproach<br />\nWritten in an easy-to-follow approach using hands-on examples, this book helps you create virtual environments for advanced penetration testing, enabling you to build a multi-layered architecture to include firewalls, IDS/IPS, web application firewalls, and endpoint protection, which is essential in the penetration testing world.\nWho this book is written for<br />\nIf you are a penetration tester, security consultant, security test engineer, or analyst who wants to practice and perfect penetration testing skills by building virtual pentesting labs in varying industry scenarios, this is the book for you. This book is ideal if you want to build and enhance your existing pentesting methods and skills. Basic knowledge of network security features is expected along with web application testing experience.",
    "name": "Building Virtual Pentesting Labs for Advanced Penetration Testing",
    "category": "Security"
  },
  {
    "author": "MacDonnell Ulsch",
    "pages": 202,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec04231a91.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-83635-4",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Cyber Threat!.pdf",
    "year": "2014",
    "language": "English",
    "price": 59,
    "description": "Cyber Threat! How to Manage the Growing Risk of Cyber Attacks is an in-depth examination of the very real cyber security risks facing all facets of government and industry, and the various factors that must align to maintain information integrity. Written by one of the nation s most highly respected cyber risk analysts, the book describes how businesses and government agencies must protect their most valuable assets to avoid potentially catastrophic consequences. Much more than just cyber security, the necessary solutions require government and industry to work cooperatively and intelligently. This resource reveals the extent of the problem, and provides a plan to change course and better manage and protect critical information.",
    "name": "Cyber Threat!",
    "category": "Security"
  },
  {
    "author": "Mike Shema",
    "pages": 624,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec05728f3d.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-07180-0-150",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Anti-Hacker Tool Kit, 4th Edition.pdf",
    "year": "2014",
    "language": "English",
    "price": 37,
    "description": "Fully revised to include cutting-edge new tools for your security arsenal, Anti-Hacker Tool Kit, Fourth Edition reveals how to protect your network from a wide range of nefarious exploits. You ll get detailed explanations of each tool s function along with best practices for configuration and implementation illustrated by code samples and up-to-date, real-world case studies. This new edition includes references to short videos that demonstrate several of the tools in action. Organized by category, this practical guide makes it easy to quickly find the solution you need to safeguard your system from the latest, most devastating hacks.",
    "name": "Anti-Hacker Tool Kit, 4th Edition",
    "category": "Security"
  },
  {
    "author": "Prabath Siriwardena",
    "pages": 260,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec06623772.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-6818-5",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Advanced API Security.pdf",
    "year": "2014",
    "language": "English",
    "price": 153,
    "description": "Advanced API Security is a complete reference to the next wave of challenges in enterprise securitysecuring public and private APIs.\nAPI adoption in both consumer and enterprises has gone beyond predictions. It has become thecoolestway of exposing business functionalities to the outside world. Both your public and private APIs, need to be protected, monitored and managed. Security is not an afterthought, but API security has evolved a lot in last five years. The growth of standards, out there, has been exponential.",
    "name": "Advanced API Security",
    "category": "Security"
  },
  {
    "author": "Zach Lanier",
    "pages": 576,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec0612efa7.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-60864-7",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Android Hacker-s Handbook.pdf",
    "year": "2014",
    "language": "English",
    "price": 117,
    "description": "As the Android operating system continues to increase its share of the smartphone market, smartphone hacking remains a growing threat. Written by experts who rank among the world s foremost Android security researchers, this book presents vulnerability discovery, analysis, and exploitation tools for the good guys. Following a detailed explanation of how the Android OS works and its overall security architecture, the authors examine how vulnerabilities can be discovered and exploits developed for various system components, preparing you to defend against them.\nIf you are a mobile device administrator, security researcher, Android app developer, or consultant responsible for evaluating Android security, you will find this guide is essential to your toolbox.",
    "name": "Android Hacker&#8217;s Handbook",
    "category": "Security"
  },
  {
    "author": "Gregory J. Touhill",
    "pages": 416,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec03d25fb1.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-88814-8",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Cybersecurity for Executives.pdf",
    "year": "2014",
    "language": "English",
    "price": 143,
    "description": "Practical guide that can be used by executives to make well-informed decisions on cybersecurity issues to better protect their business.\nEmphasizes, in a direct and uncomplicated way, how executives can identify, understand, assess, and mitigate risks associated with cybersecurity issues; CoversWhat to Do When You Get Hacked?including Business Continuity and Disaster Recovery planning, Public Relations, Legal and Regulatory issues, and Notifications and Disclosures; Provides steps for integrating cybersecurity into Strategy; Policy and Guidelines; Change Management and Personnel Management; Identifies cybersecurity best practices that executives can and should use both in the office and at home to protect their vital information.",
    "name": "Cybersecurity for Executives",
    "category": "Security"
  },
  {
    "author": "Nikolay Elenkov",
    "pages": 432,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec05c10035.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-59327-581-5",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Android Security Internals.pdf",
    "year": "2014",
    "language": "English",
    "price": 43,
    "description": "There are more than one billion Android devices in use today, each one a potential target. Unfortunately, many fundamental Android security features have been little more than a black box to all but the most elite security professionalsuntil now.\nIn Android Security Internals, top Android security expert Nikolay Elenkov takes us under the hood of the Android security sysÂ­tem. Elenkov describes Android security archiÂ­tecture from the bottom up, delving into the impleÂ­mentation of major security-related components and subsystems, like Binder IPC, permissions, cryptographic providers, and device administration.",
    "name": "Android Security Internals",
    "category": "Security"
  },
  {
    "author": "Zouheir Trabelsi",
    "pages": 475,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1435/8755976c6950832.jpeg",
    "download_link_epub": null,
    "ISBN": "1466517948",
    "download_link_pdf": "http://file.allitebooks.com/20150703/Network Attacks and Defenses- A Hands-on Approach.pdf",
    "year": "2013",
    "language": "English",
    "price": 38,
    "description": "The attacks on computers and business networks are growing daily, and the need for security professionals who understand how malfeasants perform attacks and compromise networks is a growing requirement to counter the threat. Network security education generally lacks appropriate textbooks with detailed, hands-on exercises that include both offensive and defensive techniques. Using step-by-step processes to build and generate attacks using offensive techniques, Network Attacks and Defenses: A Hands-on Approach enables students to implement appropriate network security solutions within a laboratory environment.\nTopics covered in the labs include:\nContent Addressable Memory (CAM) table poisoning attacks on network switches<br />\nAddress Resolution Protocol (ARP) cache poisoning attacks<br />\nThe detection and prevention of abnormal ARP traffic<br />\nNetwork traffic sniffing and the detection of Network Interface Cards (NICs) running in promiscuous mode<br />\nInternet Protocol-Based Denial-of-Service (IP-based DoS) attacks<br />\nReconnaissance traffic<br />\nNetwork traffic filtering and inspection<br />\nCommon mechanisms used for router security and device hardening<br />\nInternet Protocol Security Virtual Private Network (IPsec VPN) security solution protocols, standards, types, and deployments<br />\nRemote Access IPsec VPN security solution architecture and its design, components, architecture, and implementations<br />\nThese practical exercises go beyond theory to allow students to better anatomize and elaborate offensive and defensive techniques. Educators can use the model scenarios described in this book to design and implement innovative hands-on security exercises. Students who master the techniques in this book will be well armed to counter a broad range of network security threats.",
    "name": "Network Attacks and Defenses: A Hands-on Approach",
    "category": "Security"
  },
  {
    "author": "Justin Seitz",
    "pages": 192,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec05122a70.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-59327-590-7",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Black Hat Python.pdf",
    "year": "2014",
    "language": "English",
    "price": 177,
    "description": "When it comes to creating powerful and effective hacking tools, Python is the language of choice for most security analysts. But just how does the magic happen?\nIn Black Hat Python, the latest from Justin Seitz (author of the best-selling Gray Hat Python), you ll explore the darker side of Python s capabilitieswriting network sniffers, manipulating packets, infecting virtual machines, creating stealthy trojans, and more.\nInsider techniques and creative challenges throughout show you how to extend the hacks and how to write your own exploits.\nWhen it comes to offensive security, your ability to create powerful tools on the fly is indispensable. Learn how in Black Hat Python.",
    "name": "Black Hat Python",
    "category": "Security"
  },
  {
    "author": "Seymour Bosworth",
    "pages": 2000,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec0472fe9a.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-12706-3",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Computer Security Handbook, 6th Edition.pdf",
    "year": "2014",
    "language": "English",
    "price": 193,
    "description": "Computer security touches every part of our daily lives from our computers and connected devices to the wireless signals around us. Breaches have real and immediate financial, privacy, and safety consequences. This handbook has compiled advice from top professionals working in the real world about how to minimize the possibility of computer security breaches in your systems. Written for professionals and college students, it provides comprehensive best guidance about how to minimize hacking, fraud, human error, the effects of natural disasters, and more. This essential and highly-regarded reference maintains timeless lessons and is fully revised and updated with current information on security issues for social networks, cloud computing, virtualization, and more.",
    "name": "Computer Security Handbook, 6th Edition",
    "category": "Security"
  },
  {
    "author": "Nipun Jaswal",
    "pages": 378,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec01f69d67.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78216-222-3",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Mastering Metasploit.pdf",
    "year": "2014",
    "language": "English",
    "price": 118,
    "description": "The Metasploit framework has been around for a number of years and is one of the most widely used tools for carrying out penetration testing on various services.\nThis book is a hands-on guide to penetration testing using Metasploit and covers its complete development. It will help you clearly understand the creation process of various exploits and modules and develop approaches to writing custom functionalities into the Metasploit framework.\nThis book covers a number of techniques and methodologies that will help you learn and master the Metasploit framework.",
    "name": "Mastering Metasploit",
    "category": "Security"
  },
  {
    "author": "Stefan Umit Uygur",
    "pages": 130,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec0158735d.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78328-297-5, 1783282975",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Penetration Testing with BackBox.pdf",
    "year": "2014",
    "language": "English",
    "price": 35,
    "description": "BackBox is an amazing Linux security distribution designed to keep in mind the needs of security and system administration specialists. It has been developed to perform penetration tests and security assessments. Designed to be fast and easy to use while providing a minimal yet complete desktop environment, Backbox comes with its own software repositories and is continually updated to the latest stable version of the most widely used and best-known ethical hacking tools.\nThis book provides an exciting introduction to BackBox Linux in order give you familiarity with and understanding of this amazing Linux security distro, making you feel comfortable with both the subject of pen-testing and BackBox. The book progresses through topics based on standard cases of penetration testing from the initial steps to the final procedures.\nThis book will help you discover the exciting world of penetration testing through a series of step-by-step, practical lessons. Penetration Testing with BackBox is organized into eight chapters. Starting with an introduction to BackBox Linux in order to give you a solid grounding of this amazing Linux security distro, including both its design philosophy and feature set, before moving on to practical tutorials in using BackBox. The book is arranged in a chronological order based on standard cases of penetration testing. For those more experienced in the use of penetration testing tools, each chapter can be read independently, providing a detailed overview of how BackBox will augment your arsenal of tools at each step of the penetration testing process.",
    "name": "Penetration Testing with BackBox",
    "category": "Security"
  },
  {
    "author": "Aditya Gupta",
    "pages": 154,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec0245dd64.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78328-898-4",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Learning Pentesting for Android Devices.pdf",
    "year": "2014",
    "language": "English",
    "price": 163,
    "description": "Android is the most popular mobile smartphone operating system at present, with over a million applications. Every day hundreds of applications are published to the PlayStore, which users from all over the world download and use. Often, these applications have serious security weaknesses in them, which could lead an attacker to exploit the application and get access to sensitive information. This is where penetration testing comes into play to check for various vulnerabilities.\nLearning Pentesting for Android is a practical and hands-on guide to take you from the very basic level of Android Security gradually to pentesting and auditing Android. It is a step-by-step guide, covering a variety of techniques and methodologies that you can learn and use in order to perform real life penetration testing on Android devices and applications.",
    "name": "Learning Pentesting for Android Devices",
    "category": "Security"
  },
  {
    "author": "Georgia Weidman",
    "pages": 528,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec01a78861.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-59327-564-8",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Penetration Testing.pdf",
    "year": "2014",
    "language": "English",
    "price": 163,
    "description": "Penetration testers simulate cyber attacks to find security weaknesses in networks, operating systems, and applications. Information security experts worldwide use penetration techniques to evaluate enterprise defenses.\nIn Penetration Testing, security expert, researcher, and trainer Georgia Weidman introduces you to the core skills and techniques that every pentester needs. Using a virtual machineâ\u0080\u0093based lab that includes Kali Linux and vulnerable operating systems, you ll run through a series of practical lessons with tools like Wireshark, Nmap, and Burp Suite. As you follow along with the labs and launch attacks, you ll experience the key stages of an actual assessment-including information gathering, finding exploitable vulnerabilities, gaining access to systems, post exploitation, and more.",
    "name": "Penetration Testing",
    "category": "Security"
  },
  {
    "author": "Jay Jacobs",
    "pages": 352,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec0383239b.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-79372-5",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Data-Driven Security.pdf",
    "year": "2014",
    "language": "English",
    "price": 71,
    "description": "Security professionals need all the tools at their disposal to increase their visibility in order to prevent security breaches and attacks. This careful guide explores two of the most powerful data analysis and visualization. You ll soon understand how to harness and wield data, from collection and storage to management and analysis as well as visualization and presentation. Using a hands-on approach with real-world examples, this book shows you how to gather feedback, measure the effectiveness of your security methods, and make better decisions.\nEverything in this book will have practical application for information security professionals.",
    "name": "Data-Driven Security",
    "category": "Security"
  },
  {
    "author": "Himanshu Kumar",
    "pages": 116,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec0294e6aa.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78355-099-9",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Learning Nessus for Penetration Testing.pdf",
    "year": "2014",
    "language": "English",
    "price": 176,
    "description": "IT security is a vast and exciting domain, with vulnerability assessment and penetration testing being the most important and commonly performed security activities across organizations today. The Nessus tool gives the end user the ability to perform these kinds of security tests quickly and effectively.\nNessus is a widely used tool for vulnerability assessment, and Learning Nessus for Penetration Testing gives you a comprehensive insight into the use of this tool. This book is a step-by-step guide that will teach you about the various options available in the Nessus vulnerability scanner tool so you can conduct a vulnerability assessment that helps to identify exposures in IT infrastructure quickly and efficiently. This book will also give you an insight into penetration testing and how to conduct compliance checks using Nessus.",
    "name": "Learning Nessus for Penetration Testing",
    "category": "Security"
  },
  {
    "author": "Keith Makan",
    "pages": 150,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec01070ca2.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84969-510-7",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Penetration Testing with the Bash shell.pdf",
    "year": "2014",
    "language": "English",
    "price": 90,
    "description": "This book teaches you to take your problem solving capabilities to the next level with the Bash shell, to assess network and application level security by leveraging the power of the command-line tools available with Kali Linux.\nThe book begins by introducing some of the fundamental bash scripting and information processing tools. Building on this, the next few chapters focus on detailing ways to customize your Bash shell using functionalities such as tab completion and rich text formatting. After the fundamental customization techniques and general purpose tools have been discussed, the book breaks into topics such as the command-line-based security tools in the Kali Linux operating system. The general approach in discussing these tools is to involve general purpose tools discussed in previous chapters to integrate security assessment tools. This is a one stop solution to learn Bash and solve information security problems.",
    "name": "Penetration Testing with the Bash shell",
    "category": "Security"
  },
  {
    "author": "Slava Gomzin",
    "pages": 312,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec0332d235.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-81011-8",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking Point of Sale.pdf",
    "year": "2014",
    "language": "English",
    "price": 193,
    "description": "As recent breaches like Target and Neiman Marcus show, payment card information is involved in more security breaches than any other data type. In too many places, sensitive card data is simply not protected adequately. Hacking Point of Sale is a compelling book that tackles this enormous problem head-on. Exploring all aspects of the problem in detailfrom how attacks are structured to the structure of magnetic strips to point-to-point encryption, and more â\u0080\u0093 it s packed with practical recommendations. This terrific resource goes beyond standard PCI compliance guides to offer real solutions on how to achieve better security at the point of sale.",
    "name": "Hacking Point of Sale",
    "category": "Security"
  },
  {
    "author": "Sebastien Josse",
    "pages": 384,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec00b8843a.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-78731-1",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Practical Reverse Engineering.pdf",
    "year": "2014",
    "language": "English",
    "price": 155,
    "description": "Reverse engineering is the process of analyzing hardware or software and understanding it, without having access to the source code or design documents. Hackers are able to reverse engineer systems and exploit what they find with scary results. Now the good guys can use the same tools to thwart these threats. Practical Reverse Engineering goes under the hood of reverse engineering for security analysts, security engineers, and system programmers, so they can learn how to use these same processes to stop hackers in their tracks.\nThe book covers x86, x64, and ARM (the first book to cover all three); Windows kernel-mode code rootkits and drivers; virtual machine protection techniques; and much more. Best of all, it offers a systematic approach to the material, with plenty of hands-on exercises and real-world examples.",
    "name": "Practical Reverse Engineering",
    "category": "Security"
  },
  {
    "author": "Justin Hutchens",
    "pages": 452,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec02e48c34.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78398-214-1",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Kali Linux Network Scanning Cookbook.pdf",
    "year": "2014",
    "language": "English",
    "price": 58,
    "description": "Kali Linux Network Scanning Cookbook will introduce you to critical scanning concepts. You will be shown techniques associated with a wide range of network scanning tasks that include discovery scanning, port scanning, service enumeration, operating system identification, vulnerability mapping, and validation of identified findings. You will learn how to utilize the arsenal of tools available in Kali Linux to conquer any network environment. You will also be shown how to identify remote services, how to assess security risks, and how various attacks are performed. This immersive guide will also encourage the creation of personally scripted tools and the development of skills required to create them.",
    "name": "Kali Linux Network Scanning Cookbook",
    "category": "Security"
  },
  {
    "author": "Sushil Jajodia",
    "pages": 794,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfe327e5b.jpg",
    "download_link_epub": null,
    "ISBN": "978-3-642-40202-9",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Computer Security - ESORICS 2013.pdf",
    "year": "2013",
    "language": "English",
    "price": 148,
    "description": "This book constitutes the refereed proceedings of the 18th European Symposium on Computer Security, ESORICS 2013, held in Egham, UK, in September 2013.\nThe 43 papers included in the book were carefully reviewed and selected from 242 papers. The aim of ESORICS is to further the progress of research in computer security by establishing a European forum for bringing together researchers in this area, by promoting the exchange of ideas with system developers and by encouraging links with researchers in related areas. The papers cover all topics related to security, privacy and trust in computer systems and networks.",
    "name": "Computer Security &#8211; ESORICS 2013",
    "category": "Security"
  },
  {
    "author": "Wade Alcorn",
    "pages": 648,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec0013805d.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-66209-0",
    "download_link_pdf": "http://file.allitebooks.com/20150521/The Browser Hacker-s Handbook.pdf",
    "year": "2014",
    "language": "English",
    "price": 185,
    "description": "The Browser Hacker s Handbook gives a practical understanding of hacking the everyday web browser and using it as a beachhead to launch further attacks deep into corporate networks. Written by a team of highly experienced computer security experts, the handbook provides hands-on tutorials exploring a range of current attack methods.\nThe web browser has become the most popular and widely used computerprogramin the world. As the gateway to the Internet, it is part of the storefront to any business that operates online, but it is also one of the most vulnerable entry points of any system. With attacks on the rise, companies are increasingly employing browser-hardening techniques to protect the unique vulnerabilities inherent in all currently used browsers.",
    "name": "The Browser Hacker&#8217;s Handbook",
    "category": "Security"
  },
  {
    "author": "Ron Lepofsky",
    "pages": 232,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebff248fc0.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-484201-49-7",
    "download_link_pdf": "http://file.allitebooks.com/20150521/The Manager-s Guide to Web Application Security.pdf",
    "year": "2014",
    "language": "English",
    "price": 175,
    "description": "The Manager s Guide to Web Application Security is a concise, information-packed guide to application security risks every organization faces, written in plain language, with guidance on how to deal with those issues quickly and effectively. Often, security vulnerabilities are difficult to understand and quantify because they are the result of intricate programming deficiencies and highly technical issues. Author and noted industry expert Ron Lepofsky breaks down the technical barrier and identifies many real-world examples of security vulnerabilities commonly found by IT security auditors, translates them into business risks with identifiable consequences, and provides practical guidance about mitigating them.",
    "name": "The Manager&#8217;s Guide to Web Application Security",
    "category": "Security"
  },
  {
    "author": "Adam Shostack",
    "pages": 624,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfed57ea4.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-80999-0",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Threat Modeling.pdf",
    "year": "2014",
    "language": "English",
    "price": 126,
    "description": "Adam Shostack is responsible for security development lifecycle threat modeling at Microsoft and is one of a handful of threat modeling experts in the world. Now, he is sharing his considerable expertise into this unique book. With pages of specific actionable advice, he details how to build better security into the design of systems, software, or services from the outset. You ll explore various threat modeling approaches, find out how to test your designs against threats, and learn effective ways to address threats that have been validated at Microsoft and other top companies.",
    "name": "Threat Modeling",
    "category": "Security"
  },
  {
    "author": "Umesha Nayak",
    "pages": 392,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebff75eac2.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-6382-1",
    "download_link_pdf": "http://file.allitebooks.com/20150521/The InfoSec Handbook.pdf",
    "year": "2014",
    "language": "English",
    "price": 94,
    "description": "The InfoSec Handbook offers the reader an organized layout of information that is easily read and understood. Allowing beginners to enter the field and understand the key concepts and ideas, while still keeping the experienced readers updated on topics and concepts.\nIt is intended mainly for beginners to the field of information security, written in a way that makes it easy for them to understand the detailed content of the book. The book offers a practical and simple view of the security practices while still offering somewhat technical and detailed information relating to security. It helps the reader build a strong foundation of information, allowing them to move forward from the book with a larger knowledge base.",
    "name": "The InfoSec Handbook",
    "category": "Security"
  },
  {
    "author": "Peter Kim",
    "pages": 214,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebffc4d8b9.jpg",
    "download_link_epub": null,
    "ISBN": "1494932636, 9781494932633",
    "download_link_pdf": "http://file.allitebooks.com/20150521/The Hacker Playbook Practical Guide To Penetration Testing.pdf",
    "year": "2014",
    "language": "English",
    "price": 34,
    "description": "Just as a professional athlete doesn’t show up without a solid game plan, ethical hackers, IT professionals, and security researchers should not be unprepared, either. The Hacker Playbook provides them their own game plans. Written by a longtime security professional and CEO of Secure Planet, LLC, this step-by-step guide to the “game” of penetration hacking features hands-on examples and helpful advice from the top of the field.\nThrough a series of football-style “plays,” this straightforward guide gets to the root of many of the roadblocks people may face while penetration testing—including attacking different types of networks, pivoting through security controls, and evading antivirus software.\nFrom “Pregame” research to “The Drive” and “The Lateral Pass,” the practical plays listed can be read in order or referenced as needed. Either way, the valuable advice within will put you in the mindset of a penetration tester of a Fortune 500 company, regardless of your career or level of experience.\nWhether you’re downing energy drinks while desperately looking for an exploit, or preparing for an exciting new job in IT security, this guide is an essential part of any ethical hacker’s library—so there’s no reason not to get in the game.",
    "name": "The Hacker Playbook: Practical Guide To Penetration Testing",
    "category": "Security"
  },
  {
    "author": "Iqbal Muhardianto",
    "pages": 142,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfde0eca8.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78216-923-9",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Cuckoo Malware Analysis.pdf",
    "year": "2013",
    "language": "English",
    "price": 164,
    "description": "Cuckoo Sandbox is a leading open source automated malware analysis system. This means that you can throw any suspicious file at it and, in a matter of seconds, Cuckoo will provide you with some detailed results outlining what said file did when executed inside an isolated environment.\nCuckoo Malware Analysis is a hands-on guide that will provide you with everything you need to know to use Cuckoo Sandbox with added tools like Volatility, Yara, Cuckooforcanari, Cuckoomx, Radare, and Bokken, which will help you to learn malware analysis in an easier and more efficient way.",
    "name": "Cuckoo Malware Analysis",
    "category": "Security"
  },
  {
    "author": "Michael Hale Ligh",
    "pages": 912,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ec00636c36.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-82509-9",
    "download_link_pdf": "http://file.allitebooks.com/20150521/The Art of Memory Forensics.pdf",
    "year": "2014",
    "language": "English",
    "price": 179,
    "description": "Memory forensics is the art of analyzing computer memory (RAM) to solve digital crimes. As a follow-up to the best seller Malware Analyst s Cookbook, experts in the fields of malware, security, and digital forensics bring you a step-by-step guide to memory forensicsnow the most sought after skill in the digital forensics and incident response fields.\nBeginning with introductory concepts and moving toward the advanced, The Art of Memory Forensics: Detecting Malware and Threats in Windows, Linux, and Mac Memory is based on a five day training course that the authors have presented to hundreds of students. It is the only book on the market that focuses exclusively on memory forensics and how to deploy such techniques properly.",
    "name": "The Art of Memory Forensics",
    "category": "Security"
  },
  {
    "author": "Swapnil Deshmukh",
    "pages": 320,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfd91faca.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-07181-7-028",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking Exposed Mobile.pdf",
    "year": "2013",
    "language": "English",
    "price": 72,
    "description": "Hacking Exposed Mobile continues in the great tradition of the Hacking Exposed series, arming business leaders and technology practitioners with an in-depth understanding of the latest attacks and countermeasuresso they can leverage the power of mobile platforms while ensuring that security risks are contained.\nIdentify and evade key threats across the expanding mobile risk landscape. Hacking Exposed Mobile: Security Secrets &amp; Solutions covers the wide range of attacks to your mobile deployment alongside ready-to-use countermeasures. Find out how attackers compromise networks and devices, attack mobile services, and subvert mobile apps. Learn how to encrypt mobile data, fortify mobile platforms, and eradicate malware. This cutting-edge guide reveals secure mobile development guidelines, how to leverage mobile OS features and MDM to isolate apps and data, and the techniques the pros use to secure mobile payment systems.",
    "name": "Hacking Exposed Mobile",
    "category": "Security"
  },
  {
    "author": "Nigel Smart",
    "pages": 244,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfe840c2c.jpg",
    "download_link_epub": null,
    "ISBN": "978-3-319-04041-7, 978-3-319-04042-4, 978-0387001630, 978-0805071665, 978-3642153273, 978-0691147147",
    "download_link_pdf": "http://file.allitebooks.com/20150521/What Is Computer Science.pdf",
    "year": "2014",
    "language": "English",
    "price": 59,
    "description": "This engaging and accessible text addresses the fundamental question: What Is Computer Science? The book showcases a set of representative concepts broadly connected by the theme of information security, for which the presentation of each topic can be treated as aminilecture course, demonstrating how it allows us to solve real problems, as well as how it relates to other subjects. The discussions are further supported by numerous examples and practical hands-on exercises. Features: presents a concise introduction to the study of algorithms and describes how computers work; introduces the concepts of data compression, and error detection and correction; highlights the role of data structures; explores the topic of web-search; reviews both historic and modern cryptographic schemes, examines how a physical system can leak information and discusses the idea of randomness; investigates the science of steganography; provides additional supplementary material at an associated website.",
    "name": "What Is Computer Science?",
    "category": "Security"
  },
  {
    "author": "Willie Pritchett",
    "pages": 296,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfbe97c0e.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84951-738-6",
    "download_link_pdf": "http://file.allitebooks.com/20150521/BackTrack 5 Cookbook.pdf",
    "year": "2012",
    "language": "English",
    "price": 148,
    "description": "Learn to perform penetration tests with BackTrack 5. Nearly 100 recipes designed to teach penetration testing principles and build knowledge of BackTrack 5 Tools. Provides detailed step-by-step instructions on the usage of many of BackTrack s popular and not-sopopular tools. Provide several solutions to escalate privileges on a compromised machine. Provide several solutions to escalate privileges on a compromised machine.",
    "name": "BackTrack 5 Cookbook",
    "category": "Security"
  },
  {
    "author": "Tedi Heriyanto",
    "pages": 392,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfa524b71.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84951-394-4",
    "download_link_pdf": "http://file.allitebooks.com/20150521/BackTrack 4 Assuring Security by Penetration Testing.pdf",
    "year": "2011",
    "language": "English",
    "price": 185,
    "description": "BackTrack 4: Assuring Security by Penetration Testing is a fully focused, structured book providing guidance on developing practical penetration testing skills by demonstrating the cutting-edge hacker tools and techniques in a coherent step-by-step strategy. It offers all the essential lab preparation and testing procedures to reflect real-world attack scenarios from your business perspective in today s digital age.",
    "name": "BackTrack 4: Assuring Security by Penetration Testing",
    "category": "Security"
  },
  {
    "author": "Abhinav Singh",
    "pages": 268,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfaf85120.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84951-742-3",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Metasploit Penetration Testing Cookbook.pdf",
    "year": "2012",
    "language": "English",
    "price": 144,
    "description": "Metasploit software helps security and IT professionals identify security issues, verify vulnerability mitigations, and manage expert-driven security assessments. Capabilities include smart exploitation, password auditing, web application scanning, and social engineering. Teams can collaborate in Metasploit and present their findings in consolidated reports. The goal of the software is to provide a clear understanding of the critical vulnerabilities in any environment and to manage those risks.\nMetasploit Penetration Testing Cookbook targets both professionals and beginners to the framework. The chapters of the book are logically arranged with an increasing level of complexity and cover Metasploit aspects ranging from pre-exploitation to the post-exploitation phase thoroughly. The recipe structure of the book provides a good mix of both theoretical understanding and practical implementation.",
    "name": "Metasploit Penetration Testing Cookbook",
    "category": "Security"
  },
  {
    "author": "Malcolm Harkins",
    "pages": 152,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfb4815ed.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-5113-2",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Managing Risk and Information Security.pdf",
    "year": "2012",
    "language": "English",
    "price": 48,
    "description": "Managing Risk and Information Security: Protect to Enable, an ApressOpen title, describes the changing risk environment and why a fresh approach to information security is needed. Because almost every aspect of an enterprise is now dependent on technology, the focus of IT security must shift from locking down assets to enabling the business while managing and surviving risk. This compact book discusses business risk from a broader perspective, including privacy and regulatory considerations. It describes the increasing number of threats and vulnerabilities, but also offers strategies for developing solutions. These include discussions of how enterprises can take advantage of new and emerging technologiessuch as social media and the huge proliferation of Internet-enabled deviceswhile minimizing risk.",
    "name": "Managing Risk and Information Security",
    "category": "Security"
  },
  {
    "author": "Michael Sikorski",
    "pages": 800,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfaa68ca3.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-59327-290-6",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Practical Malware Analysis.pdf",
    "year": "2012",
    "language": "English",
    "price": 75,
    "description": "Malware analysis is big business, and attacks can cost a company dearly. When malware breaches your defenses, you need to act quickly to cure current infections and prevent future ones from occurring.\nFor those who want to stay ahead of the latest malware, Practical Malware Analysis will teach you the tools and techniques used by professional analysts. With this book as your guide, you ll be able to safely analyze, debug, and disassemble any malicious software that comes your way.",
    "name": "Practical Malware Analysis",
    "category": "Security"
  },
  {
    "author": "Paul Rohmeyer",
    "pages": 288,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfb990f49.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-02780-6",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Cyber Security Policy Guidebook.pdf",
    "year": "2012",
    "language": "English",
    "price": 74,
    "description": "Drawing upon a wealth of experience from academia, industry, and government service, Cyber Security Policy Guidebook details and dissects, in simple language, current organizational cyber security policy issues on a global scaletaking great care to educate readers on the history and current approaches to the security of cyberspace. It includes thorough descriptionsas well as the pros and consof a plethora of issues, and documents policy alternatives for the sake of clarity with respect to policy alone. The Guidebook also delves into organizational implementation issues, and equips readers with descriptions of the positive and negative impact of specific policy choices.",
    "name": "Cyber Security Policy Guidebook",
    "category": "Security"
  },
  {
    "author": "Lee Allen",
    "pages": 414,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfc37c20a.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-84951-774-4",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Advanced Penetration Testing for Highly-Secured Environments.pdf",
    "year": "2012",
    "language": "English",
    "price": 163,
    "description": "Advanced Penetration Testing for Highly-Secured Environments will teach you how to efficiently and effectively ensure the security posture of environments that have been secured using IDS/IPS, firewalls, network segmentation, hardened system configurations and more. The stages of a penetration test are clearly defined and addressed using step-by-step instructions that you can follow on your own virtual lab.\nYou ll learn how to clean up and compile proof of concept, exploit code from the web, advanced web application testing techniques, client side attacks, post exploitation strategies, detection avoidance methods, generation of well defined reports and metrics, and setting up a penetration testing virtual lab that mimics a secured environment.",
    "name": "Advanced Penetration Testing for Highly-Secured Environments",
    "category": "Security"
  },
  {
    "author": "Mark Rhodes-Ousley",
    "pages": 896,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfcd720a7.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-07178-4-351",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Information Security The Complete Reference, 2nd Edition.pdf",
    "year": "2013",
    "language": "English",
    "price": 121,
    "description": "Today s complex world of mobile platforms, cloud computing, and ubiquitous data access puts new security demands on every IT professional. Information Security: The Complete Reference, 2nd Edition is the only comprehensive book that offers vendor-neutral details on all aspects of information protection, with an eye toward the evolving threat landscape. Thoroughly revised and expanded to cover all aspects of modern information securityâ\u0080\u0094from concepts to detailsâ\u0080\u0094this edition provides a one-stop reference equally applicable to the beginner and the seasoned professional.\nFind out how to build a holistic security program based on proven methodology, risk analysis, compliance, and business needs. You ll learn how to successfully protect data, networks, computers, and applications. In-depth chapters cover data protection, encryption, information rights management, network security, intrusion detection and prevention, Unix and Windows security, virtual and cloud security, secure application development, disaster recovery, forensics, and real-world attacks and countermeasures. Included is an extensive security glossary, as well as standards-based references. This is a great resource for professionals and students alike.",
    "name": "Information Security The Complete Reference, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Joseph Muniz",
    "pages": 342,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfc8738b1.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-78216-316-9",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Web Penetration Testing with Kali Linux.pdf",
    "year": "2013",
    "language": "English",
    "price": 62,
    "description": "Kali Linux is built for professional penetration testing and security auditing. It is the next-generation of BackTrack, the most popular open-source penetration toolkit in the world. Readers will learn how to think like real attackers, exploit systems, and expose vulnerabilities.\nEven though web applications are developed in a very secure environment and have an intrusion detection system and firewall in place to detect and prevent any malicious activity, open ports are a pre-requisite for conducting online business. These ports serve as an open door for attackers to attack these applications. As a result, penetration testing becomes essential to test the integrity of web-applications. Web Penetration Testing with Kali Linux is a hands-on guide that will give you step-by-step methods on finding vulnerabilities and exploiting web applications.",
    "name": "Web Penetration Testing with Kali Linux",
    "category": "Security"
  },
  {
    "author": "Kevin Beaver",
    "pages": 408,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebfd40170f.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-118-38093-2",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking For Dummies, 4th Edition.pdf",
    "year": "2013",
    "language": "English",
    "price": 77,
    "description": "The best way to stay safe online is to stop hackers before they attackfirst, by understanding their thinking and second, by ethically hacking your own site to measure the effectiveness of your security. This practical, top-selling guide will help you do both. Fully updated for Windows 8 and the latest version of Linux, Hacking For Dummies, 4th Edition explores the malicious hacker s mindset and helps you develop an ethical hacking plan (also known as penetration testing) using the newest tools and techniques.",
    "name": "Hacking For Dummies, 4th Edition",
    "category": "Security"
  },
  {
    "author": "Tim Mather",
    "pages": 336,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf773bc6e.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-80276-9",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Cloud Security and Privacy.pdf",
    "year": "2009",
    "language": "English",
    "price": 125,
    "description": "You may regard cloud computing as an ideal way for your company to control IT costs, but do you know how private and secure this service really is? Not many people do. With Cloud Security and Privacy, you ll learn what s at stake when you trust your data to the cloud, and what you can do to keep your virtual infrastructure and web applications secure. This book offers you sound advice from three well-known authorities in the tech security world.",
    "name": "Cloud Security and Privacy",
    "category": "Security"
  },
  {
    "author": "Vincent Liu",
    "pages": 482,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf8b3dd1a.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-0717-4064-7",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking Exposed Web Applications, 3rd Edition.pdf",
    "year": "2010",
    "language": "English",
    "price": 92,
    "description": "Protect your Web applications from malicious attacks by mastering the weapons and thought processes of today s hacker. Written by recognized security practitioners and thought leaders, Hacking Exposed Web Applications, Third Edition is fully updated to cover new infiltration methods and countermeasures. Find out how to reinforce authentication and authorization, plug holes in Firefox and IE, reinforce against injection attacks, and secure Web 2.0 features. Integrating security into the Web development lifecycle (SDL) and into the broader enterprise information security program is also covered in this comprehensive resource.",
    "name": "Hacking Exposed Web Applications, 3rd Edition",
    "category": "Security"
  },
  {
    "author": "Richard Stim",
    "pages": 80,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf812bd4a.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4493-9367-0",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Protecting Your Mobile App IP The Mini Missing Manual.pdf",
    "year": "2010",
    "language": "English",
    "price": 33,
    "description": "Learn four costeffective ways to protect the applications you develop for mobile devices. The methods described in this Mini Missing Manual won t stop people from misappropriating your secrets, stealing your name, and copying your code. But if any of those things do happen, you ll have the legal ammunition you need to recover your losses and, in some cases, get money to pay attorney fees. Taking these steps will also reinforce your legal rights in the event that another company wants to acquire your apps.",
    "name": "Protecting Your Mobile App IP: The Mini Missing Manual",
    "category": "Security"
  },
  {
    "author": "Vincent Liu",
    "pages": 512,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf863743e.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-0716-6661-9",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking Exposed Wireless, 2nd Edition.pdf",
    "year": "2010",
    "language": "English",
    "price": 44,
    "description": "Protect your wireless systems from crippling attacks using the detailed security information in this comprehensive volume. Thoroughly updated to cover today s established and emerging wireless technologies, Hacking Exposed Wireless, second edition reveals how attackers use readily available and custom tools to target, infiltrate, and hijack vulnerable systems. This book discusses the latest developments in Wi-Fi, Bluetooth, ZigBee, and DECT hacking, and explains how to perform penetration tests, reinforce WPA protection schemes, mitigate packet injection risk, and lock down Bluetooth and RF devices. Cutting-edge techniques for exploiting Wi-Fi clients, WPA2, cordless phones, Bluetooth pairing, and ZigBee encryption are also covered in this fully revised guide.",
    "name": "Hacking Exposed Wireless, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Terron Williams",
    "pages": 720,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf9f5b345.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-07174-256-6",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Gray Hat Hacking, 3rd Edition.pdf",
    "year": "2011",
    "language": "English",
    "price": 96,
    "description": "This one-of-a-kind guide offers a comprehensive overview of the hacking landscape and is organized in a progressive manner, first giving an update on the latest developments in hacking-related law, useful to everyone in the security field. Next, the book describes the security testing process and covers useful tools and exploit frameworks. The second section is expanded by explaining social engineering, physical, and insider attacks and the latest trends in hacking (Voice over IP and SCADA attacks). The book then explains, from both a code and machine-level perspective, how exploits work and guides you through writing simple exploits. Finally, the authors provide a comprehensive description of vulnerability research and reverse engineering.",
    "name": "Gray Hat Hacking, 3rd Edition",
    "category": "Security"
  },
  {
    "author": "John Viega",
    "pages": 304,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf7c2e4f4.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-52748-8",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Beautiful Security.pdf",
    "year": "2009",
    "language": "English",
    "price": 41,
    "description": "In Beautiful Security, today s security experts offer a collection of essays that describe bold and extraordinary methods to secure computer systems in the face of ever-increasing threats. You ll learn how new and more aggressive security measures workand where they will lead us. This far-reaching discussion takes you into the techniques, technology, ethics, and laws at the center of the biggest revolution in the history of network security.",
    "name": "Beautiful Security",
    "category": "Security"
  },
  {
    "author": "Steven Levy",
    "pages": 528,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf9033484.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4493-8839-3",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hackers.pdf",
    "year": "2010",
    "language": "English",
    "price": 68,
    "description": "Steven Levy s classic book about the original hackers of the computer revolution is now available in a special 25th anniversary edition, with updated material from noteworthy hackers such as Bill Gates, Mark Zuckerberg, Richard Stallman, and Steve Wozniak. Hackers traces the exploits of innovators from the research labs in the late 1950s to the rise of the home computer in the mid-1980s. It s a fascinating story for everyone interested in this seminal period in history.",
    "name": "Hackers",
    "category": "Security"
  },
  {
    "author": "Qiang Qiang",
    "pages": 313,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf722d2a9.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-4704-4496-2",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Fragile networks.pdf",
    "year": "2009",
    "language": "English",
    "price": 83,
    "description": "A unified treatment of the vulnerabilities that exist in real-world network systems-with tools to identify synergies for mergers and acquisitions\nFragile Networks: Identifying Vulnerabilities and Synergies in an Uncertain World presents a comprehensive study of network systems and the roles these systems play in our everyday lives. This book successfully conceptualizes, defines, and constructs mathematically rigorous, computer-based tools for the assessment of network performance and efficiency, along with robustness and vulnerability analysis. The result is a thorough exploration that promotes an understanding of the critical infrastructure of today s network systems, from congested urban transportation networks and supply chain networks under disruption to financial networks and the Internet.",
    "name": "Fragile networks",
    "category": "Security"
  },
  {
    "author": "Chris Eagle",
    "pages": 676,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf9a61d59.jpg",
    "download_link_epub": null,
    "ISBN": "1-59327-289-8, 978-1-59327-289-0, 978-1-59327-178-7, 1-59327-178-6",
    "download_link_pdf": "http://file.allitebooks.com/20150521/The IDA Pro Book.pdf",
    "year": "2011",
    "language": "English",
    "price": 161,
    "description": "No source code? No problem. With IDA Pro, the interactive disassembler, you live in a source code-optional world. IDA can automatically analyze the millions of opcodes that make up an executable and present you with a disassembly. But at that point, your work is just beginning. With The IDA Pro Book, you ll learn how to turn that mountain of mnemonics into something you can actually use.\nHailed by the creator of IDA Pro asprofound, comprehensive, and accurate,the second edition of The IDA Pro Book covers everything from the very first steps to advanced automation techniques. You ll find complete coverage of IDA s new Qt-based user interface, as well as increased coverage of the IDA debugger, the Bochs debugger, and IDA scripting (especially using IDAPython). But because humans are still smarter than computers, you ll even learn how to use IDA s latest interactive and scriptable interfaces to your advantage.",
    "name": "The IDA Pro Book",
    "category": "Security"
  },
  {
    "author": "William Barker",
    "pages": 648,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf9543d80.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-4302-2730-4",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Enterprise Mac Security Mac OS X Snow Leopard, 2nd Edition.pdf",
    "year": "2010",
    "language": "English",
    "price": 63,
    "description": "A common misconception in the Mac community is that Mac s operating system is more secure than others. While this might be true in certain cases, security on the Mac is still a crucial issue. When sharing is enabled or remote control applications are installed, Mac OS X faces a variety of security threats.\nEnterprise Mac Security: Mac OS X Snow Leopard is a definitive, expert-driven update of the popular, slash-dotted first edition and was written in part as a companion to the SANS Institute course for Mac OS X. It contains detailed Mac OS X security information, and walkthroughs on securing systems, including the new Snow Leopard operating system.\nUsing the SANS Institute course as a sister, this book caters to both the beginning home user and the seasoned security professional not accustomed to the Mac, establishing best practices for Mac OS X for a wide audience.",
    "name": "Enterprise Mac Security: Mac OS X Snow Leopard, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Ryan Trost",
    "pages": 480,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf5e50b88.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-321-59180-7",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Practical Intrusion Analysis.pdf",
    "year": "2009",
    "language": "English",
    "price": 159,
    "description": "Recently, powerful innovations in intrusion detection and prevention have evolved in response to emerging threats and changing business environments. However, security practitioners have found little reliable, usable information about these new IDS/IPS technologies. In Practical Intrusion Analysis, one of the field s leading experts brings together these innovations for the first time and demonstrates how they can be used to analyze attacks, mitigate damage, and track attackers.",
    "name": "Practical Intrusion Analysis",
    "category": "Security"
  },
  {
    "author": "ISECOM",
    "pages": 813,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf4f75366.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-0722-6257-5",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking Exposed Linux, 3rd Edition.pdf",
    "year": "2008",
    "language": "English",
    "price": 138,
    "description": "This authoritative guide will help you secure your Linux networkwhether you use Linux as a desktop OS, for Internet services, for telecommunications, or for wireless services. Completely rewritten the ISECOM way, Hacking Exposed Linux, Third Edition provides the most up-to-date coverage available from a large team of topic-focused experts. The book is based on the latest ISECOM security research and shows you, in full detail, how to lock out intruders and defend your Linux systems against catastrophic attacks.",
    "name": "Hacking Exposed Linux, 3rd Edition",
    "category": "Security"
  },
  {
    "author": "Martin Nystrom",
    "pages": 256,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf5954aa4.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-51816-5",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Security Monitoring.pdf",
    "year": "2009",
    "language": "English",
    "price": 189,
    "description": "How well does your enterprise stand up against today s sophisticated security threats? In this book, security experts from Cisco Systems demonstrate how to detect damaging security incidents on your global networkfirst by teaching you which assets you need to monitor closely, and then by helping you develop targeted strategies and pragmatic techniques to protect them. These recommendations will help you select and deploy the very best tools to monitor your own enterprise network.",
    "name": "Security Monitoring",
    "category": "Security"
  },
  {
    "author": "Walter Pearce",
    "pages": 329,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf4059410.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-59749-237-9",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Reverse Engineering Code with IDA Pro.pdf",
    "year": "2008",
    "language": "English",
    "price": 159,
    "description": "If you want to master the art and science of reverse engineering code with IDA Pro for security R&amp;D or software debugging, this is the book for you. Highly organized and sophisticated criminal entities are constantly developing more complex, obfuscated, and armored viruses, worms, Trojans, and botnets. IDA Pro s interactive interface and programmable development language provide you with complete control over code disassembly and debugging. This is the only book which focuses exclusively on the world s most powerful and popular took for reverse engineering code.",
    "name": "Reverse Engineering Code with IDA Pro",
    "category": "Security"
  },
  {
    "author": "Sean Bodmer",
    "pages": 400,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf684663e.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-0715-9119-5",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking Exposed Malware and Rootkits.pdf",
    "year": "2009",
    "language": "English",
    "price": 68,
    "description": "Providing real-world attacks and detailed countermeasures, this new volume is a comprehensive guide to theblack artof malware and rootkits. You will learn how to identify and defend against malicious software and dangerous hidden scripts. The book includes practical examples, case studies, and risk ratingsall in the bestselling Hacking Exposed format.\nHacking Exposed: Malware &amp; Rootkits walks you through the processes of analyzing malicious software from start to finish. The book covers different kinds of malware and rootkits, methods of infection, and the latest detection and prevention technologies.",
    "name": "Hacking Exposed Malware and Rootkits",
    "category": "Security"
  },
  {
    "author": "John Viega",
    "pages": 264,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf5467bf4.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-52302-2",
    "download_link_pdf": "http://file.allitebooks.com/20150521/The Myths of Security.pdf",
    "year": "2009",
    "language": "English",
    "price": 126,
    "description": "If you think computer security has improved in recent years, Myths of Security will shake you out of your complacency. Longtime security professional John Viega reports on the sorry state of security, with concrete suggestions for professionals and individuals confronting the issue. Provocative, insightful, and often controversial, The Myths of Security addresses IT professionals who deal with security issues, and speaks to Mac and PC users who spend time online.",
    "name": "The Myths of Security",
    "category": "Security"
  },
  {
    "author": "Jon Erickson",
    "pages": 488,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf456df77.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-59327-144-2",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking, 2nd Edition.pdf",
    "year": "2008",
    "language": "English",
    "price": 97,
    "description": "Hacking is the art of creative problem solving, whether that means finding an unconventional solution to a difficult problem or exploiting holes in sloppy programming. Many people call themselves hackers, but few have the strong technical foundation needed to really push the envelope.\nRather than merely showing how to run existing exploits, author Jon Erickson explains how arcane hacking techniques actually work. To share the art and science of hacking in a way that is accessible to everyone, Hacking: The Art of Exploitation, 2nd Edition introduces the fundamentals of C programming from a hacker s perspective.",
    "name": "Hacking, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Himanshu Dwivedi",
    "pages": 232,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf4a75404.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-59327-163-3",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking VoIP.pdf",
    "year": "2008",
    "language": "English",
    "price": 72,
    "description": "Voice over Internet Protocol (VoIP) networks have freed users from the tyranny of big telecom, allowing people to make phone calls over the Internet at very low or no cost. But while VoIP is easy and cheap, it s notoriously lacking in security. With minimal effort, hackers can eavesdrop on conversations, disrupt phone calls, change caller IDs, insert unwanted audio into existing phone calls, and access sensitive information.\nHacking VoIP takes a dual approach to VoIP security, explaining its many security holes to hackers and administrators. If you re serious about security, and you either use or administer VoIP, you should know where VoIP s biggest weaknesses lie and how to shore up your security. And if your intellectual curiosity is leading you to explore the boundaries of VoIP, Hacking VoIP is your map and guidebook.",
    "name": "Hacking VoIP",
    "category": "Security"
  },
  {
    "author": "David Cowen",
    "pages": 544,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf6d3c192.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-0716-2677-4",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking Exposed Computer Forensics, 2nd Edition.pdf",
    "year": "2009",
    "language": "English",
    "price": 53,
    "description": "Identify and investigate computer criminals of all stripes with help from this fully updated. real-world resource. Hacking Exposed Computer Forensics, Second Edition explains how to construct a high-tech forensic lab, collect prosecutable evidence, discover e-mail and system file clues, track wireless activity, and recover obscured documents. Learn how to re-create an attacker s footsteps, communicate with counsel, prepare court-ready reports, and work through legal and organizational challenges. Case studies straight from today s headlines cover IP theft, mortgage fraud, employee misconduct, securities fraud, embezzlement, organized crime, and consumer fraud cases.",
    "name": "Hacking Exposed Computer Forensics, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Stuart McClure",
    "pages": 720,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf6354197.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-0716-1374-3",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking Exposed, 6th Edition.pdf",
    "year": "2009",
    "language": "English",
    "price": 118,
    "description": "Meet the formidable demands of security in today s hyperconnected world with expert guidance from the world-renowned Hacking Exposed team. Following the time-testedattack-countermeasurephilosophy, this 10th anniversary edition has been fully overhauled to cover the latest insidious weapons in the hacker s extensive arsenal.\nNew and updated material!",
    "name": "Hacking Exposed, 6th Edition",
    "category": "Security"
  },
  {
    "author": "Christopher Wells",
    "pages": 256,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf223da78.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-52931-4",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Securing Ajax Applications.pdf",
    "year": "2007",
    "language": "English",
    "price": 56,
    "description": "Ajax applications should be open yet secure. Far too often security is added as an afterthought. Potential flaws need to be identified and addressed right away. This book explores Ajax and web application security with an eye for dangerous gaps and offers ways that you can plug them before they become a problem. Learn how to build secure Ajax applications and discover how to respond quickly when attacks occur.",
    "name": "Securing Ajax Applications",
    "category": "Security"
  },
  {
    "author": "Paco Hope",
    "pages": 314,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf3b50bf8.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-51483-9",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Web Security Testing Cookbook.pdf",
    "year": "2008",
    "language": "English",
    "price": 53,
    "description": "Among the tests you perform on web applications, security testing is perhaps the most important, yet it s often the most neglected. The recipes in the Web Security Testing Cookbook demonstrate how developers and testers can check for the most common web security issues, while conducting unit tests, regression tests, or exploratory tests. Unlike ad hoc security assessments, these recipes are repeatable, concise, and systematic-perfect for integrating into your regular test suite.",
    "name": "Web Security Testing Cookbook",
    "category": "Security"
  },
  {
    "author": "Peter Thermos",
    "pages": 384,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf1d3fe3e.jpg",
    "download_link_epub": null,
    "ISBN": "0-321-43734-9, 0-321-43734-1, 978-0321437341",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Securing VoIP Networks.pdf",
    "year": "2007",
    "language": "English",
    "price": 121,
    "description": "In Securing VoIP Networks,two leading experts systematically review the security risks and vulnerabilities associated with VoIP networks and offer proven, detailed recommendations for securing them. Drawing on case studies from their own fieldwork, the authors address VoIP security from the perspective of real-world network implementers, managers, and security specialists. The authors identify key threats to VoIP networks, including eavesdropping, unauthorized access, denial of service, masquerading, and fraud; and review vulnerabilities in protocol design, network architecture, software, and system configuration that place networks at risk. They discuss the advantages and tradeoffs associated with protection mechanisms built into SIP, SRTP, and other VoIP protocols; and review key management solutions such as MIKEY and ZRTP. Next, they present a complete security framework for enterprise VoIP networks, and provide detailed architectural guidance for both service providers and enterprise users.",
    "name": "Securing VoIP Networks",
    "category": "Security"
  },
  {
    "author": "Nancy Altholz",
    "pages": 380,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf273ed61.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-471-91710-6",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Rootkits For Dummies.pdf",
    "year": "2007",
    "language": "English",
    "price": 149,
    "description": "A rootkit is a type of malicious software that gives the hacker root or administrator access to your network. They are activated before your system s operating system has completely booted up, making them extremely difficult to detect. Rootkits allow hackers to install hidden files, processes, and hidden user accounts. Hackers can use them to open back doors in order to intercept data from terminals, connections, and keyboards. A rootkit hacker can gain access to your systems and stay there for years, completely undetected.\nLearn from respected security experts and Microsoft Security MVPs how to recognize rootkits, get rid of them, and manage damage control.",
    "name": "Rootkits For Dummies",
    "category": "Security"
  },
  {
    "author": "Chris McNab",
    "pages": 512,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf2c28d39.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-51030-5",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Network Security Assessment, 2nd Edition.pdf",
    "year": "2007",
    "language": "English",
    "price": 108,
    "description": "Network Security Assessment provides you with the tricks and tools professional security consultants use to identify and assess risks in Internet-based networks-the same penetration testing model they use to secure government, military, and commercial networks. With this book, you can adopt, refine, and reuse this testing model to design and deploy networks that are hardened and immune from attack.",
    "name": "Network Security Assessment, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Vlad Pirogov",
    "pages": 365,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf0e265f8.jpg",
    "download_link_epub": null,
    "ISBN": "1931769516",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Disassembling Code IDA Pro and SoftICE.pdf",
    "year": "2006",
    "language": "English",
    "price": 76,
    "description": "This book describes how software code analysis tools such as IDA Pro are used to disassemble programs written in high-level languages and recognize different elements of disassembled code in order to debug applications in less time. Also described are the basics of Assembly language programming (MASM) and the system and format of commands for the Intel microprocessor. Aspects of disassembling, analyzing, and debugging software code are considered in detail, and an overview of contemporary disassemblers and debuggers used when analyzing executable code is provided. The basics of working with these tools and their operating principles are also included, and emphasis is placed on analyzing software code and identifying the main structure of those languages in which they were written.",
    "name": "Disassembling Code: IDA Pro and SoftICE",
    "category": "Security"
  },
  {
    "author": "Steve Manzuik",
    "pages": 864,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf13537f9.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-00963-2",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Security Power Tools.pdf",
    "year": "2007",
    "language": "English",
    "price": 72,
    "description": "What if you could sit down with some of the most talented security engineers in the world and ask any network security question you wanted? Security Power Tools lets you do exactly that! Members of Juniper NetworksSecurity Engineering team and a few guest experts reveal how to use, tweak, and push the most popular network security applications, utilities, and tools available using Windows, Linux, Mac OS X, and Unix platforms.",
    "name": "Security Power Tools",
    "category": "Security"
  },
  {
    "author": "Joel Scambray",
    "pages": 451,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf313d0cc.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-0714-9426-7",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking Exposed Windows, 3rd Edition.pdf",
    "year": "2007",
    "language": "English",
    "price": 83,
    "description": "Meet the challenges of Windows security with the exclusive Hacking Exposedattack-countermeasureapproach. Learn how real-world malicious hackers conduct reconnaissance of targets and then exploit common misconfigurations and software flaws on both clients and servers. See leading-edge exploitation techniques demonstrated, and learn how the latest countermeasures in Windows XP, Vista, and Server 2003/2008 can mitigate these attacks. Get practical advice based on the authors and contributors many years as security professionals hired to break into the world s largest IT infrastructures.",
    "name": "Hacking Exposed Windows, 3rd Edition",
    "category": "Security"
  },
  {
    "author": "Zane Lackey",
    "pages": 258,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf363b0f1.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-0714-9461-8",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Hacking Exposed Web 2.0.pdf",
    "year": "2007",
    "language": "English",
    "price": 134,
    "description": "Protect your Web 2.0 architecture against the latest wave of cybercrime using expert tactics from Internet security professionals. Hacking Exposed Web 2.0 shows how hackers perform reconnaissance, choose their entry point, and attack Web 2.0based services, and reveals detailed countermeasures and defense techniques. You ll learn how to avoid injection and buffer overflow attacks, fix browser and plug-in flaws, and secure AJAX, Flash, and XML-driven applications. Real-world case studies illustrate social networking site weaknesses, cross-site attack methods, migration vulnerabilities, and IE shortcomings.",
    "name": "Hacking Exposed Web 2.0",
    "category": "Security"
  },
  {
    "author": "Andrew Jaquith",
    "pages": 336,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf1846c3f.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-321-34998-9",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Security Metrics.pdf",
    "year": "2007",
    "language": "English",
    "price": 189,
    "description": "Security Metrics is the first comprehensive best-practice guide to defining, creating, and utilizing security metrics in the enterprise.\nUsing sample charts, graphics, case studies, and war stories, Yankee Group Security Expert Andrew Jaquith demonstrates exactly how to establish effective metrics based on your organization s unique requirements. You ll discover how to quantify hard-to-measure security activities, compile and analyze all relevant data, identify strengths and weaknesses, set cost-effective priorities for improvement, and craft compelling messages for senior management.",
    "name": "Security Metrics",
    "category": "Security"
  },
  {
    "author": "Pavol Cerven",
    "pages": 251,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebef489ef8.jpg",
    "download_link_epub": null,
    "ISBN": "978-1-88641-179-1",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Crackproof Your Software.pdf",
    "year": "2002",
    "language": "English",
    "price": 154,
    "description": "This essential resource for software developers highlights the weak points inwell-protectedsoftware, shows how crackers break common protection schemes, and how to defend against crackers. Includes in-depth discussions of anti-debugging and anti-disassembling.",
    "name": "Crackproof Your Software",
    "category": "Security"
  },
  {
    "author": "Pravir Chandra",
    "pages": 384,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebeef812fb.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-00270-1",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Network Security with OpenSSL.pdf",
    "year": "2002",
    "language": "English",
    "price": 44,
    "description": "OpenSSL is a popular and effective open source version of SSL/TLS, the most widely used protocol for secure network communications. The only guide available on the subject, Network Security with OpenSSLdetails the challenges in securing network communications, and shows you how to use OpenSSL tools to best meet those challenges. Focused on the practical, this book provides only the information that is necessary to use OpenSSL safely and effectively.",
    "name": "Network Security with OpenSSL",
    "category": "Security"
  },
  {
    "author": "John Canavan",
    "pages": 219,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebeea6df04.jpg",
    "download_link_epub": null,
    "ISBN": "1-58053-176-8",
    "download_link_pdf": "http://file.allitebooks.com/20150521/The Fundamentals of Network Security.pdf",
    "year": "2001",
    "language": "English",
    "price": 95,
    "description": "Here s a practical book that introduces fundamental network security concepts, principles, and terms. It helps you identify the best type of intrusion detection system, develop organizational guidelines for passwords, set computer security policies, and perform a security review and risk assessment.",
    "name": "The Fundamentals of Network Security",
    "category": "Security"
  },
  {
    "author": "Simson Garfinkel",
    "pages": 336,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebee55e1b9.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-596-00105-6",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Database Nation.pdf",
    "year": "2000",
    "language": "English",
    "price": 71,
    "description": "As the 21st century begins, advances in technology endanger our privacy in ways never before imagined. This newly revised update of the popular hardcover edition, Database Nation: The Death of Privacy in the 21st Century, is the compelling account of how invasive technologies will affect our lives in the coming years. It s a timely, far-reaching, entertaining, and thought-provoking look at the serious threats to privacy facing us today.",
    "name": "Database Nation",
    "category": "Security"
  },
  {
    "author": "Ronald Krutz",
    "pages": 697,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebefebe1a8.jpg",
    "download_link_epub": null,
    "ISBN": "0-7645-7397-7",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Network Security Bible.pdf",
    "year": "2005",
    "language": "English",
    "price": 124,
    "description": "* A must for working network and security professionals as well as anyone in IS seeking to build competence in the increasingly important field of security\n* Written by three high-profile experts, including Eric Cole, an ex-CIA security guru who appears regularly on CNN and elsewhere in the media, and Ronald Krutz, a security pioneer who cowrote The CISSP Prep Guide and other security bestsellers\n* Covers everything from basic security principles and practices to the latest security threats and responses, including proven methods for diagnosing network vulnerabilities and insider secrets for boosting security effectiveness",
    "name": "Network Security Bible",
    "category": "Security"
  },
  {
    "author": "Bruce Schneier",
    "pages": 662,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebee066ef7.jpg",
    "download_link_epub": null,
    "ISBN": "978-0471117094",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Applied Cryptography, 2nd Edition.pdf",
    "year": "1996",
    "language": "English",
    "price": 113,
    "description": "This new edition of the cryptography classic provides you with a comprehensive survey of modern cryptography. The book details how programmers and electronic communications professionals can use cryptography-the technique of enciphering and deciphering messages-to maintain the privacy of computer data. It describes dozens of cryptography algorithms, gives practical advice on how to implement them into cryptographic software, and shows how they can be used to solve security problems. Covering the latest developments in practical cryptographic techniques, this new edition shows programmers who design computer applications, networks, and storage systems how they can build security into their software and systems.",
    "name": "Applied Cryptography, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Peter Gregory",
    "pages": 292,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebef98b5cd.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-7645-7418-4",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Computer Viruses For Dummies.pdf",
    "year": "2004",
    "language": "English",
    "price": 95,
    "description": "Computer virusesjust the thought of your trusty PC catching one is probably enough to make you sick. Thanks to the cyber-sickies who persist in coming up with new strains, there s a major new cyberattack nearly every day. Viruses sneak in, usually through e-mail.\nRemember, if you don t protect your computer, not only do you risk having your computer infiltrated and your data contaminated, you risk unknowingly transmitting a virus, worm, or other foul computer germ to everybody in your address book! This guide will help you properly immunize your PC with antivirus software now and install updates and security patches that are like booster shots to keep your software protected against new viruses.",
    "name": "Computer Viruses For Dummies",
    "category": "Security"
  },
  {
    "author": "Andrew Lockhart",
    "pages": 480,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf08d055e.jpg",
    "download_link_epub": null,
    "ISBN": "978-0-59652-763-1",
    "download_link_pdf": "http://file.allitebooks.com/20150521/Network Security Hacks, 2nd Edition.pdf",
    "year": "2006",
    "language": "English",
    "price": 188,
    "description": "In the fast-moving world of computers, things are always changing. Since the first edition of this strong-selling book appeared two years ago, network security techniques and tools have evolved rapidly to meet new and more sophisticated threats that pop up with alarming regularity. The 2nd edition offers both new and thoroughly updated hacks for Linux, Windows, OpenBSD, and Mac OS X servers that not only enable readers to secure TCP/IP-based services, but helps them implement a good deal of clever host-based security techniques as well.",
    "name": "Network Security Hacks, 2nd Edition",
    "category": "Security"
  },
  {
    "author": "Michael Lucas",
    "pages": 216,
    "picture": "http://www.allitebooks.org/wp-content/uploads/1432/72555ebf03d5bef.jpg",
    "download_link_epub": null,
    "ISBN": "978-1593270711",
    "download_link_pdf": "http://file.allitebooks.com/20150521/PGP - GPG.pdf",
    "year": "2006",
    "language": "English",
    "price": 68,
    "description": "OpenPGP is the most widely used email encryption standard in the world. It is based on PGP (Pretty Good Privacy) as originally developed by Phil Zimmermann. The OpenPGP protocol defines standard formats for encrypted messages, signatures, and certificates for exchanging public keys.\nPGP &amp; GPG is an easy-to read, informal tutorial for implementing electronic privacy on the cheap using the standard tools of the email privacy fieldcommercial PGP and non-commercial GnuPG (GPG). The book shows how to integrate these OpenPGP implementations into the most common email clients and how to use PGP and GPG in daily email correspondence to both send and receive encrypted email.\nThe PGP &amp; GPG book is written for the moderately skilled computer user who is unfamiliar with public key cryptography but who is nevertheless interested in guarding their email privacy. Lucas s trademark informal and relaxed tone makes public key cryptography as simple and clear as possible, so that any reasonably savvy computer user can understand it.",
    "name": "PGP &amp; GPG",
    "category": "Security"
  }
]